{
  "modURL": "https://7daystodiemods.com/0xp-rolmod/",
  "modCreatedTime": "2020-05-15T04:08:00+00:00",
  "modLastUpdatedTime": "2020-05-15T04:09:08+00:00",
  "modName": "0XP RolMod",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/02/xp-multiplier-settings.jpg"
  ],
  "modShortDescription": "Zombies are now an obstacle to your objectives instead of a source of XP income tempting you hunt them down and kill them.",
  "modDescription": "## Zero Experience for Actions\n\nActions in the game are now only valuable for helping you survive and accomplish your goals. There are no XP bonuses attached to individual actions that make killing zombies more valuable than farming or mining or scavenging or building. Zombies are now an obstacle to your objectives instead of a source of XP income tempting you hunt them down and kill them. Use stealth to avoid or weapons to destroy and as long as you survive the day you will get rewarded either way.\n\n## Daily Skill Point for Surviving\n\nGain skill points simply for surviving according to the following schedule:\n\n* After your first and second days of survival, you will gain one skill point each day.\n* On your third and fourth days of survival, you will earn two [skill points](https://7daystodiemods.com/tag/7-days-to-die-skill-points/) each day.\n* After your fifth day of survival and thereafter you will earn 3 skill points per day.\n\nIf you die your penalty will be having to start over with earning 1 then 2 and then 3 skill points and the timer begins fresh from when you respawn so it will take 5 full days of no deaths to regain the highest level of skill point generation.\n\nCosts of attribute and perk progression have been increased to compensate for the increase in skill point gains.\n\n* Attribute costs for levels 2-10 are: 1, 1, 2, 2, 2, 3, 4, 5, 6\n* Perk costs for levels 1-5 are: 1, 1, 2, 3, 5\n\n## Training in Return for Jobs\n\nBeginning with Tier 3 and Tier 4 quests you will be rewarded 1 skill point in addition to the other quest rewards. Tier 5 [quests](https://7daystodiemods.com/tag/7-days-to-die-quests/) will reward you with 2 skill points. This puts an incentive on doing quests in order to progress. Skillpoints are not earned for the tutorial quests nor for Tier 1 and 2 quests.\n\n## Gamestages Based on Time Instead of Actions\n\nGamestages will now progress daily instead of as a result of player actions gaining [XP](https://7daystodiemods.com/tag/7-days-to-die-experience/). Each game day that the player does not suffer a death they will automatically level up which will, in turn, advance the gamestage. The gamestages multipliers have been modified to help compensate for this slower pace of gamestage advancement as follows:\n\n* Scavenger: 1.5\n* Adventurer: 1.8\n* Nomad: 2.2\n* Warrior: 2.5\n* Survivalist: 3.0\n* Insane: 3.5\n\nThese are higher rates than vanilla but leveling up now happens once a day at a regular pace which is slower than most players of the vanilla game. Please note that the only function leveling up has is to advance gamestages. Gaining skill points for player progression advancement is completely separate from player level now and there are no experience points in the game at all.\n\n## Improved Death Ambiguity\n\nBecause there is no XP there is no XP popout which means no giveaway clue that a zombie died with that last hit. But Roland took it several steps further by removing death animations from all zombies, replacing the death sound from all zombies with their stun sound, and increasing the range of time they will utilize to recover from a stun. So now when they die it looks and sounds exactly like it does when they are stunned. The only remaining clue is that big yellow bag that sometimes appears…\n\n## Increased Zombie Loot Drops\n\nSince there is no longer XP for killing [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) Roland increased the loot drop across the board to 8%.\n\n## Trader Finder Quests\n\nAll of the treasure map quests will now chain into the White River Settlement Quest from the beginning of the game giving the player a chance to find a new [trader](https://7daystodiemods.com/tag/7-days-to-die-trader/). The quest finds the nearest trader to your location which might be a trader you already know but if you are lucky you may get a new trader’s location after digging up that treasure chest. How exciting!\n\n## Brutal Start\n\nThe Newbie protection buff has been removed. There is zero protection from the elements from the get go.\n\n## Get off your Brass\n\nAdded a random 0-3 scrap brass drop to destroyed stone. Need brass? Find the ruins of the old world and start digging through it all for that precious metal. This modlet is completely standalone so can be used alone or deleted without causing any issues.\n\n## Trolland’s Moar Zombies\n\nAdded more zombies to biome spawns as well as larger wandering hordes. Greatly increased nighttime spawns to simulate the lunar influence waking up and causing more zombies to be active. Values are very easy to change if you want to lower or increase the numbers. If you prefer vanilla numbers simply delete this modlet from your mods folder.\n\n## Laz Man’s Horde Night Vanguard Quest\n\nYou now earn a bonus skillpoint for every 100 bloodmoon zombies you kill. You have to directly kill them and it is only bloodmoon zombies that count. In the beginning it might take 2-3 hordenights to fulfill the bounty but later you might earn 3 skillpoints from one hordenight! The quest is automatically started after the tutorial quest and renews itself every time it is fulfilled.\n\n## Instructions\n\nPlease note: You must select 0% in the options menu for the XP multiplier. If you have a saved game using the old version where you selected 2% you will unfortunately have to start a new game because for some reason the saved world remembers and you will start earning xp even though you select 0%. If you play at 100% you are showing a lack of understanding about the point of this mod…\n\n* Step 1: Use [SphereII’s mod launcher](https://community.7daystodie.com/topic/4068-the-7d2d-mod-launcher-a-mod-launcher-for-7-days-to-die/) to load Roland’s mod.\n* Step 2: Remember to select 0% in the main menu options before playing.\n\nIf you are interested in looking at the files or do not wish to use the mod launcher, they are [here](https://github.com/Roland7dtd/0XP-Rolmod). You can download the mods folder and replace it with the one in your 7 days to die folder if you want the entire package. Otherwise you can pick and choose the files you wish to use. The skillpoint generator is SDX and so must be compiled. If you don’t know how to do this using the SDX launcher then it’s best to simply use SphereII’s mod launcher which will do it for you automatically. Instructions [for servers](https://community.7daystodie.com/topic/12762-0xp-rolmod-a18/?do=findComment&comment=243158).\n\n## Changelog\n\nAdded Laz Man’s Horde Night Vanguard Quest.\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/12762-0xp-rolmod-a18/).\n\n**Credits:** Roland  \n_Special Thanks:_ Guppycur, Stompy, SphereII, Laz Man, and all others who helped",
  "modDownloadURLs": [
    {
      "Info": "",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/12762-0xp-rolmod-a18/",
  "modAuthors": [
    "RolandSpecial Thanks: Guppycur",
    "Stompy",
    "SphereII",
    "Laz Man",
    "and all others who helped"
  ],
  "modTags": [
    "7 days to die experience",
    "7 days to die loot",
    "7 days to die perks",
    "7 days to die quests",
    "7 days to die skill points",
    "7 days to die trader",
    "7 days to die zombies"
  ]
}