{
  "modURL": "https://7daystodiemods.com/gnamod-ui/",
  "modCreatedTime": "2020-03-05T07:22:00+00:00",
  "modLastUpdatedTime": "2020-06-03T21:44:52+00:00",
  "modName": "Gnamod UI",
  "modImages": [],
  "modShortDescription": "While creating a new UI for Gnamod Haidrgna realized that most of it was backwards compatible with the 7 Days to Die vanilla game.",
  "modDescription": "While creating a new UI for [Gnamod](https://7daystodiemods.com/gnamod-for-a18/) Haidrgna realized that most of it was backwards compatible with the vanilla game and he also was testing it in there for faster loading (no unity assets to load). So he decided to release the UI as a stand alone version as well. So here is the first publicly released version of Gnamod UI. He hope you will enjoy using it as it cost a great deal of frustration to get every pixel right. (or right enough since not all that he wanted could be done)\n\nThis is still a beta version and will be updated along the other Gnamod’s so there could still be overlooked things in there. There are a bunch of windows left untouched as well, so it is not complete.\n\n## Features\n\n* Changed the backpack to have more slots (11×8) and incorporate the toolbar slots on the top (so shows 12×8 slots, the total amount a person could have on him). NOTE that the item bar on the right displayed on the HUD is only there for display, items cannot be dragged there. Instead the top row is where you can drag stuff to.\n* Changed the toolbar to display on the side in a new style, removed xp bar.\n* Changed HP/Stamina bars to a new style, stamina is green colored.\n* Changed the compass to incorporate the stealth bar, added some stats to the clock (altitude and actual biome temp). Added red marker for center of compass.\n* Changed the crafting list menu to incorporate the output slots on the right, have its list presented as 2 columns so more is visible at once.\n* Changed the recipe window to allow up to 10 ingredients displayed, in tw columns. Condensed the display.\n* Changed the workstations windows to have up to 10 tools, 10 fuel and 10 output items. Planned is to have specialized workstations with more or less slots but with the same style.\n* Changed the forge input window to allow 3 items to be smelted at once (more not possible without a dll change). Condensed the display of melted items.\n* Changed the creative menu to display a lot more items (15×10). Slots are smaller and stack information removed as it is not needed.\n* Changed the item information window and modify window to support 10 mod slots for items, improved the view and hide slots when description is displayed.\n* Changed the character window to display bigger and keep the character visible even if stats are displayed (they are projected around him).\n* Changed the buff display to tell the effects of a buff and displays 10 at once per page. Not all effects seem properly supported yet, in future will see if this can be localized to not use the incode names for effects. Might not be a thing for the vanilla version though.\n* Changed the loot and vehicle storage windows to support up to 15×10 slots. This does not alter the vanilla slot size, but people could alter those to be bigger if needed within these limits.\n* Changed the vehicle info display to be in line with the item info display. Vehicles also support 10 mods, once vehicle mods actually work though .\n* Note that the slot increases are not actual increases to gameplay limits for vanilla or any other mod you might add this too. They are just higher max possible, so you will need to include xpath or mods to make the slots, unlocked backpack slots, storage slots etc for things higher.\n\n## Notes\n\n* The mod has only been tested with Gnamod development versions, some small modlets and the vanilla game. It could conflict with mods that change the UI such as overhauls including their own UI. If a modlet has to modify the UI to work, apply it last to see if it will work, since this significantly changes code.\n* The UI has been designed with 16:9 and 16:10 ratio in mind, a wider ratio should also work, but something more compact will lead to issues where windows will overlap badly.\n\n## Changelog\n\nThe release includes:\n\n* **Player Window:** The player window is now bigger and streamlined with the rest of the UI.\n* **Map Window:** The map window has been enlarged and more space for waypoints around it and the information. Placing waypoints has been made more streamlined as well.\n* **Journal Window:** Completely remade to work with tabs on top showing the header in yellow if unread. Selects the pane with info under it utilizing the entire window to show text. Selected line shows which tab is opened.\n* **Quest Window:** Completely redone to fit the rest of the style and to offer a more streamlined quest management and info window.\n\nAs well as some fixes and improvements to existing windows, most notably the sidebar that was more dark than intended in A18.4.\n\nJust know that Gnamod CoreUI will no longer work with A18.2 or lower anymore, the stable version for A18.3 already did not but some people try it anyway. All of Gnamod should be used with the latest Stable version of the game.\n\n## Installation\n\nThe download contains a zip file that makes installation as easy as possible. All you need to do is extract the contents to the main folder of the installation of 7 days to die you want the mod to apply to. After doing so it should have a Mods in the main directory. In this folder should be a folder Called Gnamod UI (or in future versions Gnamod Core UI). Any other Gnamod mod or modlet you want to add goes here.\n\n**[Download](https://drive.google.com/drive/u/0/folders/1UUIIJ9K1InZxf7M-FcrDfJDGDu3FWxjH)** Latest Versions  \n**[Download](https://drive.google.com/open?id=1kn5WR9jp0nghTlOTvabSHb3MVV1-fcwo)** Older Versions\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/13463-gnamod-ui/).\n\n**Credits:** [Haidrgna](https://7daystodiemods.com/tag/haidrgna/)",
  "modDownloadURLs": [
    {
      "Info": "Latest Versions",
      "URL": "https://drive.google.com/drive/u/0/folders/1UUIIJ9K1InZxf7M-FcrDfJDGDu3FWxjH",
      "Version": "v19"
    },
    {
      "Info": "Older Versions",
      "URL": "https://drive.google.com/open?id=1kn5WR9jp0nghTlOTvabSHb3MVV1-fcwo",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/13463-gnamod-ui/",
  "modAuthors": [
    "Haidrgna"
  ],
  "modTags": [
    "7 days to die backpack",
    "7 days to die bigger backpack",
    "7 days to die gnamod",
    "7 days to die hud mod",
    "7 days to die menu",
    "7 days to die more slots",
    "Haidrgna"
  ]
}