{
  "modURL": "https://7daystodiemods.com/hdhq-overhaul-mod/",
  "modCreatedTime": "2020-01-13T17:40:52+00:00",
  "modLastUpdatedTime": "2020-06-03T22:11:11+00:00",
  "modName": "HDHQ Overhaul Mod",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/01/installation.jpg"
  ],
  "modShortDescription": "DUST2DEATH's 7 Days to Die HDHQ Overhaul Mod is here for you. Better textures, lighting and environment. Gun skins, items, plants, real forests and more.",
  "modDescription": "DUST2DEATH’s 7 Days to Die HDHQ Overhaul Mod is here for you. Better textures, lighting and environment. Gun skins, items, plants, real forests and more.\n\nAs of A17, HDHQ core and Extended have been rolled into one singular mod. It is now more than just textures, so as such DUST2DEATH will be calling it HDHQ overhaul from here forward.\n\nAs this has been such a long project he has spoken to many people over the course of it. Instead of listing people and risking forgetting someone he will say this. If he has spoken to you about anything unity/7days over the last few months, he thank you. For being there to bounce things off, or your advice. Thanks.\n\n## HDHQ Contains\n\n### HDHQ Main Pack in 4K and 2K\n\nCore Lighting and Texture changes.\n\n### Optional Mods\n\n* Biome Overhauls\n* Biome Particle Effects\n* Biome Plants\n* Additional Items\n* Additional Gun Skins\n\n### Available in 2K and 4K\n\nFor A17 he redid all the terrain textures as necessary to bring into line with the new art work the TFP have created. He feel he has achieved a much closer tie to the vanilla textures this time around.\n\nOther changes include Water and Grasses.\n\nMore changes will be following soon.\n\nHe currently still can not get access to the block textures. All block textures are vanilla and will remain so until he has time to rebuild the array (lots of work) or TFP provides a way to sideload.\n\n* Redone Lighting\n* Better Reflections\n* Seamless Biome Transitions\n* Improved Stealth\n\nThe lighting for A17 has been reworked. A great deal of time has been spent to attempt to maintain a global style and colour palette while keeping individual biomes and weather distinct.\n\n* The differences between Reflections on and off have been minimised.\n* The world is now much more vibrant, saturated, contrasted.\n* The Lighting now matters more. Direction and intensity all matter.\n* Biomes Seamless Transition between each other as you move through the world. This is particularly great for RWG worlds.\n* Clear nights have moonlight which is clean and bright. Cloudy nights have a muted moonlight. Rain and Snowfall nights have zero moonlight.\n* As each weather state and its intensity transitions your stealth meter will decrease. Because of the way lighting works in vanilla, the opposite is true.\n* Reflections also get a boost from the new lighting. As such you can turn some settings down if you run reflections and still have better quality than vanilla (imo).\n\nYou will be able to **remove your reshade profiles** you may have applied, only needing to keep it for Sharpness or AA injections.\n\nFurther to reflections. These and certain vanilla block textures in combination will/can \\[again machine dependant\\] cause severe fps loss spikes around buildings. His only advice is to run with reflections off until it is fixed, or I get access to block textures.\n\n* Real Forests\n* Biome Overhaul Packs\n\nReal forests are finally here! To achieve this he had to leverage new features of 2018.2 as well as make all new vegetation for all biomes. He has released these as Biome Overhaul Mods – 2 Separate packs to date.\n\n* Forests Obscure Zombies, and create dark patches around trees zombies like to hide in.\n* Exploration is now more important than before. You will need to get above the canopy in forest areas to scout locations, landmarks and other players bases. Its possible to get turned around in the forest. Making roads, runways and other thoroughfares will be key to faster travelling.\n* You can hide in the trees from vultures, unless they find a path to you.\n* The density of the forest however, will work against you in PvP. Clearing space to build will reveal your location to other players who are scouting from mountain tops or gyro’s. The trees provide cover to attackers who seek your [loot](https://7daystodiemods.com/tag/7-days-to-die-loot/).\n\n### Baseline Biome Overhaul Pack\n\n* He has made these trees very low poly for a starting baseline to guage performance across machines.\n* 10x lighter than vanilla trees. He can render 10+ trees for every vanilla tree.\n* Heavily Optimized – Trees range from 50 – 300 tris.\n* Featuring Jungle Trees, Swamp Palmetto, Desert Cycads, White Thorn Acacia Tree.\n* Alpine – Jungle (Swamp forest) – Burnt – Desert – Wasteland\n* You should have a higher average framerate. In some scenarios he gained as much as 30fps at the same resolution and settings. \\[very much situation and machine dependant\\]\n\n### Redux Biome Overhaul Pack\n\n* These [trees](https://7daystodiemods.com/tag/7-days-to-die-trees/) are 2 – 3x higher tri count than the Baseline Biome Pack.\n* A Vanilla Redux – Snow, Pine, Burnt Pine, Desert, Wasteland\n* Several variations of trees across biomes.\n* Zero Pop Trees – You will only see shadow draw based on your distance setting in options.\n* You should still have a higher average framerate with this pack.\n\n### New Biome Particle Effects\n\nForest, Burnt, Wasteland\n\nNew Lighting means new chances. This little mod introduces new [Biome](https://7daystodiemods.com/tag/7-days-to-die-biomes/) particle effects to the world. Burnt biome and wasteland biomes have different appearances between day, twilight and night. Making for more varied and interesting visuals.\n\n* Falling Leaves in the Pine Forest\n* Rising Smouldering Smoke in the Burnt Forest\n* Radiated Wasteland Fog in the Wasteland\n\n### New Models for Wild Plants\n\nThis mod introduces new models into the game for wild growing plants.\n\n* Goldenrod\n* Chrysanthemum\n* Cotton\n\n### New Items\n\nThis mod adds a new Spotlight and hand held torch with increased range.\n\n* Spotlight has greater range than vanilla, requires no power, same crafting requirements.\n* Torch has twice the [light](https://7daystodiemods.com/tag/7-days-to-die-lights/) casting distance than vanilla. Hand held only.\n* Torch flame particle effect chosen for minimal visual screen flicker during rain – may change in the future.\n\n**New Gun Skins**  \n**5** Anodized  \n**3** Rare  \n**4** Military\n\nHe’s not a fan of the gun tints so for now, as a start he has included 12 new materials for each of the [guns](https://7daystodiemods.com/tag/7-days-to-die-weapons/). He has taken extra care to balance these between reflections on and off. These are whole materials. More refined gun skins will be appearing in the future.\n\n* Anodized Blue\n* Anodized Cyan\n* Anodized Green\n* Anodized Magenta\n* Anodized Red\n* Gold\n* Silver\n* Jade\n* Desert Camo\n* Digital Camo\n* Jungle Armor\n* Winter Armor\n\n## Known Issues\n\n* Guns have placeholder icons\n* Seeds have placeholder icons\n\n## Permissions\n\n### Modification Permission\n\nYou are allowed to modify DUST2DEATH’s files and release bug fixes or improve on the features so long as you credit him as the original creator.\n\n### Asset Use Permission\n\nYou must get permission from DUST2DEATH before you are allowed to use any of the assets in this file. (This means assets individually, seperately from the bundle, extracted with UABE or other tools)\n\n### Asset Use Permission in Mods/Files That Are Being Sold\n\nYou are not allowed to use assets from this file in any mods/files that are being sold, for money, on Steam Workshop or other platforms.\n\n## Installation\n\n### Main Pack – Client Side Only\n\nDon’t install to a dedicated server\n\n* Drag the 2 folders from the archive into your game directory\n* Yes to replace all files.\n\n### Modlets – Client Side & Dedicated Server\n\nInstall to both the client and server\n\n* Create a Mods Folder in the main game directory\n* Copy Modlet folders from archive into the new Mods folder\n\n**[Download](https://gitlab.com/DUST2DEATH/hdhq4kexp/-/archive/master/hdhq4kexp-master.zip)** Main Pack 4K v1.1b  \n**[Download](https://gitlab.com/DUST2DEATH/hdhq2kexp/-/archive/master/hdhq2kexp-master.zip)** Main Pack 2K v1.1b  \n**[Download](https://gitlab.com/DUST2DEATH/hdhqmodlets/-/archive/master/hdhqmodlets-master.zip)** HDHQ Modlets\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/6911-hdhq-textureslightingenvironment/).\n\n**Credits:** [DUST2DEATH](https://7daystodiemods.com/tag/dust2death/)",
  "modDownloadURLs": [
    {
      "Info": "Main Pack 4K v1.1b",
      "URL": "https://gitlab.com/DUST2DEATH/hdhq4kexp/-/archive/master/hdhq4kexp-master.zip",
      "Version": "v19"
    },
    {
      "Info": "Main Pack 2K v1.1b",
      "URL": "https://gitlab.com/DUST2DEATH/hdhq2kexp/-/archive/master/hdhq2kexp-master.zip",
      "Version": "v19"
    },
    {
      "Info": "HDHQ Modlets",
      "URL": "https://gitlab.com/DUST2DEATH/hdhqmodlets/-/archive/master/hdhqmodlets-master.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/6911-hdhq-textureslightingenvironment/",
  "modAuthors": [
    "DUST2DEATH"
  ],
  "modTags": [
    "7 days to die biomes",
    "7 days to die lights",
    "7 days to die textures",
    "7 days to die trees",
    "7 days to die weapons",
    "DUST2DEATH"
  ]
}