{
  "modURL": "https://7daystodiemods.com/expanded-quest-mod/",
  "modCreatedTime": "2020-06-06T23:12:00+00:00",
  "modLastUpdatedTime": "2020-06-06T23:12:30+00:00",
  "modName": "Expanded Quest Mod",
  "modImages": [],
  "modShortDescription": "Looking for more incentives to continue participating in blood moon hordes? Or perhaps you wish there was an alternate zombie horde threat?",
  "modDescription": "Looking for more incentives to continue participating in blood moon hordes? Or perhaps you wish there was an alternate zombie horde threat in between blood moons nights? How about building your own trader outpost at a custom POI (thanks Haidr’gna for your help)? Look no further and see details below.\n\n**v1.2**\n\nContract: Build Trader Outpost\n\n* Locate the unfinished trader Joel outpost POI (quest\\_trader\\_joel) and finish building it.  \n   * Navesgane: 1 Outpost @ coords. 2132, 71, 260 (Far east side of the forest biome)  \n   * RWG: 2 Outposts @ coords. -352, 51, 605 and 360, 79, 1008 (forest biome; seed: “quest” 4k)  \n         * Each RWG world has a chance to spawn up to a maximum of 2 Outposts.\n* Quest is started by reading the contract located within a custom loot container at the POI (Foreman’s Bag)\n* Quest objectives can only be completed at the POI.\n* Completion of quest will result in experience points, +1 skill point, and a trader spawn for the player.\n\n**v1.1**\n\nAddition of new “Blood Moon Vanguard” [quest](https://7daystodiemods.com/tag/7-days-to-die-quests/).\n\n* This quest is automatically given to the player after the “Basic Survival 8/8” quest is completed.\n* Rewards player with +1 skill point for every 100 blood moon zombie killed.\n* Quest automatically repeats after completion for additional skill points.\n\n**v1.0**\n\nContract: Eliminate the Horde\n\n* Take on this contract from the White River Settlement and CRAFT/BUILD/UPGRADE defenses to fend off the incoming zombie hordes.\n* 4 part quest line with increasing difficulty and rewards (+1 skill point for completing the entire quest chain)\n\nSee videos below for additional quest details.\n\n**Contract: Eliminate the Horde**\n\n**FAQ/Known Issues (Contract: Eliminate the Horde)**\n\n1. Client Installation required due to localization.txt use. May create a server side only install in the future.\n2. Rally Points may appear over water. Workaround is to activate then build defenses in nearby location.\n3. Horde zombies killed by spike traps do not count towards the quest kill objective counter. Not actively killing enough zombies will result in quest failure.\n4. The contract will be in your inventory when starting a new game. If using an existing save, the contract can be found randomly in loot (same lootgroup as challenge notes)\n5. The contract is repeatable for replayability and in case of quest failure. So keep your eyes peeled for the contract when looting.\n\n**Quest: Blood Moon Vanguard**\n\n**FAQ/Known Issues (Quest: Blood Moon Vanguard)**\n\n1. Client Installation required due to localization.txt use. May create a server side only install in the future.\n2. You must have no other mods installed that modify the blood moon horde groups within your entitygroups.xml file in order for this quest to fully function.\n3. Only zombies spawned in specifically within blood moon hordes will count towards the quest objective.\n4. Blood moon zombies killed by traps do not count towards the quest kill objective counter.\n5. Zombie dogs and vultures killed currently do not count towards the quest kill objective counter (maybe in the future).\n6. Just in case the quest bugs out or is accidently cancelled by the player, an item called “challenge\\_bloodmoonvanguard” is available in the Dev items menu.\n\n**Contract: Build Trader Outpost**\n\n**FAQ/Known Issues (Contract: Build Trader Outpost)**\n\n1. Client Installation required due to localization file use.\n2. Trader Outpost POI is only compatible with this mod since it utilizes custom blocks and items.\n3. This mod utilizes 1 custom loot container (id 1000)\n4. Quest blocks can only be placed in specified areas within the POI. No cheesing the quest objectives allowed.\n5. Trader Outpost is not invulnerable like vanilla traders. It will need to be defended and can be owned/claimed by a player. However, the trader himself is unkillable due to xpath modding limitations.\n6. By default, the trader will spawn facing away from the player. Rotating the trader spawn block will mess this up. Once trader is spawned he cannot be rotated/moved without resetting the entire region. Refer to video for trader spawn block demonstration.\n\n**[Download](https://drive.google.com/file/d/12OmP_O8a0xQxkq19Yr2-J9vMOfoEsUuE/view?usp=sharing)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/17240-laz-mans-modlets/).\n\n**Credits:** [Laz Man](https://7daystodiemods.com/tag/laz-man/), Roland, Haidrgna",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/12OmP_O8a0xQxkq19Yr2-J9vMOfoEsUuE/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/17240-laz-mans-modlets/",
  "modAuthors": [
    "Laz Man",
    "Roland",
    "Haidrgna"
  ],
  "modTags": [
    "7 days to die quests",
    "Laz Man"
  ]
}