{
  "modURL": "https://7daystodiemods.com/a-dred-end-overhaul-mod/",
  "modCreatedTime": "2020-05-10T20:33:59+00:00",
  "modLastUpdatedTime": "2020-05-23T12:47:39+00:00",
  "modName": "A Dred End Overhaul Mod",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/05/7-days-to-die-a-dred-end-overhaul-mod-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/05/7-days-to-die-a-dred-end-overhaul-mod-additional-screenshot-2.jpg"
  ],
  "modShortDescription": "This 7 Days to Die Mod is a work in progress towards a more logical, scientific, deeper, scary and adapting version of the base game.",
  "modDescription": "Experimental Early Release. This 7 Days to Die Mod is a work in progress towards a more logical, scientific, deeper, scary and adapting version of the base game.\n\nThe goal of this mod is to expand on the base game to allow the player adapt to a changing, dynamic world.\n\nThrough the use of research you will unlock new techniques, items, blocks, powers and knowledge.\n\nNOTE: This is a work in progress. Adreden has a very long list of thing to implement and he is adding them as he has time and knowledge of how to make them. At the moment the game is in an early testing state to see how the systems he has built work so far. He will be altering this to be an DMT mod eventually. There will also be changes to the progression system, skills and quests all which could break save games. He will endeavor to only release world or character breaking updates as more major updates so that one knows and will not break their games.\n\n## Features\n\nNew Progression system so don’t think of this much like vanilla. The more YOU do the more you get rewarded. NOT the more zombies you kill the better you now how to make a gyrocopter.\n\nLearn by crafting. Adreden has added a little something so that the player can get better at crafting things. This is the most experimental part of the mod and needs tuning and constructive feedback.\n\nLearn by doing. The more you do something the better you will get at it. No need to spend your point (You wont get any)\n\nLearn Science by doing. The more you try to research thing the better you will get at that kind of research. So It should get easier to get more science done.\n\nKeep adding in more Bio modifications the player can use to upgrade themselves. Both items and the the skills More Localization for the files More Icons as time permits\n\n**Research System**\n\nThrough the use of research you will unlock new techniques, items, blocks, powers and knowledge. NOTE: This is a work in progress. Adreden has a very long list of things to implement, and he is adding them as he get time to make them.\n\nCreate a research desk and start crafting experiments. These will get you research notes and the notes will allow you to create schematics for the things you need to build. NOTE: Adreden need to tune this feature. The number for each item are very arbitrary and not tuned to fit each schematic.\n\nSome recipes are in the advanced research desk – like the Molotov on a stick. Planned: Find items in the world are new and will allow you unlock new ideas and schematics that can lead to new abilities, blocks and items.\n\n**Reduced Gameyness**\n\nThere are some things in the game that feel like they are only in there to make certain reward cycles work. Adreden aim to reduce this to give the game a greater feeling of immersion. Pick up the lights in POIS.\n\nFind bicycles in peoples garages.\n\n**An Ending (Not 100% Implemented in alpha 18):**\n\nOne [quest](https://7daystodiemods.com/tag/7-days-to-die-quests/) that should be an end condition of the game. Go out and destroy the infected cloning facility. It wont stop all the zombies of the world but it will (eventually) greatly reduce the number in your county. ATM you need to have the provided map installed to find the facility. Deep in the wastelands is the cloning facility. Still working on polishing this feature, he also need a little bit of DMT magic to finish this.\n\n**New Weapons**\n\nMany Planned The mod was going to be a melee mod and thus has new [weapons](https://7daystodiemods.com/tag/7-days-to-die-weapons/) and there are many planned in updates. Thagomizer a new club based on the tail of a stegosaurus. Should be a one shot on easy zombies with a hard swing.\n\nSpears – There is a stick that can be sharpened and there is also an Iron spear that is craftable to give even more range and damage. Removed the vanilla spears as they would be pretty heavy and worse to craft then a flat piece of steel.\n\nWar pick, War axe and War hammer: Most tools also have a version where there is a handle that can be altered with different tool or weapon mods to make various combinations.\n\nMelee signs: It should be the case that all sings in the game can be weapons. All you need to do is break them free from there bonds and start smashing.\n\nBrazmocks archery mod is in there for testing purposes. Mining laser is creative mod only.\n\n**Zombie Changes**\n\n* Better Eyesight – Better hide at night\n* Reduced melee range – The [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/)\n* Headshots – Zombies have soft heads so best to kill them with a head shot.\n* Body shots – Why do they need organs, so you can smack them, put holes in them break them to a point. The torso is tough.\n* Increased spawning numbers – There will be more zombies.\n* Random getter up – The zombies will take 1 second to 10 seconds to get back up.\n* No hurt sound, no death sound – don’t forget, Double tap.\n* Corpses – For special items you will use to adapt to the world.\n* This mod also includes zombies from the creature pack and so there are new zombies Lots of new zombies.\n* There is a new faction of zombie called the controlled that some one is controlling.\n\nOften times they are seen with helmets and other armour and some have weapons grafted to them. They also have a few special building, with more to come.\n\n**Noise makers**\n\nThese are little distractors that can be thrown to attract zombies (Currently not working in a18)\n\n**Lights**\n\nMost of the [lights](https://7daystodiemods.com/tag/7-days-to-die-lights/) in the game have been added to craft.\n\n**New top tier Block**\n\nZombzyme block is a very resilient block created from various household chemicals and the arm bones of zombies. It will take some research and experimentation to figure out how to do this.\n\n**Spikes from Alpha 16.4**\n\nAdreden has brought back the ability to craft the [spikes](https://7daystodiemods.com/tag/7-days-to-die-traps/) from alpha 16\\. He has also expanded it with the ability to craft quicker crappier versions of the spikes too. Just incase you are in a pinch for time.\n\n**New Large Doors (Thanks Dbat)**\n\nSome large castle doors and portcullises.\n\n[Quadra V-Tech](https://7daystodiemods.com/quadra-v-tech-car-mod/) is in the game too. Likely for now mostly a creative menu.\n\nOn the 7 Days to Die Mod Launcher.\n\n**[Download](https://gitlab.com/adredengaming/a-dred-end-a18-mod/-/archive/master/a-dred-end-a18-mod-master.zip)**\n\nIf you appreciate Adreden’s work and you want to show support, use this [donate link](https://www.youtube.com/redirect?v=ufDNCgMvL6I&redir_token=0IRGOJkYXBivSOkZ9YL2ZVIjBMt8MTU4OTIxNDEwMkAxNTg5MTI3NzAy&event=video_description&q=https%3A%2F%2Fwww.paypal.com%2Fcgi-bin%2Fwebscr).\n\nIf you have any problems, you can use this [discord link](https://discord.gg/XJ7fZYD).\n\n**Credits:** [Adreden](https://7daystodiemods.com/tag/adreden/)  \n_Special Thanks:_ DBat, Ironblade, Brazmock/Azmo, Guppycur, KhaineGB, Kheldon, Haidrgna, SphereII, Stopmy NZ, Xyth, Darkstar Dragon, DanCap0, DeathtoDust, Mumphy, Manux. Really most of the modders on the guppy server.",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/adredengaming/a-dred-end-a18-mod/-/archive/master/a-dred-end-a18-mod-master.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modAuthors": [
    "AdredenSpecial Thanks: DBat",
    "Ironblade",
    "Brazmock/Azmo",
    "Guppycur",
    "KhaineGB",
    "Kheldon",
    "Haidrgna",
    "SphereII",
    "Stopmy NZ",
    "Xyth",
    "Darkstar Dragon",
    "DanCap0",
    "DeathtoDust",
    "Mumphy",
    "Manux. Really most of the modders on the guppy server."
  ],
  "modTags": [
    "7 days to die bicycle",
    "7 days to die car mods",
    "7 days to die doors",
    "7 days to die lights",
    "7 days to die perks",
    "7 days to die quests",
    "7 days to die skill points",
    "7 days to die traps",
    "7 days to die vehicles",
    "7 days to die weapons",
    "7 days to die zombies",
    "Adreden"
  ]
}