{
  "modURL": "https://7daystodiemods.com/hang-glider-mod/",
  "modCreatedTime": "2020-06-30T19:35:00+00:00",
  "modLastUpdatedTime": "2020-06-30T19:35:47+00:00",
  "modName": "Hang Glider Mod",
  "modImages": [],
  "modShortDescription": "This mod adds a hang glider to the 7 Days to Die. Designed mainly for descend from tall buildings but you can use glider to descend from cliffs and hills.",
  "modDescription": "This mod adds a [hang glider](https://7daystodiemods.com/tag/7-days-to-die-vehicles/) to the 7 Days to Die. Ragsy apologizes for the delay on releasing this to the community (Real Life Stuff), still experimental and a few little things to improve it but is like all mods/modlets going to develop and change/improve over time with some more attention, so rather than strive for absolute perfection before release he decided to release this initial version.\n\n## The Hang Glider\n\nSo you fought hard suffered blows but finally you kicked zombie butts and obtained all that glorious loot on your journey up the various tall buildings and skyscapers the game has to offer. After all the hard work then doesn’t it really suck that you have to walk calmly down past all the stuff you made your spoils on the way up.\n\nNow only if he had a way to get down from that roof quickly and carry on looting more stuff before the oncoming blood moon arrives to use up these newly found resources (a grappling hook would be great but that is not yet a feature in the game and we all are thinking on that one as to how to implement so whats the next best option).\n\nWell now if you were smart and had previously crafted the makeshift ‘hang glider’ before the accent you can now just take off from that roof and glide down for your next mission.\n\n## Glider Launching\n\nDesigned mainly for descend from tall buildings but you can use glider to descend from cliffs and hills if you make sure the ground is flat and there are no immediate obstacles that you might collide with.\n\n## Tall Building Launch\n\nPlace close to edge of a building roof making sure you have a clear run for take off (probably 2 – 3 metres), if not find an elevated position on that roof or make a clear run by knocking down blocks to do so.\n\nThe glider is light and flimsy so may move after placing of it’s own accord.\n\n## Controlling the Glider\n\nPress E to mount glider and the glider catches the wind so to speak and takes off.\n\nWhen airbourne C becomes tilt forward and spacebar is tiltback. Whilst airbourne you can let go of W and use the A and D controls (strafe) and mouse to steer down to earth or for sustaining longer flights you need to use the spacebar to tiltback and maintain height.\n\nThe higher up you are the better chance you have of really long distance gliding.\n\n## Landing\n\nWhen landing press E to dismount near desired landing position and then pickup the glider for your next adventure (pick up is on the steering frame when looking at the glider from the rear view see above pre-launch pictures).\n\n## Crafting\n\nThe glider is craftable in a standard workbench with no progression needed as this is something you could make in early game at the cost of resources and actually finding a working workbench. Finding a workbench in early game would be a bonus and allow you to make the glider a lot sooner. The recipe is simple and uses in game resources.\n\n## Known Issues\n\n1. If you hit another building or perhaps a tree during decent the glider may stick and leave you stranded, Ragsy put the exit for the glider at the top for now, when exiting the glider and standing on top the glider will slowly decend to the ground without you having to plunge to your death. So stay still and don’t walk off\n2. You can not launch easily from the roof top raised edge blocks (see launch instructions)\n3. You can climb a bit when decending from smaller buildings but too tiltback using spacebar can occasionally take glider so high it takes a while to correct it so don’t over do the tiltback after launch.\n4. Glider storage not needed as this is a pick up and go although it’s still in the xml at present will sort that later.\n\n**[Download](https://gitlab.com/Ragsy2145/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=Hang%20Gliding%20Modlet)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/11266-ragsy-s-modlets/).\n\n**Credits:** [Ragsy2145](https://7daystodiemods.com/tag/ragsy2145/)  \n_Additional Credits:_ Guppycur",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/Ragsy2145/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=Hang%20Gliding%20Modlet",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/11266-ragsy-s-modlets/",
  "modAuthors": [
    "Ragsy2145Additional Credits: Guppycur"
  ],
  "modTags": [
    "7 days to die vehicles",
    "Ragsy2145"
  ]
}