{
  "modURL": "https://7daystodiemods.com/video-players-mod/",
  "modCreatedTime": "2020-07-10T23:00:00+00:00",
  "modLastUpdatedTime": "2020-07-10T23:00:26+00:00",
  "modName": "Video Players Mod",
  "modImages": [],
  "modShortDescription": "This A19 mod now combines several A18/A19 mods (Video Players, Billboards, and Theater Screens).",
  "modDescription": "This A19 mod now combines several A18/A19 mods (Video Players, Billboards, and Theater Screens).\n\nIntroduces mass media into the game. Initial release is in the form of Billboards, but really any flat surface can render the images. Some known issues exist, see known issues for details.\n\n## Billboards\n\nThis mod adds 2 new billboards to the game:\n\nBillboard01 is a mechanical billboard that shows 3 unique images on each side of the billboard. This is a single texture sheet which you can edit in a graphics program then import into unity and the reexport.\n\nBillboardVideoMP4 is a electronic version, that will play 3 video clips (or entire movies) in rotation. Like 3 TV channels. Best part is you can replace the 3 video files in the mods/resources folder with your own.\n\nIf you put down a land claim block you can pick these up by holding the E key.\n\n### Installing\n\nThis is a modlet. Normal modlet install. If you swap out any of the videos, they must have the exact same name and file extension as the one you’re replacing. Those names are hard coded. It won’t like strange .mp4 encoding so keep it simple.\n\nThis is tested to work on dedi as well.\n\n### Known Issues\n\nSometimes the sound plays for a few seconds if you enter the game next to a billboard that has sound. This is because Xyth need to active them on start as he can’t use code to do that. Minor annoyance, but he will look for a workaround.\n\nYou need to activate a newly placed billboard by attaching a wire to it, but you can immediately remove that wire. That is because he’s using the switch class and it expects a wire to the switch. No way to fix that without code.\n\nVideos need to be in .mp4 format. He added a version that supports .ogv, but the game won’t play it even though Unity2019 supports it.\n\n## Video Players\n\nIntroduces working televisions into the game. Same issues exist as on the Billboards.\n\nThis mod adds 2 new televisions to the game: VideoTV is a large tabletop television that will play 3 video clips (or entire movies) in rotation. Like 3 TV channels. Best part is you can replace the 3 video files in the mods/resources folder with your own.\n\nTVWall is a wall mounted version setup to replace the existing small wall mounted televisions. Its currently set to replace 90% of them but that can be adjusted in xml.\n\nIf you put down a land claim block you can pick these up by holding the E key.\n\n### Installing\n\nThis is a modlet. Normal modlet install. If you swap out any of the videos, they must have the exact same name and file extension as the one you’re replacing. Those names are hard coded. It won’t like strange .mp4 encoding so keep it simple.\n\nThis is tested to work on dedi as well.\n\n### Known Issues\n\nSometimes the sound plays for a few seconds if you enter the game next to a TV. This is because Xyth need to active them on start as he can’t use code to do that. Minor annoyance, but he will look for a workaround.\n\nYou need to activate a newly placed TV by attaching a wire to it, but you can immediately remove that wire. That is because he’s using the switch class and it expects a wire to the switch. No way to fix that without code.\n\nVideos need to be in .mp4 format.\n\n## Theater Screens\n\nAdds a flat theater screen into the game. Designed with POI makers in mind, this screen is 16:9 format and 8×5 blocks in size. Same issues exist as on the Billboards.\n\n### Installing\n\nSame as the Video Players – This is tested to work on dedi as well.\n\n### Known Issues\n\nSame as video players.\n\n## Changelog\n\nUpdated for latest experimental.\n\n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/7D2D/A19Mods/tree/master/VideoPlayers)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/8400-xyths-modlet-collection/).\n\n**Credits:** [Xyth](https://7daystodiemods.com/tag/xyth/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/7D2D/A19Mods/tree/master/VideoPlayers",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/8400-xyths-modlet-collection/",
  "modAuthors": [
    "Xyth"
  ],
  "modTags": [
    "Xyth"
  ]
}