{
  "modURL": "https://7daystodiemods.com/resetplayerdmt-a-hardcore-mode-for-7-days-to-die/",
  "modCreatedTime": "2020-07-13T17:31:00+00:00",
  "modLastUpdatedTime": "2020-07-13T17:32:16+00:00",
  "modName": "ResetPlayerDMT - A Hardcore Mode for 7 Days to Die",
  "modImages": [],
  "modShortDescription": "ResetPlayerDMT will do the following on player death: Reset all skills to 0, and remove all learned books. Remove all skill points. And more...",
  "modDescription": "This mod was more of a project to learn things, and also started because of a discussion over in the modding discussion section about ways to clear things on a players death. Also KhaineGB personally felt the “Dead is Dead” playstyle is… odd. Okay, you died and need to delete your save. Now you just get to start a new save in the same map, so you’ve got a good idea where stuff is and all the POI’s have respawned… and you’re back on Day 1.\n\nThis changes that.\n\nResetPlayerDMT will do the following on player death:\n\n1. Reset all skills to 0, and remove all learned books.\n2. Remove all [skill points](https://7daystodiemods.com/tag/7-days-to-die-skill-points/) gained from resetting your progression, and any you hadn’t spent.\n3. Reset player level to 1.\n4. Set the [XP](https://7daystodiemods.com/tag/7-days-to-die-experience/) to Next Level amount to 11,000 (this is as close to respawning with 0XP as KhaineGB could get due to vanilla doing odd calcs)\n5. Clear the players quest journal completely (active [quests](https://7daystodiemods.com/tag/7-days-to-die-quests/), completed quests, current quests, shared quests)\n6. Clears the current trader faction level, meaning you start from T1 quests again.\n7. Clear the players map completely (thank you khzmusik for this code!)\n8. Set the players land claim block to inactive (thank you HAL9000 for the help with this!)\n9. KILL the players vehicle so it despawns (thank you Mythix for the help with this!)\n10. Delete the spawn point set by the bedroll to force random world spawn.\n11. Give the player the “Go to the trader” quest on respawn. This quest will give you XP and skill points as if you had completed the tutorial once you get to the trader. It will also give you the normal “starting items” as if you just spawned into the world on completion.\n12. Clears trader faction so you start at Tier 1 quests again.\n\nWhat doesn’t it do:\n\n1. It does NOT re-apply the “newbie buff” but that’s easy enough for users to add in if they so wish.\n2. It does NOT generate a “safe zone” like the game would when you first spawn into the world.\n3. It does NOT remove access to player storage.\n\nNow, the player storage. It doesn’t remove access to it because cycling through all the owned blocks, and setting them to locked and unowned was really CPU intensive. Also, KhaineGB realised that players who take over POI’s can just use the storage in the POI and thus negate the point of removing ownership from the storage blocks (like chests). It just wasn’t worth the CPU overhead.\n\nSo if you find your old base, yes you can totally get your stuff back. This is intended to be played with “Delete all on death” rather than dropping your backpack, and KhaineGB hope it might provide a slightly different play experience for folks.\n\nPlease be aware, this does not use harmony and WILL NOT work on overhaul mods (when they become available for A19).\n\nThis is a DMT mod. So requires [DMT Modding Tool](https://community.7daystodie.com/topic/13037-dmt-modding-tool/).\n\n**[Download](https://gitlab.com/KhaineGB/khainedmt-a19/-/archive/master/khainedmt-a19-master.zip?path=HardcoreModeDMT)** for A19  \n**[Download](https://gitlab.com/KhaineGB/khainesdx/-/archive/master/khainesdx-master.zip?path=ResetPlayerSDX)** for A18\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/19670-resetplayerdmt-a-hardcore-mode-for-7-days-to-die-a19/).\n\n**Credits:** [KhaineGB](https://7daystodiemods.com/tag/khainegb/)",
  "modDownloadURLs": [
    {
      "Info": "for A19",
      "URL": "https://gitlab.com/KhaineGB/khainedmt-a19/-/archive/master/khainedmt-a19-master.zip?path=HardcoreModeDMT",
      "Version": "v19"
    },
    {
      "Info": "for A18",
      "URL": "https://gitlab.com/KhaineGB/khainesdx/-/archive/master/khainesdx-master.zip?path=ResetPlayerSDX",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/19670-resetplayerdmt-a-hardcore-mode-for-7-days-to-die-a19/",
  "modAuthors": [
    "KhaineGB"
  ],
  "modTags": [
    "7 days to die experience",
    "7 days to die quests",
    "7 days to die skill points",
    "KhaineGB"
  ]
}