{
  "modURL": "https://7daystodiemods.com/farm-life-expanded/",
  "modCreatedTime": "2020-08-10T17:31:00+00:00",
  "modLastUpdatedTime": "2020-08-10T17:32:03+00:00",
  "modName": "Farm Life Expanded",
  "modImages": [],
  "modShortDescription": "What Phredd is posting here is a proof-of-concept version of farming based on/using prior work with a few new items, that he's calling, Farm Life Expanded.",
  "modDescription": "First off Phredd would like to say thank you to Stasis78, Mayic and hernanxx. Without their prior work and permission, this wouldn’t have been put together.\n\nNext, thank you to all the modders on the forums. The information/examples they have provided is greatly appreciated and helped him get this playable in A18.4.\n\nExtra special thanks to Linda, babygrl, Chris, Gator, Tru, Bluntz, David, Mistress Metal and Nomad for the initial help with everything to do with the farming mods and testing over the past few months.\n\nWhat Phredd is posting here is a proof-of-concept version of farming based on/using prior work with a few new items, that he’s calling, Farm Life Expanded.\n\nIt combines Stasis’s FarmLifeMod2, Mayics Farming Mod and hernanxx’s Unnecessary but Beautiful mods into one. This started out months ago as just a farming mod for their server. When asked if Phredd could add recipes for UbB, he decided to just join that into the mod after getting permission to use the mod.\n\nPhredd know Demmers is working on a version of this as well, and this is in no way any kind of attempt to take anything away from what he is doing. Phredd has started on this before he knew about Demmers’ project. Information on Farm Life v3 can be found [here](https://7daystodiemods.com/farm-life-v3-continuation-of-stasis-farm-life-mod/).\n\nAlso, Phredd is not claiming to be a modder, and he has been hesitant on posting about this knowing a good portion is others work.\n\nWith that said, here are some details.\n\n## Animals\n\nFarm [animals](https://7daystodiemods.com/tag/7-days-to-die-animals/) are part of the original mods. While Phredd won’t be fixing many of the issues with the previous models, he has corrected offset for placement. He has added new models and recipes. None have animations, and are working placeholders for the time being.\n\nNew animals currently include:\n\n* Beehive (honey)\n* Horse (bone, leather, glue\\*)\n* Pheasant (eggs, feathers, meat)\n* Sheep (wool, [meat](https://7daystodiemods.com/tag/7-days-to-die-food/))\n* Turkey (eggs, feathers, meat)\n\n## Animal Workstations\n\nAnimal workstations are a continuation of Mayics concept, with new animals added. Again, none have animations and are placeholders for the time being. They are also the source of a “breeding” system. Phredd didn’t really know how to do this, so he added “cryo” containers to be found in loot that can then be used with the Animal workstation to create that type of animal.\n\nNew animal workstations currently include:\n\n* Beehive\n* Elk\n* Horse\n* Pheasant\n* Sheep\n* Turkey\n\n## Crops\n\nWith the combination of the two [farming](https://7daystodiemods.com/tag/7-days-to-die-farming/) mods, there were some duplicate plants. Some have been changed to other plant types, while others have been discarded and not used. The “crop” plants have been recoded to use TFP’s growing method, with 56 plants available. All have at least 1 useful recipe.\n\n## Trees\n\nMost of the recipes for UbB require certain types of wood. (example: Dark furniture requires Walnut, Clear requires Maple, White requires White Oak) making [trees](https://7daystodiemods.com/tag/7-days-to-die-trees/) more important.\n\n## Workstations\n\nAs mentioned, with the combination of the two farm mods, there were duplicates of some workstations. All have been re-evaluated and recipes changed accordingly. Phredd didn’t completely delete the unused models from the mod, and they are still able to be crafted, but with no recipe requirements tied to them.\n\n## Recipes/Quests\n\nThis is one of the areas Phredd hasn’t done much with yet, regarding the originals. There are currently 1517 recipes and 292 quests in the mod. He hasn’t gone through everything, but all [quests](https://7daystodiemods.com/tag/7-days-to-die-quests/) are available in the Farm Table. He also have to go through all of the Food recipes and catagorize them. There is a “starter” quest item that will give basic quests to get started with Farm Life if you decide to use it. A few of the new food items are just placeholders and don’t have buffs/stats yet.\n\nPhredd has tried to address as many of the original issues as possible eg. offsets of models, missing recipes, workstations(required items, model footprint) etc. There are still known issues with any of the workstations that have multiple rows of required tool slots.\n\nAs for hernanxx’s Unnecessary but Beautiful. The copy Phredd started with had no recipes at all. All of the recipes are generic and can be changed in xml if needed. Also included, working sinks and ovens for those model types.\n\nAgain, thanks to all that have put the effort into making these mods originally.\n\nOne last thing to mention, Phredd consider anything he has added to this as “open source”, so if anyone wants to modify/use… by all means, go for it.\n\nHave fun and enjoy.\n\n**[Download](https://gitlab.com/SoDead/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=SoDead_FarmLifeExpanded)** A19 _(Updated 10 Aug 2020)_ _(Very limited testing since the update earlier today to (b169). Vanilla backpack and restructured Perk for Farm Life to be more compatible with other mods.)_  \n**[Download](https://gitlab.com/SoDead/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=SoDead_FarmLifeExpanded)** A19 _(Stand-Alone version, doesn’t play well with other mods. Includes 96 slot backpack.)_  \n**[Download](https://github.com/Phredds/Test-Mods)** A18 _(Phredd was asked about links to A18 versions. This is the last backup that he kept. He also included a version without the backpack. He won’t be updating these at all. If there are conflicts, he won’t be looking at them. He is being upfront about it.)_\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/19361-farm-life-expanded/).\n\n**Credits:** Phredd, Stasis78, Mayic, hernanxx",
  "modDownloadURLs": [
    {
      "Info": "A19 (Updated 10 Aug 2020) (Very limited testing since the update earlier today to (b169). Vanilla backpack and restructured Perk for Farm Life to be more compatible with other mods.)",
      "URL": "https://gitlab.com/SoDead/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=SoDead_FarmLifeExpanded",
      "Version": "v19"
    },
    {
      "Info": "A19 (Stand-Alone version, doesn’t play well with other mods. Includes 96 slot backpack.)",
      "URL": "https://gitlab.com/SoDead/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=SoDead_FarmLifeExpanded",
      "Version": "v19"
    },
    {
      "Info": "A18 (Phredd was asked about links to A18 versions. This is the last backup that he kept. He also included a version without the backpack. He won’t be updating these at all. If there are conflicts, he won’t be looking at them. He is being upfront about it.)",
      "URL": "https://github.com/Phredds/Test-Mods",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/19361-farm-life-expanded/",
  "modAuthors": [
    "Phredd",
    "Stasis78",
    "Mayic",
    "hernanxx"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die farming",
    "7 days to die food",
    "7 days to die quests",
    "7 days to die recipes",
    "7 days to die trees"
  ]
}