{
  "modURL": "https://7daystodiemods.com/hutchs-legacy/",
  "modCreatedTime": "2020-08-28T20:54:00+00:00",
  "modLastUpdatedTime": "2020-08-28T22:33:29+00:00",
  "modName": "Hutch's Legacy",
  "modImages": [],
  "modShortDescription": "mr.devolver would like to share with you the first version of his new quest mod called Hutch's Legacy. It's a mod which adds a small, vanilla friendly quest.",
  "modDescription": "mr.devolver would like to share with you the first (and not well balanced yet) version of his new [quest](https://7daystodiemods.com/tag/7-days-to-die-quests/) mod called Hutch’s Legacy. At the moment, it is a mod which adds a small, vanilla friendly quest, but it MAY grow into something bigger eventually, possibly requiring other mods as dependencies to make things more advanced and interesting – it will highly depend on players feedback as well as inspiration that may come to him and motivate him to improve it and make it bigger…\n\n## What’s the Mod About and How to Play It\n\nHe doesn’t want to make spoilers, so he will try to make this very vague and give just enough information that is needed for a good playing experience…\n\nIn vanilla game, you start as a person who was just robbed and beaten up by Duke’s bad guys. You’re naked and you have barely enough supplies to survive. One of the items that you start with is the note from Duke of Navezgane that gives you a hint about why did you get beaten up in the first place. It informs you that you still owe Duke. At the moment this is where vanilla story ends, but it’s also where the story of our quest begins…\n\nThis quest is meant to be played EARLY on the start of the new game, because its story is a follow-up of the incident with Duke’s guys who left you the note. Therefore, to play this quest you still NEED to have the note from Duke! He know you can cheat and get a new one, but that would ruin the fun and defeat the whole purpose of this quest. We are roleplaying here, so you will need to use this note from Duke to craft a note from your old friend Hutch! This new quest note is called Hutch’s Legacy and when you craft it and read its description, it should make more sense as to where in time this story takes place…\n\n## Who Is This Mod For?\n\n* Everyone who likes old western movies.\n* Everyone who likes to roleplay.\n* Everyone who wants more quests.\n* Everyone who didn’t like much the slower pace of the early game in new Alpha 19 due to the stone age – This quest will NOT magically remove the stone age of the early game, but if you’re a 7 Days to Die veteran and know how to make good use of what is provided here, the stone age will not bother you that much for too long… BUT! Beware, as a 7 Days to Die veteran, you should know that good things don’t come easily and you will need some skills to handle what’s coming, so make sure to get at least some basic weapons and protective skills before you play this quest – primitive bow, some stone arrows, a blunderbuss with some ammo, a wooden club, a stone axe, some wood frames (just in case) would definitely come in handy here.\n\n**ATTENTION:** Please note that this is a story mod. LITERALLY. For best roleplaying experience, you need to make sure to read every description of every item, every piece of text this quest mod shows you.\n\n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/mrdevolver/7D2D_Alpha19_Mods/tree/master/Hutch%27s%20Legacy)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/21315-hutchs-legacy-quest-mod/).\n\n**Credits:** [mr.devolver](https://7daystodiemods.com/tag/mr-devolver/)  \n_Special Thanks:_ Telric, Bdubyah",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/mrdevolver/7D2D_Alpha19_Mods/tree/master/Hutch%27s%20Legacy",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/21315-hutchs-legacy-quest-mod/",
  "modAuthors": [
    "mr.devolverSpecial Thanks: Telric",
    "Bdubyah"
  ],
  "modTags": [
    "7 days to die quests",
    "mr.devolver"
  ]
}