{
  "modURL": "https://7daystodiemods.com/custom-zombies-mod-by-robeloto/",
  "modCreatedTime": "2020-10-14T19:22:00+00:00",
  "modLastUpdatedTime": "2020-10-14T19:24:26+00:00",
  "modName": "Custom Zombies Mod by Robeloto",
  "modImages": [],
  "modShortDescription": "This mod adds 33 new zombies to the game. Giant, Fire Boss, Gunner, Anesthesia, Burning Man, MoePuker, Screamer Boss, Shadow, Fire Elf and more.",
  "modDescription": "If you are looking for a realistic mod you have come to the wrong place, but if you are looking for some variation in the game involving some nice action with new zombies and with increased difficulty you happen to just be in the right thread.\n\nThis mod adds 33 new [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) to the game. + 3 zombies from Snufkins mod: Archon, Geist and Scarecrow.\n\n## Zombie Names & Info\n\n### Giant\n\nA giant zombie that can kill you and your base in one hit. Do not try to fight this guy before you have some good gear.\n\n### Fire Boss\n\nTime for some cheesy lines. You are under arre… ehm, probably dead if you let him flame you. No Miranda warning here. This is a huge fire zombie that can destroy anything with his breath. This zombie has pretty high blockdamage, so do not lure him to your base.\n\n### Gunner\n\nOne of the strongest. Looks like a zombie made of metal and he will shoot you with several bullets. He can break your arm and also stun you.\n\n### Anesthesia\n\nNeed some anesthesia? This nurse will drug you, and do some horrifying things to you.\n\n### Burning Man\n\nA roaming zombie that has evolved from the vanilla burnt zombie. He will puke small breaths of fire.\n\n### MoePuker\n\nHe seems to have turd all over his body. He stinks and he pukes. Evolved from a normal Moe.\n\n### Screamer Boss\n\nThe leader of all zombies? She is bigger than the vanilla one and she shoots rockets from her mouth destroying anything in her way.\n\n### Shadow\n\nDuring the day he is almost invisible. But during the night if you have a flashlight you will see him. This zombie can blind you and he has learned to mimic familiar sounds from before the apocalypse.\n\n### Fire Elf\n\nA zombie Elf that shoots flaming arrows from his mouth. Yes, you read that right.\n\n### Shocker\n\nThis “dude” pukes electric bolts from his mouth. Try not to become shocked! Even his hands will electrify you until you are burnt crisp.\n\n### Spectre\n\nA transparent silent zombie that will scare the butt out of you, probably.\n\n### AquaZed\n\nA type of waterzombie that pukes water on you. Does not hurt much, and if you are on fire, this vomit will extinguish the fire.\n\n### Blazing Man\n\nBurning mans big brother. His fire puke explosions are beautiful, but far from harmless.\n\n### Mummy\n\nA slow guy, but can take several hits before he goes down. He can also break your precious arm.\n\n### Sanguis\n\nThis zombie behaves like a spider zombie, but slightly faster and will puke some strange blood on you. When this zombie is near you will bleed even if you do not get hit by her puke. She has a chance to infect you if you get hit. Then she will drain all your stamina and possibly give you pneumonia.\n\n### Candygirl\n\nShe will make you run faster. So watch out if she hits you as you could run out from a cliff or a tall building etc.\n\n### Chroma\n\nA jumpy fast zombie that can buff your sight with strange coloring.\n\n### Freezer\n\nHis vomit can freeze you instantly making you unable to move.\n\n### Ironman\n\nA zombie with iron skin. Low HP, but will generate health quite rapidly. Kill him fast.\n\n### Predator\n\nFast cloaking zombie that can hurt you in some different ways.\n\n### Shocker Feral\n\nThe feral version of shocker with a new cool skin!\n\n### Spectregirl\n\nSame as spectre, but the female one and she runs!\n\n### White Noise\n\nThe fastest zombie. He can run as fast as a minibike. If you are on foot, try to kill him instead, cause you cannot outrun this creature. His buff will make you see noise.\n\n### Anaconda\n\nVery fast and large snake. You should really run, because the damage from this lady is critical. Keep distance.\n\n### Blazing Phoenix\n\nThis one is burning and he also spit fire.\n\n### ChickenDemon\n\nFast and will agressively hunt you down if you are within her area. High chance to infect you.\n\n### Cloaker\n\nA cloaking vulture. Quite scary.\n\n### DiamondPhoenix\n\nYou thought the radiated vultures were dangerous? Well, this bird makes them fade in comparison and it spits bullets. If you happen to see one. Just run.\n\n### Fly\n\nFast irritating. Can infect you. Has really low HP.\n\n### Water Raion\n\nA large lion that can drown you. Get water and meat from this cat.\n\n### Fire Snake\n\nA smaller version of anaconda, but this one will burn you up.\n\n### Copter Corpse\n\nA corpse that is flying a gyrocopter and is shooting with a minigun.\n\n### Exploder Zombie\n\nA zombie with a timed charge on his chest. He also have one dynamite in each of his hands. He will explode after you have damaged him or he has damaged you.\n\n## Spawning\n\nThe most dangerous zombies are removed from sleeper, scout and feralhordes during the first days and up to gamestage 100+.\n\n## Custom Sounds\n\n* Anesthesia vomit\n* Anaconda\n* Fire breaths\n* Fly\n* Freezer vomit\n* Giant\n* Gunner\n* Moepuker vomit\n* Mummy\n* Sanguis vomit\n* ScreamerBoss\n* Shadow (many sounds and can also mimic a screamer)\n* Shocker vomit\n\n## Items\n\nAmoxillin, cures you completely from the new custom zombie buffs, new schematics and resources that are added to the lootgroup. Amoxillin is under the yeahScience perk so you can learn to craft this.\n\n## Quests\n\nRobeloto has added [quests](https://7daystodiemods.com/tag/7-days-to-die-quests/) in the mod. At the moment there are only 2 quest, but more will be added. They can be looted as any other challenge quests.\n\n## Custom Prefabs\n\nRobeloto will probably add this in a near future. He has never done this, so it will prob take a while before he learn everything about how it is done.\n\n## Buffs\n\n### Anesthesia\n\nThe zombie with the same name as this buff will drug you. Your screen will become wavy and you will have a hard time moving during this effect. Amocillin will cure this.\n\n### Chroma\n\nBuff from the Chroma zombie. Your world will get weird colors and you cannot see your weapon.\n\n### Dark\n\nBuff from Shadow, you will be completely blind for 9 seconds if he hits you with his circle of lights. This can be cured with Amocillin.\n\n### Drowning\n\nThe AquaZed buff. Not too much different from the usual drowning buff, but your sight will become blurred and you will have a harder time moving around during this effect. Nothing will cure this, it will only last a couple seconds.\n\n### Ice\n\nThe freezer buff. You cannot move for about 4-5 seconds. To avoid this. Drink hot coffee or cocoa to cure.\n\n### Noise\n\nIf he is near or hits you, your world will get a bit grainy. If you used ranged weapon on this zed, he will sense that and punish you.\n\n### Pneumonia\n\nSanguis zombie has a low chance to give you Pneumonia. It will last for 250 seconds. You will be weakened and you will also lose health during this time. Keep your health up to not die or find Amocillin.\n\n### Sanguis\n\nThe Sanguis zombie buff will drain your stamina and your sight will be really bad. Amocillin will cure this.\n\n### Shocked\n\nTake a wild guess which zombie gives you this buff. You will be shocked for about 4-5 seconds. It will reset if you get shocked again.\n\n### Stunned\n\nThis custom buff will not be affected by your strength and perks. It will always have a chance to stun you.\n\n## Other changes\n\nEvery fat zombie have now a chance to break your arm. Lowered this chance from version 2.5.\n\nSpider zombies jumps higher.\n\nRobeloto lowered the volume on all explosions that had too high volume compared to everything else. Molotovs explosion is changed to match Burning mans puke. It sounds really nice. Also, no more looping sounds after you killed a fire puking zombie or a shocker!\n\n**Overview:**\n\nAction video on all zombies! This is what they do to you!\n\n**Part 1:**\n\n**Part 2:**\n\n**Copter Corpse:**\n\n## Changelog\n\n* **v2.73:**  \n   * Candygirl apperance: She wields 2 candycaneshiv in her hands.  \n   * All fire zombies has now torch particle coming from their hands.  \n   * Shocker zombie has small shock particle coming from his hands. Feral Shock apperance corrected as he was invisible, cause the material changed.  \n   * Added new quest. This quest rewards you with a schematic for the Steelbootsofhaste and MagicPlateArmor + experience and casinocoins. Quest is added to loot with a 6% chance. MagicPlateArmor and Steelbootsofhaste has now quaility stages. The Sboh has an increased speed. Some recipes have changed a bit, such as MagicPlateArmor.  \n   * Localization has been updated.  \n   * All alternate versions has also been updated.\n\n**Remember that if you have a quest from the old versions active and you proceed installing and playing, your character will be reset. Make a backup and/or play with the old quest version. He think you can remove the quest and after that proceed installing the new files, but always make backups in case.**\n\n**Alpha 19 Versions**  \n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A19_Modlets/tree/master/Robeloto_CustomZombies)** for **A19**  \n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A19_Modlets/tree/master/Robeloto_CustomZombies_XML)** XML only for servers **(A19)**  \n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A19_Modlets/tree/master/Alternate%20versions%20of%20mods/Robeloto_CustomZombies%20alternate%20versions)** alternate versions for **A19** _(Check the Readme for changes. Copy these files to the default mod and overwrite them to make the changes.)_  \n**Alpha 18 Versions**  \n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A18.4_Modlets/tree/master/Robeloto_CustomZombies)** for **A18**  \n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A18.4_Modlets/tree/master/Robeloto_CustomZombies_XMLONLY)** XML only for servers **(A18)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/12229-robelotos-modlets/).\n\n**Credits:** [Robeloto](https://7daystodiemods.com/tag/robeloto/)",
  "modDownloadURLs": [
    {
      "Info": "Alpha 19 Versions",
      "Version": "v19"
    },
    {
      "Info": "for A19",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A19_Modlets/tree/master/Robeloto_CustomZombies",
      "Version": "v19"
    },
    {
      "Info": "XML only for servers (A19)",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A19_Modlets/tree/master/Robeloto_CustomZombies_XML",
      "Version": "v19"
    },
    {
      "Info": "alternate versions for A19 (Check the Readme for changes. Copy these files to the default mod and overwrite them to make the changes.)",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A19_Modlets/tree/master/Alternate%20versions%20of%20mods/Robeloto_CustomZombies%20alternate%20versions",
      "Version": "v19"
    },
    {
      "Info": "Alpha 18 Versions",
      "Version": "v18"
    },
    {
      "Info": "for A18",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A18.4_Modlets/tree/master/Robeloto_CustomZombies",
      "Version": "v18"
    },
    {
      "Info": "XML only for servers (A18)",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A18.4_Modlets/tree/master/Robeloto_CustomZombies_XMLONLY",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/12229-robelotos-modlets/",
  "modAuthors": [
    "Robeloto"
  ],
  "modTags": [
    "7 days to die quests",
    "7 days to die zombies",
    "Robeloto"
  ]
}