{
  "modURL": "https://7daystodiemods.com/water-filters/",
  "modCreatedTime": "2020-11-06T20:19:17+00:00",
  "modLastUpdatedTime": "2020-11-06T21:20:56+00:00",
  "modName": "Water Filters",
  "modImages": [],
  "modShortDescription": "Find, buy or create a water filter in the field! Merchants now have something new in their assortment - the Water Filtration Machine!",
  "modDescription": "Find, buy or create a [water](https://7daystodiemods.com/tag/7-days-to-die-drinks/) filter in the field! And for experienced survivalists, merchants now have something new in their assortment – the Water Filtration Machine!\n\n1. Home-made water filter – made simply, does not last long, but fully fulfills its function.\n2. The sports water filter is an industrial analogue of the above, used by the military and tourists before the apocalypse.\n3. Water Filtration Machine – installation assembled by an unknown, and received its application after the apocalypse. In a matter of minutes, it can purify a large volume of water of any complexity! (requires regular filter replacement!)\n4. Primitive Water Filtration Machine – installation that, when assembled in a matter of minutes, you can purify a fairly large volume of water of any complexity! (requires regular filter replacement!)\n\n## Changelog\n\n* Added Premitive Water Filtering Machine (PWFM) with filter and recipes. (thanks to the user for the idea – CrazyAluminum )\n* Changed names and descriptions for WFM. Now it is called AWFM – Automatic Water Filtration Machine.\n* Changed the tooltip in the journal. Now it is suitable for all types of machines.\n\n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/Okamich/FallOFBabylon-A19/tree/main/FoB-WaterFilters)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/22025-okami-modlets-fall-of-babylon/).\n\n**Credits:** [Okami](https://7daystodiemods.com/tag/okami/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/Okamich/FallOFBabylon-A19/tree/main/FoB-WaterFilters",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/22025-okami-modlets-fall-of-babylon/",
  "modAuthors": [
    "Okami"
  ],
  "modTags": [
    "7 days to die drinks",
    "Okami"
  ]
}