{
  "modURL": "https://7daystodiemods.com/7-days-to-die-mod-edit/",
  "modCreatedTime": "2020-11-29T20:53:00+00:00",
  "modLastUpdatedTime": "2020-11-29T21:32:34+00:00",
  "modName": "7 Days To Die Mod Edit",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-mod-edit-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-mod-edit-additional-screenshot-2.jpg"
  ],
  "modShortDescription": "If you are curious on how to mod 7d2d this app is for you. Create new objects, edit existing ones, search the files for information and more.",
  "modDescription": "A one stop shop for your 7d2d xml mods or modlets. Create new objects, edit existing ones, search the files for information, easily discover issues in the files, switch between mods easily, and even support for the localization.txt and ModInfo.xml. If you are curious on how to mod 7d2d this app is for you.\n\nWith this app you trade long wording xml files for tree views. The tree views are color coded appropriately and come with a variety of features. You can generate XPath to the in game xml objects, with minimal user input and even copy objects with a few clicks. All input boxes are also automatically filled with common used attributes from the original file for easier discovery and addition of those common attribute in the generated xml. Preview the xml that would be generated, for multiple objects at once, and save everything with just a few clicks.\n\nWith three color themes and everything color coded it’s easy to understanding and easy on the eyes as well!\n\nA true Mod editor for 7 Days to Die!\n\n**[Download](https://github.com/corvettelover66/7d2dModXmlXpathGenerator/raw/master/Publish_LOC/SevenDaysToDieModCreator-v1.7.rar)**\n\n**Credits:** wrathmaniac",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/corvettelover66/7d2dModXmlXpathGenerator/raw/master/Publish_LOC/SevenDaysToDieModCreator-v1.7.rar",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modAuthors": [
    "wrathmaniac"
  ],
  "modTags": []
}