{
  "modURL": "https://7daystodiemods.com/more-pipe-bombs/",
  "modCreatedTime": "2020-11-15T03:35:00+00:00",
  "modLastUpdatedTime": "2020-12-03T13:34:16+00:00",
  "modName": "More Pipe Bombs",
  "modImages": [],
  "modShortDescription": "This 7 Days to Die mod adds more pipe bombs to the game. They are all unlocked upon unlocking the normal/vanilla pipe bomb crafting in the game.",
  "modDescription": "This 7 Days to Die mod adds more pipe bombs to the game. They are all unlocked upon unlocking the normal/vanilla pipe bomb crafting in the game (via reading the schematic, or buying the perk)\n\n## Notable Changes\n\n* **New Item:** Plastic Pipe Bomb. Weak but easily craftable with little materials. Easiest to throw far.\n* **New Item:** Brass Pipe Bomb. Moderately strong. Good for using brass up. Slightly more material needed\n* **Modified Vanilla Item:** Iron Pipe Bomb. Moderately strong. Small changes made to fit with the other items\n* **New Item:** Steel Pipe Bomb.Very strong. Hardest to craft. Most material needed. Hardest to throw far.\n* **New Misc Items:** Plastic, Brass, and Steel Pipe Bomb parts. Since the vanilla pipe bomb uses a plain Iron pipe, Doughphunghus left the crafting of this item alone. The new parts are essentially “specially crafted pipes” that cannot be used for anything else or found.\n\n## Purpose of the Mod\n\nThe vanilla pipe bomb is not too useful (it rolls around and has a nice randomness to it) but it can be crafted fairly easily/early in the game before you get to grenades. This allows more of a progression to be able to craft “somewhat useful” ones early in the game and “more useful” ones a little later in the game (once you get the workbench, forge, and crucible). The tiering of the power of them means that you can choose the Plastic one to draw out zombies but not destroy (much) or, using the Steel one, do a lot of damage to wood POIs/zombies/terrain. Additionally, they all can be a good way to use up some not often used resources (like plastic/brass) you may have sitting around. All of them also quickly raise the heat level of the map (5% heat per explosion) so you can use the cheaper ones to get screamers to come without running a forge.\n\nCurrently the mod does not use any custom icons, just reuses vanilla graphics with some tinting so it should be ok for servers. But the Steel Pipe [bomb](https://7daystodiemods.com/tag/7-days-to-die-weapons/) does enough damage it may look like you are drop mining if a few are used against a POI completely made of wood.\n\n## Changelog\n\n* **_(new)_** Bugfix\n* Added ability to buy all new items in this modlet at traders (if they have them in stock!) in v1.0.6, updated for A19.\n* Reduced steel pipe bomb radius by 1\n* Increased stack size of all pipe bombs (even vanilla) to 30\n* Changed throwing “power” of steel pipe bomb to be a little easier on the arms. It still flies “the least” but its more in line with the others.\n\n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/doughphunghus/7D2D-Doughs-Mods-a19/tree/main/Doughs-Buff-PipeBombs)** for A19  \n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/doughphunghus/7D2D-Doughs-Mods-a18/tree/main/Doughs-Buff-PipeBombs)** for A18\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/17197-doughs-modlets/).\n\n**Credits:** [Doughphunghus](https://7daystodiemods.com/tag/doughphunghus/)",
  "modDownloadURLs": [
    {
      "Info": "for A19",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/doughphunghus/7D2D-Doughs-Mods-a19/tree/main/Doughs-Buff-PipeBombs",
      "Version": "v19"
    },
    {
      "Info": "for A18",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/doughphunghus/7D2D-Doughs-Mods-a18/tree/main/Doughs-Buff-PipeBombs",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/17197-doughs-modlets/",
  "modAuthors": [
    "Doughphunghus"
  ],
  "modTags": [
    "7 days to die weapons",
    "Doughphunghus"
  ]
}