{
  "modURL": "https://7daystodiemods.com/rabbit-of-caerbannog-mod/",
  "modCreatedTime": "2020-07-21T22:09:00+00:00",
  "modLastUpdatedTime": "2020-12-03T13:34:40+00:00",
  "modName": "Rabbit of Caerbannog Mod",
  "modImages": [],
  "modShortDescription": "This mod adds a very powerful, feral rabbit to the 7 Days to Die. Run Away! Run Away! It's small, fast, and hard to kill.",
  "modDescription": "This mod adds a very powerful, feral rabbit to the 7 Days to Die. Run Away! Run Away!\n\nThis is a silly mod, that is even sillier since caves have been temporarily removed from the game.\n\nFor those unfamiliar: [Rabbit Of Caerbannog Wikipedia](https://en.wikipedia.org/wiki/Rabbit_of_Caerbannog)\n\nThe rabbit was supposed to have a chance to spawn only in caves and violently patrol a small area (killing everything near it), but caves have been removed from the game (Doughphunghus is hoping it’s temporary). Currently the [rabbit](https://7daystodiemods.com/tag/7-days-to-die-animals/) has a chance of spawning in certain gamestages as part of the horde and has a much larger “patrol area” if it’s still alive when the night is over. Once caves return he will likely remove it from spawning in the horde unless people indicate they like it to be in the hordes. He doesn’t know how hordes generate with the “probability” so he guess its likely to get several of these on certain horde nights.\n\nDoughphunghus has not tested it really well to see how it behaves in a real game. He does know that its small, fast, and hard to kill if you can manage it.\n\n## Changelog\n\nTested for a19\\. No changes needed (It? seems? the game AI makes it a bit less willing to hunt you down ruthlessly than a18)\n\n**Release notes for v2.0.1**\n\n* Minor tweak to jump at you from farther away. Was supposed to be in v2.0.0.\n\n**Release notes for v2.0.0**\n\n* Works properly in a18.3\\. May not work well in previous game versions (not tested)\n* Rabbit now attacks\n* Rabbit now jumps\n* Rabbit now eats your flesh after you die.\n* Added Holy Hand Grenade of Antioch (modified from Khelldons version).\n\nModifications to it are: Cannot loot item, must craft from flesh chunk from a killed Rabbit of Caerbannog. Grenade explosion radius dropped a little to avoid frame rate loss. Made item ID unique so if you want both Khelldons grenade and this mod you can load them both.\n\n**Release notes for v1.0.2**\n\n* Rabbit now has a proper texture as of v1.0.2 of the mod. Thanks to Mumpfy for creating the white rabbit texture and Mjoelnir.hh for merging the texture into textures unity3d and providing help on how to use it.\n\n**Release notes for v1.0.1**\n\n* Rabbit is now pure white as of v1.0.1 of the mod. It doesn’t have any eyes. Which is unfortunate. But it will still find you.\n\n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/doughphunghus/7D2D-Doughs-Mods-a19/tree/main/Doughs-RabbitOfCaerbannog)** for A19  \n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/doughphunghus/7D2D-Doughs-Mods-a18/tree/main/Doughs-RabbitOfCaerbannog)** for A18\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/17197-doughs-modlets/).\n\n**Credits:** [Doughphunghus](https://7daystodiemods.com/tag/doughphunghus/)",
  "modDownloadURLs": [
    {
      "Info": "for A19",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/doughphunghus/7D2D-Doughs-Mods-a19/tree/main/Doughs-RabbitOfCaerbannog",
      "Version": "v19"
    },
    {
      "Info": "for A18",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/doughphunghus/7D2D-Doughs-Mods-a18/tree/main/Doughs-RabbitOfCaerbannog",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/17197-doughs-modlets/",
  "modAuthors": [
    "Doughphunghus"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die zombies",
    "Doughphunghus"
  ]
}