{
  "modURL": "https://7daystodiemods.com/entity-randomizer/",
  "modCreatedTime": "2020-12-25T04:12:00+00:00",
  "modLastUpdatedTime": "2020-12-25T04:16:07+00:00",
  "modName": "Entity Randomizer",
  "modImages": [],
  "modShortDescription": "A script that makes copies of vanilla zombies with random properties. The github repo has a copy of the generated modlets for each supported build.",
  "modDescription": "A script that makes copies of vanilla zombies with random properties. Interested? See also: “[Guppycur’s Random Zombie Getter Upper](https://7daystodiemods.com/random-getter-upper/)“\n\n## Notes\n\n* The script is released, and docs are on the github wiki, The github repo has a copy of the generated modlets for each supported build should you not want to go to the trouble of installing and getting the script set up.\n* This is an experiment and Doughphunghus is releasing it as a demo to see if this is worth perusing! Please read the notes on Github: [Main Page](https://github.com/doughphunghus/7D2D-EntityRandomizer).\n\n## Changelog\n\n* Doughphunghus has generated pre-generated modlets for a19.3 b6 stable.\n* He has started doing diffs of the vanilla configs as updates are pushed (to see if he can tell which of his mods break without testing them all), and it looks like (his best guess, no guarantees!) the a19.2 b4 pre-generated modlets should work with a19.3 b6\\. So if you were playing a game in 19.2 b4 and didn’t want to update just because of these pre-generated modlets, it might be safe. Even if it was not, you could likely pull out the 19.2 b4 one and replace it with the a19.3 b6 one and all that would likely? happen is any spawned entities would cease to exist, and it would likely throw some console errors as the game tried to spawn them when you entered a chunk where they were spawned before the update. Just his guess, he has not tested this.\n* The important thing is only load one “set” of mods for a particular version, do not try to load them all across versions.\n\n**[Download](https://github.com/doughphunghus/7D2D-EntityRandomizer/archive/master.zip)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/17197-doughs-modlets/).\n\n**Credits:** [Doughphunghus](https://7daystodiemods.com/tag/doughphunghus/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/doughphunghus/7D2D-EntityRandomizer/archive/master.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/17197-doughs-modlets/",
  "modAuthors": [
    "Doughphunghus"
  ],
  "modTags": [
    "7 days to die zombies",
    "Doughphunghus"
  ]
}