{
  "modURL": "https://7daystodiemods.com/object-manipulator/",
  "modCreatedTime": "2020-10-26T19:42:00+00:00",
  "modLastUpdatedTime": "2020-12-26T17:28:03+00:00",
  "modName": "Object Manipulator",
  "modImages": [],
  "modShortDescription": "This mod introduces a new control panel that allows the user to manipulate and adjust the selected transform's scale, position, and rotation.",
  "modDescription": "This mod introduces a new control panel that allows the user to manipulate and adjust the selected transform’s scale, position, and rotation.\n\nFirst enter the creative menu and drag a TE\\_ObjectManipulatorHandgun into your toolbar. When you first hold the gun in your hand, the control panel will appear. You can toggle the control panel by shooting the gun. You can toggle the screen cursor by pressing the F2 button, which will allow you to click on the buttons and type in the search box, or copy position values.\n\n## Changelog\n\n* Added item class override to the gun\n* Added a target sphere to show where the gun is aiming on an entity\n* Changed gun behaviour to now change to the target when left clicking and toggling the control panel when right clicking\n* Changed start up state to off, must right click gun to enable\n* Added a button to disable the current target Animator component\n\nThis is a DMT mod. So requires [DMT Modding Tool](https://community.7daystodie.com/topic/13037-dmt-modding-tool/).\n\n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/TormentedEmu/7DTD-A19-DMTMods/tree/master/TE_ObjectManipulator)**\n\nPlease let her know if you have any questions, or have any problems/bugs with it. She is usually found on [Guppycur’s Discord](https://discord.gg/mh3J3dS). Her nickname on the Discord is V.\n\n**Credits:** [TormentedEmu](https://7daystodiemods.com/tag/tormentedemu/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/TormentedEmu/7DTD-A19-DMTMods/tree/master/TE_ObjectManipulator",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modAuthors": [
    "TormentedEmu"
  ],
  "modTags": [
    "7 days to die menu",
    "TormentedEmu"
  ]
}