{
  "modURL": "https://7daystodiemods.com/research-system-and-new-weapons/",
  "modCreatedTime": "2021-01-06T00:32:04+00:00",
  "modLastUpdatedTime": "2021-01-06T00:32:06+00:00",
  "modName": "Research System and New Weapons",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/12/7-days-to-die-research-system-and-new-weapons-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/12/7-days-to-die-research-system-and-new-weapons-additional-screenshot-2.jpg"
  ],
  "modShortDescription": "This mod introduces a research system for the Tier weapons, tools and armor. Furthermore there are 6 added weapons.",
  "modDescription": "This mod introduces a research system for the Tier weapons, tools and armor. Furthermore there are 6 added weapons: Tank Rifle and Barrett Cal. 50 for Dead Eye, Uzi for Gunslinger and for the Intellect Atribute there are 2 kinds of Tasers and a Thermite Launcher. And a 6th secret weapon. Also there is a new material which comes after Steel.\n\nSo this mod started basically because I didn’t like that grilled meat costs 5 pieces of meat. And that a seed costs 5 fruits of the plant.\n\nFrom there things started rolling and I learned everything on the go.\n\nAs already stated there are 6 new weapons. I always felt the Intellect Attribute while being very supportive to craft the vehicles and new materials, always lacked own useful [weapons](https://7daystodiemods.com/tag/7-days-to-die-weapons/).\n\nThat’s why I made 3 new ones: Taser T1 and T2 for the Electrocutioner Perk. (also the Shocked Effect now lasts almost twice as long) And the Thermite Launcher which belongs to the Physician Perk. It is a late game weapon with expensive ammo but very useful against strong/radiated Zombies. It deals damage over time and kills the “weaker” radiated zombies mostly with one hit.\n\nThe Dead Eye also got 2 new weapons. Same Spiel here: While the Shotgun and Machine Gun Perk are provided with strong T3 weapons to deal with crowds, the Dead Eye only has a mediocre weapon comparing to these two. So he is provided with 2 new weapons: Tank Rifle which uses special ammo made from forged steel, it deals massive damage. Good for single strong zombies. The upgrade is the Barret Cal 50\\. with a bigger magazine. Through the Penetrator Perk it is also be useful against crowds, zombies will be flying all over the place.\n\nThe Uzi is a middle step between pistol and Mp5.\n\nAlso it needs to be said that the ingame skins are all based on vanilla skins. There are NO NEW SKINS in the game. I am just using existing ones and changed the properties, name and icon.\n\nMod language is English and German.\n\n**What else is there:**\n\nAfter Steel now comes a next tier Material. (from which can be crafted tools, some melee weapons, a powerful but very heavy armor and the standard steel block is upgradeable)\n\nThese tools definetly compare to Motor tools, with some points in Sexual Tyranosaurus they might even outperform them. They do more damage than steel tools and cost less stamina to use and also have a higher rate of swings per second.\n\nThe material itself I saw on two other mods- but besides the name of the material I didn’t copy anything at all.\n\nThere is a very special way to craft it. You need a Engineer Lvl 5 to smelt the basic ingredient in the forge, a Physician Lvl 4 is needed to produce the very specific reagent which is capable of melting the material into Ingots. A Lvl 5 Tool Crafter is needed to craft the Shaft for the Tools. And also you need special glue for which you need to gather Mutated Corn.\n\nAnd then there is another secret material from which can be crafted a powerful weapon, go find out yourself.\n\n## The Research System\n\nBasically everything is craftable now.\n\nTo craft the items that werent available before or just through finding the specific schematic, here is how to unlock them:\n\n* Get the specific Perk (in the ingame description, or for a weapon it is always the specific perk)\n* After reaching a certain level, you are not able to craft the item directly, rather you unlocked to craft the SCHEMATIC for the wanted item.\n* Gather the required resources and then research the schematic. Read the schematic and now you are able to craft the item.\n\nFor the guns it is in general like this:\n\n* T1 weapon is craftable from basic resources after learning Perk Lvl 1\n* T2 weapon schematic and the weapon part schematic are craftable after learning Perk Lvl 3\n* T3 weapon schematic is craftable after learning Perk Lvl 5\n\nExceptions are:\n\n* MachineGunner: T1 weapon is craftable after learning Perl Lvl 3 (AK47 has also been downgraded in terms of accuracy)  \n   * T2 weapon schematic is craftable after learning Perk Lvl 4\n* Pistol Pete: There are now 2 T2 weapons- Uzi and Magnum  \n   * For T3 weapons, Lvl 4 is enough to learn them. However you need to have a Uzi to learn the Mp5 and you need to have a Magnum to learn the Desert Vulture.\n\nFor Melee Weapons, Tools, Armor and Bows you can craft the Steel version / T3 version of the parts usually at Lvl 4 the same as the T3 schematic.\n\nWeapon mods schematics can also be crafted. You need the weapon parts of the belonging perk to do so. For example Machine Gun Parts for the extended magazine.\n\nThe Crucible Schematic is already craftable after attaining Engineer Lvl 3.\n\nHowever, of course you still can find everything through looting, I didn’t change that at all.\n\nFurthermore:\n\nGuns now have the exact amount of quality as the perk. Whereas Melee, Tools and Bows have a bonus of +1 INCLUDING Level 5, which means you can craft these items of quality 6.\n\nThe Stun Baton got upgraded. Perk Lvl 5 Electrocutioner grants 30% Faster. Hitting with the Baton and each swing costs 30% less stamina.\n\nThen there are some more small changes:\n\nAs stated in the beginning seeds now only cost 1 fruit. And charred/cooked/grilled meat costs now only 2 pieces of meat. I think this is more balanced because now you can actually cook and eat the meat, rather than safing it for later on for the advanced meals which are like 600 percent more effective.\n\nA new drink called Mead. You can craft it with honey.\n\nWell, mostly that’s it.\n\nIt is my first mod and I was learning everything while doing it. There are one or two things I learned later on which I would have done differently when I would start again.\n\nI took the 9mm ammo HP and AP away from the normal guns and used it is special ammo exclusive for the mod weapons, same for flaming crossbow bolts, as I have made bad experiences with custom ammo in the beginning.\n\nBut also I wanted to finish this project before the holidays and also before Alpha 20 gets too close.\n\nSo everything works perfectly fine and is tested.\n\nSpecial thanks to “Flexible Games” on YouTube for teaching me the basics of writing a mod and also “Max Fox” who also covered more advanced stuff.\n\n## Changelog\n\n* Balanced: Reduced Weapon Parts Costs\n* New Look for Titanium Block\n* Black Dye and Blue Dye craftable for the cosmetic of the Mod-Weapons\n* No longer quality penalty for gun crafting\n\nTo install the mod, place the mod file into a “Mods” Folder in the 7 Days to Die Main folder. The mod need to be installed on server and client side, as I am using custom Icons.\n\n**[Download](https://github.com/Squallll94/Squall/raw/main/ModdigerModOfficial.rar)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/23003-research-system-and-new-weapons/).\n\n**Credits:** Squall",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/Squallll94/Squall/raw/main/ModdigerModOfficial.rar",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/23003-research-system-and-new-weapons/",
  "modAuthors": [
    "Squall"
  ],
  "modTags": [
    "7 days to die armor mods",
    "7 days to die tools",
    "7 days to die weapons"
  ]
}