{
  "modURL": "https://7daystodiemods.com/skyrim-style-lockpicking/",
  "modCreatedTime": "2021-01-07T16:43:00+00:00",
  "modLastUpdatedTime": "2021-01-07T16:45:54+00:00",
  "modName": "Skyrim Style Lockpicking",
  "modImages": [],
  "modShortDescription": "Xyth is releasing a mod of the locks that work with the lockpicking code added to the 19.3 version of SphereII's Core.",
  "modDescription": "Like the title says, SphereII and Xyth missed the Skyrim style lockpicking mini game so they introduced it into the [WinterWeen](https://7daystodiemods.com/winterween-project/) mod. It was well received, so Xyth is releasing a mod of the locks that work with the lockpicking code added to the 19.3 version of SphereII’s Core.\n\nThe difficulty of the locks is configurable in the core, but it set to offer a challenge but not be impossible for folks that didn’t master lockpicking in Skyrim. To pick a lock, press “E” on any locked door or chest. A lock will appear, and you must guess the position of the top lockpick by moving it with the arrow keys or mouse. Once you think you have the position, press the spacebar to turn the lock. The locks are tied into the perk system and the inventory system, so you will need [lockpicks](https://7daystodiemods.com/tag/7-days-to-die-tools/) in your inventory. Each perk level into lockpicking make it less likely you will break a pick, and reduced the time between attempts. However, they randomized lock difficulty so any one can be really hard or almost too easy.\n\nThis mod contain some purchased assets and code, so while you may use or include this mod in you game or overhaul, you cannot make edits to the models or code without purchasing your own copy of the assets from the Unity store. It’s cheap though.\n\nIf this mod is popular they may add additional features for A20.\n\nThanks to Mumpfy for adding the branding to the lock textures!\n\n## Changelog\n\nPushed update to the Lock modlet, forcing advanced lockpicking to True. Seems to work well now.\n\n## Installing\n\nThis is a DMT mod so it must be compiled with [DMT Modding Tool](https://community.7daystodie.com/topic/13037-dmt-modding-tool/), or loaded by the mod launcher. This mod has a dependency that must be compiled with this mod for it to work properly. **Required:** [0-SphereIICore](https://7daystodiemods.com/dmt-mods-by-sphereii/)\n\n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/7D2D/A19DMTMods/tree/master/Locks)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/23100-skyrim-style-lockpicking/).\n\n**Credits:** [Xyth](https://7daystodiemods.com/tag/xyth/), SphereII",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/7D2D/A19DMTMods/tree/master/Locks",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/23100-skyrim-style-lockpicking/",
  "modAuthors": [
    "Xyth",
    "SphereII"
  ],
  "modTags": [
    "7 days to die tools",
    "Xyth"
  ]
}