{
  "modURL": "https://7daystodiemods.com/sams-working-stuff/",
  "modCreatedTime": "2021-01-26T03:09:00+00:00",
  "modLastUpdatedTime": "2021-01-26T03:12:13+00:00",
  "modName": "Sam's Working Stuff",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-sams-working-stuff-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-sams-working-stuff-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-sams-working-stuff-additional-screenshot-3.jpg"
  ],
  "modShortDescription": "Saminal is back, with his second public mod release. It's a bunch of working items for your base. Working Oven, Working Faucets, Working Lamps and Lights.",
  "modDescription": "And Saminal is back, with his second public mod release. This time, it’s a bunch of working items for your base, based on existing vanilla items so everything is server-side only.\n\n## Working Oven\n\nBuild yourself a working wall oven which functions the same as a campfire, with a slightly lower heatmap footprint. This is unlocked by the Master Chef perk.\n\n## Working Faucets (or taps, if you like)\n\nUsing an existing brass or household faucet, which you can either forge, or steal from a house, you can craft a working version which will allow you to fill jars and buckets in the comfort of your own survival fortress / cosy homestead. These are unlocked by the Advanced Engineering perk.\n\n## Working Lamps and Lights\n\nAdds a new variant block to allow placing a number of lamps usually only available in “POI” form. These working versions require power, and they can be turned on and off like the vanilla player craftable [lights](https://7daystodiemods.com/tag/7-days-to-die-lights/).\n\nIn keeping this server-side only, he has been unable to modify the models for these and as a result, the wire connection point for most of the lights is in the centre of the block, which looks a bit awful for most of them. To work around this, he has included a wireless wire relay. Any [cables](https://7daystodiemods.com/tag/7-days-to-die-electricity/) to and from this relay are invisible.\n\nThe lights and wireless relay are unlocked by the Advanced Engineering perk, and also by the Basics of Electricity schematic.\n\n## Changelog\n\n* Added Working Gas Grill and Working Charcoal Grill\n* Added 10 more lights to the Working Lamps and Lights\n* Fixed wrong icon on Brass Porch Light\n\n**[Download](https://drive.google.com/file/d/1jGy79HTQTjzcDJOzhH9wgmacZ0E3tgNs/view?usp=sharing)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/23157-sams-working-stuff/).\n\n**Credits:** [Saminal](https://7daystodiemods.com/tag/saminal/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/1jGy79HTQTjzcDJOzhH9wgmacZ0E3tgNs/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/23157-sams-working-stuff/",
  "modAuthors": [
    "Saminal"
  ],
  "modTags": [
    "7 days to die building materials",
    "7 days to die electricity",
    "7 days to die lights",
    "Saminal"
  ]
}