{
  "modURL": "https://7daystodiemods.com/ztensitys-wasteland-creature-renaming/",
  "modCreatedTime": "2021-01-26T20:50:00+00:00",
  "modLastUpdatedTime": "2021-01-26T21:55:02+00:00",
  "modName": "Ztensity's Wasteland Creature Renaming",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-wasteland-creature-renaming-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-wasteland-creature-renaming-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-wasteland-creature-renaming-additional-screenshot-3.jpg"
  ],
  "modShortDescription": "An A19.3 Patch That Renames Raiders, Soldiers & Zombies.",
  "modDescription": "An A19.3 Patch That Renames Raiders, Soldiers & Zombies\n\n## INTRODUCTION\n\nInto hours of playing 7 Days to Die and diving into the vast modding community, I decided to use Sirillion’s entire SMX series. His modlets overhaul the UI of 7 Days to Die, which make changes to the HUD, Menu and general UI. I realized sometime later that my favorite modlet of this series was his optional, Target Health Bar, designed for compatibility with his UI overhaul.\n\nAfter playing 7 Days to Die with a full list of modlets including the SMX series, I quickly realized that some animals, zombies, machines and more would show up in the health bar from the Target Health Bar modlet as “mutantSM1melee1” and “humanSoldier5Knife” instead of “Morphed Infected” and “Tech Soldier” while using Bdubyah’s The Wasteland.\n\nAfter six different patches that renamed creatures from Vanilla and Xyth’s Creature Pack series to Mumpfy’s Zombie Pack, I am now releasing this next iteration in the series by request of swmeek. With the intent to continue increasing immersion when encountering different creatures in game, this patch is now publicly available for download!\n\n## HEALTH BAR DEPENDENCIES\n\nBefore deciding to install any of my renaming modlets, you must first have to have a Health Bar modlet to see the name changes. See below:\n\n* Sirillion’s [SMX Series Target Health Bar](https://7daystodiemods.com/zmxhudcpthb/)\n* Khaine’s [HP Bars](https://7daystodiemods.com/hp-bars/)\n\nIt’s worthy to note that if you are using the Mod Launcher, you can install all of Sirillion’s SMX series of modlets there. That said, once you have installed one of the health bar modlets, you must then install Bdubyah’s The Wasteland to make this modlet’s renaming to work.\n\n## WASTELAND CREATURE RENAMING DEPENDENCY\n\nWasteland Creature Renaming is dependent on Bdubyah’s mod titled, The Wasteland. Inspired by the Fallout franchise, he not only brings players raider NPCs, soldier NPCs and zombies, but he also adds a handful of other things from multiple guns, new modifications, special POIs and more!\n\nYou must install [The Wasteland](https://7daystodiemods.com/the-wasteland/) in order for this modlet’s features to take affect.\n\n## WASTELAND CREATURE RENAMING\n\nWasteland Creature Renaming is the latest modlet in my renaming series to offer names for a variety of creatures from humans, zombies and animals to mechs and turrets. Starting with Vanilla Creature Renaming, I then renamed creatures from other mods like Xyth’s Creature Pack’s and Mumpfy’s Zombie Pack.\n\nNow, as promised, I’m back with another patch that renames creatures. This time however, I have renamed every zombie, human soldier and human raider added by Bdubyah’s The Wasteland. As my first iteration of the series, updates to the names are likely to occur, especially if suggested.\n\nAfter releasing Vanilla Creature Renaming, Creature Pack Animal Renaming, Creature Pack Zombie Renaming, Creature Pack Human Renaming and Shotgun Messiah Mechs, I have now provided names for creatures to Bdubyah’s, The Wasteland, which continues closing the gap for immersion!\n\n## MY ADDITIONAL MODLETS\n\nYou can find all of my publicly released modlets here:\n\n* [Creature Renaming](https://7daystodiemods.com/ztensitys-creature-renaming-mod-series/)\n* [Unnecessarily Beautiful But Immersive (UBBI)](https://7daystodiemods.com/ztensitys-unnecessarily-beautiful-but-immersive-ubbi/)\n* [SMX UI Tweaks](https://7daystodiemods.com/ztensitys-smx-ui-tweaks/)\n\nNote: If you use Sirillion’s SMX, my modlet SMX UI Tweaks is a powerful tool that will allow each of you the opportunity to control your UI a little more with his UI overhaul!\n\n## RENAMING “PATCHES” CONTINUED EXPANSION\n\nI will continue creating new modlets to patch names for creatures from other mod authors, to further increase immersiveness for players. Just as swmeek suggested a renaming modlet for creatures added by The Wasteland, if you have a mod you use a lot that has name types like “zombieFeralGhoul,” feel free to suggest it and I will consider it for my next renaming mod!\n\nFuture Renaming Ideas: Snufkin’s Server Side Zombies, MickkPewPew’s Server Side Santa and Friends, and MickkPewPew’s Server Side Zombies and Bosses.\n\n## SHOUTOUTS\n\nI want to always say thank you to other mod authors and Guppy’s Discord, as I have learned so much over the past couple months and without that community, none of this would have been possible.\n\n**[Download](https://drive.google.com/u/0/uc?id=1GDmKFeibrkfsuxgnYmsAYK9dJ-Z96j6-&export=download)**  \nAlso available on the mod launcher!\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/23385-ztensitys-wasteland-creature-renaming/).\n\n**Credits:** [Ztensity](https://7daystodiemods.com/tag/ztensity/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/u/0/uc?id=1GDmKFeibrkfsuxgnYmsAYK9dJ-Z96j6-&export=download",
      "Version": "v19"
    },
    {
      "Info": "Also available on the mod launcher!",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/23385-ztensitys-wasteland-creature-renaming/",
  "modAuthors": [
    "Ztensity"
  ],
  "modTags": [
    "7 days to die npcs",
    "Ztensity"
  ]
}