{
  "modURL": "https://7daystodiemods.com/true-survival/",
  "modCreatedTime": "2021-01-31T20:44:00+00:00",
  "modLastUpdatedTime": "2021-01-31T21:01:01+00:00",
  "modName": "True Survival",
  "modImages": [],
  "modShortDescription": "This mod was designed to walk the line between realism and fun engaging gameplay. In this mod death occurs when your player can not respawn anymore.",
  "modDescription": "This mod was designed to walk the line between realism and fun engaging gameplay. Where realism became grindy or not fun Spider tried to aim for engaging gameplay mechanics with a focus on risk and reward and a strong sense of consequences. Death in this mod should not be viewed as dyeing and respawning but as if you got beaten to near death and stumbled home and passed out till you wake up(respawn). In this mod death occurs when your player can not respawn anymore.\n\n## Choosing Your Character\n\nUpon starting, players will have 5 Knowledge Points available to purchase Negative Traits, Positive Traits and a Profession. Each Negative Trait cost 1 Knowledge Point and will refund a set amount of Knowledge Points. The lowest priced Professions cost 8 Knowledge Points so to pick a Profession Negative Traits must be chosen. These choices will determine the players starting stats, items and recipes. Players are able to learn all Professions over time by collecting 20 Profession Pages and crafting another Professions Kit. Negative and Positive Traits do not stack. Positive Traits can be purchased during game play with Skill Points gained from leveling.The following are the Players Starting Choices.\n\nNegative Traits **Only purchasable at start of the game, do not stack**\n\n* Slow Driver **Cost 1 Refunds 2 Knowledge Points**  \n   * Trait Effect = -10% Vehicle top speed\n* Sleepy **Cost 1 Refunds 2 Knowledge Points**  \n   * Trait Effect = -20% Slower Fatigue refill speed\n* Clumsy **Cost 1 Refunds 2 Knowledge Points**  \n   * Trait Effect = +10% More noise when moving\n* All Thumbs **Cost 1 Refunds 2 Knowledge Points**  \n   * Trait Effect = -10% Slower Crafting speed / -10% Slower Lockpicking speed\n* Weak Stomach **Cost 1 Refunds 3 Knowledge Points**  \n   * Trait Effect = +15% More chance to get Food Illnesses\n* Agoraphobic **Cost 1 Refunds 3 Knowledge Points**  \n   * Trait Effect = When Outdoors +10% More [Stamina](https://7daystodiemods.com/tag/7-days-to-die-stamina/) to Melee / -10% Slower reloading / -10% Slower Aiming / -10% Weapon control\n* Claustrophobic **Cost 1 Refunds 3 Knowledge Points**  \n   * Trait Effect = When Indoors +10% More Stamina to Melee / -10% Slower reloading / -10% Slower Aiming / -10% Weapon control\n* Bad Leg **Cost 1 Refunds 3 Knowledge Points**  \n   * Trait Effect = Chance to trigger old leg injury when jumping or running (can trigger no more than once per 15 min, treated with snow)\n* Asthmatic **Cost 1 Refunds 3 Knowledge Points**  \n   * Trait Effect = -20% Slower Stamina regain\n* Out of Shape **Cost 1 Refunds 3 Knowledge Points**  \n   * Trait Effect = When Encumbered +5% More effect / +5% More Stamina on Melee / -5% Slower Stamina regain\n* Smoker **Cost 1 Refunds 3 Knowledge Points**  \n   * Trait Effect = -20% Slower Stamina regain while running / -10% Top Speed / Smoking Addiction\n* Hemophobic **Cost 1 Refunds 4 Knowledge Points**  \n   * Trait Effect = -20% Slower healing of tended wounds\n* Thin Skinned **Cost 1 Refunds 4 Knowledge Points**  \n   * Trait Effect = +10% More chance to get wounds from attacks\n* Weak **Cost 1 Refunds 4 Knowledge Points**  \n   * Trait Effect = When Encumbered +10% More effect / +10% More Stamina on Melee / -10% Slower Stamina regain\n\nProfessions **All can be learned by collecting loot items during game, do not stack**\n\n* Cop **Cost 8 Knowledge Points**  \n   * Starting Recipes – Police Baton; Gun Oil; Weapon Repair Kit ; Pistol  \n   * Starting Bonus Stats – 10% Faster Reloading and 10% better Aim with Pistol and Magnum  \n   * Starting Bonus Gear – Old Revolver 6q; 9mm Rounds x16\n* Chef **Cost 8 Knowledge Points**  \n   * Starting Recipes – All Food Recipes  \n   * Starting Bonus Stats – +20% Faster Food Cooking speed  \n   * Starting Bonus Gear – old Knife 6q\n* Fireman **Cost 8 Knowledge Points**  \n   * Starting Recipes – Plant Salve, First Aid Bandage, Molotov Cocktail  \n   * Starting Bonus Stats – 5% More Stamina; 20% More Block Damage with Axes  \n   * Starting Bonus Gear – fireman Axe 3q, Fireman’s Almanac Axes\n* Thief **Cost 8 Knowledge Points**  \n   * Starting Recipes – Lock Pick  \n   * Starting Bonus Stats – 3 Block Treasure Radius; 20% Faster Loot timers; 10% Faster Crouch Speed; 10% Less Noise when Crouched  \n   * Starting Bonus Gear – Old Knife 6q; Lock Pick x 20\n* Park Ranger **Cost 8 Knowledge Points**  \n   * Starting Recipes – Herbal Antibiotics, Stone Spear, Iron Spear, Steel Spear  \n   * Starting Bonus Stats – 20% Faster Primitive Crafting  \n   * Starting Bonus Gear – Old Rifle 6q; 762mm Round x 19\n* Bouncer **Cost 8 Knowledge Points**  \n   * Starting Recipes – Steel Knuckles, Brass Knuckles Mold, Brass Knuckles, Knuckle Wrap, Beer, Mead, Grain Alcohol  \n   * Starting Bonus Stats – 10% Less Stamina when Brawling  \n   * Starting Bonus Gear – Brass Knuckles 3q\n* Carpenter **Cost 9 Knowledge Points**  \n   * Starting Recipes – All Wood Frames, Planks, Nails, Wood Doors and Hatches, Wooden Chest  \n   * Starting Bonus Stats – 20% Faster Crafting on the Workbench and Tablesaw  \n   * Starting Bonus Gear – Claw Hammer 3q, Nail x50\n* Soldier **Cost 9 Knowledge Points**  \n   * Starting Recipes – Grubs; Weapon Repair Kit; Pipe Bomb; Blunderbuss; Blunderbuss Ammo; Cooking Pot Mine; AK47  \n   * Starting Bonus Stats – 10% Faster Reloading and 10% better Aim with AK47 and M60, Can not get sick from eating Grubs  \n   * Starting Bonus Gear – Old Rifle 6q; 762mm Round x19\n* Fitness Instructor **Cost 9 Knowledge Points**  \n   * Starting Recipes – All Drink Recipes, Vitamins  \n   * Starting Bonus Stats – 5% Less Stamina from Running; 10% Faster Run Speed; 10% Faster Walk Speed  \n   * Starting Bonus Gear – Bat 3q\n* Electrician **Cost 9 Knowledge Points**  \n   * Starting Recipes – Generatorbank, Pressureplate, Batterybank, Player Lights, Electrictimerrelay, Electricwirerelay, Motionsensor, Speaker, Switch, Electricfencepost, Spotlight, Stun Baton, Electric Parts  \n   * Starting Bonus Stats – 20% Faster Electrical Crafting  \n   * Starting Bonus Gear – Scredriver 3q\n* Mason **Cost 9 Knowledge Points**  \n   * Starting Recipes – All Brick and Flagstone Frames, Bricks, Cobblestone  \n   * Starting Bonus Stats – 20% Faster Mason Crafting  \n   * Starting Bonus Gear – Mason Hammer 3q\n* Iron Worker **Cost 10 Knowledge Points**  \n   * Starting Recipes – All Scrap Iron Frames, Iron Sheet Metal, Nut and Bolts  \n   * Starting Bonus Stats – 20% Faster Crafting on the Forge  \n   * Starting Bonus Gear – Wrench 3q\n* Mechanic **Cost 10 Knowledge Points**  \n   * Starting Recipes – Auger; Chainsaw; Small Engine, Large Engine, Minibike, Bicycle, Motorcycle, 4×4 Truck, Gyrocopter  \n   * Starting Bonus Stats – 20% Faster Mechanical Crafting  \n   * Starting Bonus Gear – Wrench 300q\n* Doctor **Cost 11 Knowledge Points**  \n   * Starting Recipes – Plant Salve, Stimulant, Painkillers, Steroids, Antibiotics  \n   * Starting Bonus Stats – 20% Faster Medical Crafting  \n   * Starting Bonus Gear – Suture Kit x 1; Painkillers x 6, Stimulant x 6, Aloe Cream x 6\n* Chemist **Cost 11 Knowledge Points**  \n   * Starting Recipes – Mega Crush, Stimulant, Acid, Gun Powder, Purification Tablets, Blackstrap Coffee, Glue  \n   * Starting Bonus Stats – 20% Faster Medical Crafting  \n   * Starting Bonus Gear – Stimulant x6, Painkillers x6\n* Farmer **Cost 11 Knowledge Points**  \n   * Starting Recipes – All Crop Seed Recipes, Insecticide, Watering Can, Fertilizer, Farm Plot  \n   * Starting Bonus Stats – 20% Faster Seed Crafting  \n   * Starting Bonus Gear – None\n\nPositive Traits **Can be purchased at start of game or with Skill Points when leveling, do not stack**\n\n* Fast Driver **Cost 1 Knowledge Points**  \n   * Trait Effect = +10% Vehicle top speed\n* Wakeful **Cost 1 Knowledge Points**  \n   * Trait Effect = +20% Faster Fatigue refill speed\n* Graceful **Cost 1 Knowledge Points**  \n   * Trait Effect = -10% Less noise when moving\n* Dexterous **Cost 1 Knowledge Points**  \n   * Trait Effect = +10% Faster Crafting speed / +10% Faster Lockpicking speed\n* Iron Gut **Cost 2 Knowledge Points**  \n   * Trait Effect = -15% Less chance to get Food Illnesses\n* Outdoors Man **Cost 2 Knowledge Points**  \n   * Trait Effect = -10% Less Weather Effect\n* Fit **Cost 3 Knowledge Points**  \n   * Trait Effect = When Encumbered -5% Less effect / -5% Less Stamina on Melee / +5% Faster Stamina regain\n* Thick Skinned **Cost 3 Knowledge Points**  \n   * Trait Effect = -10% Less chance to get wounds from attacks\n* Gymnast **Cost 3 Knowledge Points**  \n   * Trait Effect = -10% Less Stamina when jumping / +10% Farther safe fall distance / +10% Higher jumping\n* Medic **Cost 3 Knowledge Points**  \n   * Trait Effect = +20% Faster healing of tended wounds\n* Amateur Mechanic **Cost 4 Knowledge Points**  \n   * Trait Effect = Starts with Bicycle and Mini Bike Recipes\n* Hunter **Cost 4 Knowledge Points**  \n   * Trait Effect = Can Track Deer and Pigs\n* Runner **Cost 4 Knowledge Points**  \n   * Trait Effect = +20% Faster Stamina regain while running / +10% Top Speed\n* Stout **Cost 4 Knowledge Points**  \n   * Trait Effect = When Encumbered -10% More effect / -10% Less Stamina on Melee / +10% Faster Stamina regain\n\n## Farming\n\n* All Seed Recipes found in loot\n* Seeds are made on a Drying Rack(workstation)\n* Player planted crops can be destroyed by non player entities touching them.\n* Player planted crops can be planted on any dirt type soil or crafted [Farm](https://7daystodiemods.com/tag/7-days-to-die-farming/) Plots.\n* All Rotten and Moldy old food items can be scraped into “Biomass” and used in crafting Fertilizer and other recipes\n* Player planted crop Seeds can be fertilized with the Watering Can and 1 Fertilizer. Once fertilized the crop will grow ⅓ faster and produce double the produce.\n* Player planted crops have a chance to dry out and need watering with the Watering Can and 3oz. of Dirty Water\n* Player planted crops have a chance to get infested with insects and need Insecticide applied with the Watering Can and 1oz. of Insecticide\n* List of cultivatable plants  \n   * Fruit Crops – Yucca, Blueberry, Pumpkin, Orange  \n   * Vegetable Crops – Corn, Potato, Carrot, Eggplant  \n   * Grain Crops – Corn, Wheat  \n   * Protein Crops – Mushrooms, Beans  \n   * Other – Aloe, Chrysanthemum, Cotton, Goldenrod, Coffee, Hops\n\n## Zombies and Predators\n\n* [Zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) require head shots to take damage from players, traps are un effected\n* Zombies move faster in darker areas\n* Zombie Types  \n   * **Normal** (standard zombies, speeds vary)  \n   * **Spitters** (Spit different types of acid and explode when near death)  \n   * **Brutes** (have a speed burst and do a lot of block damage)  \n   * **Tanks** (have a lot of health and a high chance to grab)  \n   * **Screamers** (summon zombie hordes)  \n   * **Boomers** (explode when near death)  \n   * **Suicide Boomers** (charge and explode on agro)  \n   * **Burning** (move fast, catch player on fire, dismember easy, leave fire trap on death)  \n   * **Ferals** (fast, high health)  \n   * **Crawling Ferals** (move on all fours fast, high health and can jump)  \n   * **Infected Animals** (have no fear and attack on sight)\n* Cop Zombies “Acid Puke” now leaves burning acid on you and can be removed with water.\n* Fat Zombies puke leaves a smell on you for a short time that attracts other Zombies and can be removed with water.\n* Fat Zombies explode when near death causing less player damage vs cop explosions, but greater block damage within a larger area and can puke on the player when close.\n* Snakes are now venomous and drop venom sacks which are used to make Anti-venom.\n* Custom Wandering hordes with unique infected animal groups\n\n## Zombie Bites and the Zombie Virus\n\n* The only way to catch the Z-Virus(Vanilla Infection) is to be bitten by an Infected.\n* The only way for a Infected to bite you is for them to first Grab you.\n* Stun is changed to a Grab (same buff just renamed and given a new Icon for immersion).\n* Your chance to be Grabbed by an Infected is based on your current Health, Stamina, Fatigue and Nutrition level.\n* Once Grabbed you can delay an Infected from biting you by 1 seconds with any melee hit to their head.\n* If bitten by an Infected you will catch the Z-Virus and receive a Bite Wound.\n* If the Z-Virus infection reaches 100% your character will die(Dead Dead!) and you will not be able to re spawn and must start a new character\n* Once you receive a Bite you will also get a Bleed that can be treated as normal. To remove the Bite you must cook a Metal/Steel Pipe in the Campfire and with it Cauterize the Bite. After you Cauterize the Bite you will have a Cauterized Bite Wound that you will need to treat with a Plant Salve. After applying Plant Salve you will need to treat the bite with a Bandage. After some time the bandage will get dirty and need reapplying. Do all this successfully and you will heal your Bite Wound, fail to do any of these steps and you will receive a wound.\n\n## Recipes\n\n* Tons of added recipes from new [foods](https://7daystodiemods.com/tag/7-days-to-die-food/), weapons, [clothes](https://7daystodiemods.com/tag/7-days-to-die-clothing/) and so on\n* Existing recipes adjusted in materials and/or quantity of materials needed\n* Removed Jar Recipe. Only found in loot\n* All foods that use jars now return them\n* Smelters use molds again\n* Workstations can accepted many tools\n* Bullet crafting requires a Bullet Press\n* Gun Crafting requires Gun Tools\n\n## New Systems\n\n* **Dead is Dead** – There is no bottom to wellness.The player loses 10 wellness every time they die and when they run out of wellness they can not spawn back into the game alive with that character.\n* All clothes found in loot are low quality but can be collected to learn how to craft them\n* Leather must be cured by cooking it in a pot with Brain Matter and Coal Lumps.\n* Cured Leather can then be dried on a Drying Rack.\n* Separate Repair Kits for Weapons (Weapon Repair Kit) and Machines (Scavenged Parts)\n* Small Engines for Bikes are made of parts\n* Tires can be scrapped for Scrap Rubber\n* Scrap Rubber can be melted in a campfire to produce Melted Rubber for crafting.\n* When Torches are placed they require fuel to burn and give off heat\n* Added Planks, Sticks, Large Logs, Small Logs, Branches\n* Added special meats from animals Bear Flank, Pork Belly, Venison Tenderloin\n* Bullet crafting requires a Bullet Press\n* Added advanced resources for harvesting from many world Blocks (i.e.: Stoves, Desk, Fridge, Beds, Chairs and many more)\n* Added many new scraping abilities\n* Clean water can be used to splash water on your head to cool you off for a short time\n* Added over 100 “Junk Items” to spice up looting. Junk items are everyday items found in loot that can be scraped for raw materials or used in crafting.\n* Bladed Weapons are no longer repaired but re sharpened with Sharpening Stones that can be looted or made in the forge.\n* Bladed Weapons have increased dismemberment chance but dull quicker.\n\n## Tools\n\n* Removed ability for stone axe to repair and upgrade.\n* Stone [tools](https://7daystodiemods.com/tag/7-days-to-die-tools/) do little damage against Metal\n* Iron tools do little damage against Steel\n* Removed Harvesting Tools quality levels\n* Added Screwdriver – Good for dismantling and harvesting Electronics\n* Added Mason Hammer – Good for dismantling Flagstone and Bricks Blocks, harvests Bricks and Cobblestone\n* Added Concrete Sledge -Good for dismantling Concrete Blocks, harvests Concrete Mix and Rebar\n* Added Welding Torch – Good for dismantling Steel Blocks, harvests Steel Sheet Metal\n* Added Crowbar – Used for picking up world blocks the player can not craft.\n* Removed the ability for Buckets to pick up and place water\n\n## Traps\n\n* Added Rigged Chest that looks like normal chest but explodes when open.\n* Changed [Mines](https://7daystodiemods.com/tag/7-days-to-die-traps/) to no longer instant kill Players. Candy Tin does 40 hp. Hubcap does 60 hp. Air filter does 90 hp. Pressure Plate does 65 hp.\n* All Mines now deal shrapnel damage when walked on. Shrapnel wound Bleeds, Breaks your leg, and wounds you.\n* Added 2 Decoy mines. Place Candy Tin or Air filter on the ground as a Decoy Mine that does nothing\n* Wooden Spikes do little damage but Zombies get stuck in them\n* Barbed Fence can now be picked up and does more damage. Zombies now get stuck in Barbed Fence\n* Wooden Tips now do more damage to Zombies and degrade faster\n\n## Workstations List\n\nAll workstations can now use anything in the tool slots. Increased Ingredient list to 6\\. Increased Crafting Ques to 5.\n\n* Mortar & Pestle – For grinding chemicals and medical items. Can also be used as a tool.\n* Stone Mill – For grinding objects into powder.\n* Anvil – For beating metal into shape. Can also be used as a tool.\n* Torches – Need fuel for light and heat\n* Campfire – For cooking and basic chemistry\n* Research Desk – For reverse engineering unknown crafting schematics\n* Armor Table – For crafting clothes and armor.\n* Dry Rack – For drying Skins, Firewood and creating Seeds from crops.\n* Workbench for crafting – For crafting objects\n* Chemistry Workbench – For crafting advanced medicines and chemicals\n* Fermentation Barre – For making Mead and Beer\n* Cement Mixer – For crafting stone building materials\n* Methane Producer – For producing Methane Bombs\n* Steel Forge – For smelting Steel, Bulletproof Glass and Plastics\n\n## Workstation Tools List\n\n* Anvil – Claw Hammer\n* Campfire – Stick, Cooking Grill, Cooking Pot, Frying Pan, Blender\n* Armor Table – Sewing Needle, Anvil, Leather Needle, Wrench, Welder, Small Loom\n* Workbench for crafting – Claw Hammer, Anvil, Bullet Press, Mortar & Pestle, Screwdriver, Welder, Wrench, Gun Tools, Tool & Die Set, Saw\n* Chemistry Workbench – Beaker, Lab Equipment, Still, Mortar & Pestle\n* Steel Forge – For smelting Steel, Bulletproof Glass and Plastics\n\n## Buffs\n\n* Added new Limp debuffs. When a player reaches 10% health they will limp. Heal up above 10% health to heal the Limp\n* Added new Fast Travel buff when you are traveling on a paved road. When on a paved road you will travel 20% faster. This Does apply to animals and zombies.\n* Smoking reduces hunger but has a slight stamina drain and lowers wellness slightly.\n\n## Wound Buff System\n\nAnything that can attack you has a chance to hurt you. Get hurt too much and you will be wounded. To heal the wound you will have to treat it and maintain it until it heals. This wound system has 5 stages:\n\n1. The first is Bruised and needs no tending to or maintaining it will heal on its own as long as you are not hurt more.\n2. The Second is a Small Wound. When you receive enough damage to get a Small Wound you will also get a Pain Buff that can be cured with a Pain Killer. To Heal the Small Wound you need to use a Bandage on it. After some time the bandage will get dirty and need reapplied. Do all of this successfully and your small wound will heal into Bruised. Fail to keep the wound clean or receive to much more damage from attackers and it will progress to a Wound.\n3. The Third is a Wound. When you receive enough damage to get a Wound you will also get a Sprained Leg Buff that can be cured with a Splint. To Heal the Wound you need to use a First Aid Bandage on it. After some time the First Aid Bandage will get dirty and need reapplied. Do all of this successfully and your Wound will heal into Small Wound. Fail to keep the wound clean or receive to much more damage from attackers and it will progress to a Sever Wound.\n4. The Forth is a Severe Wound. When you receive enough damage to get a Sever Wound you will also get a Gash Buff that can be cured with a Suter Kit. To Heal the Sever Wound you need to use a Sanitized Bandage on it. After some time the Sanitized Bandage will get dirty and need reapplied. Do all of this successfully and your Sever Wound will heal into a Wound. Fail to keep the wound clean or receive to much more damage from attackers and it will progress to an Infected Wound.\n5. The Last stage is an\n\n## Nutrition\n\nWhen the player starts and learns their profession their Nutrition stat is set to the highest level “Healthy Diet”.\n\nThere are 3 good stages to Nutrition:\n\n* At “Good Diet” you will start to gain wellness and health effects from foods.\n* At “Balanced Diet” you will begin to heal faster from injuries like broken or sprained leg, dysentery and other injuries.\n* At “Healthy Diet” when you are full you will receive a slow heal over time. It takes 7 game days for the full Nutrition buff to fade completely.\n\n### Bad Nutrition\n\nThe longer it has been since you had “Good Diet” the more your Malnourished Stat will start to stack up. Once all good Nutrition buffs fall off you will no longer receive wellness or health from food or drink. There are 3 stages to Malnourished:\n\n* At “Bad Diet” you will get hungry faster and lose stamina.\n* At “Vitamin Deficiency” you will take longer to heal from injuries; get hungry faster; lose stamina and move slower.\n* At “Malnourished” you will take longer to heal from injuries; get hungry faster; lose stamina; move slower and slowly start to lose wellness.\n\n## Completely New Skill and XP System\n\n* All quality items have their own crafting [skill](https://7daystodiemods.com/tag/7-days-to-die-skill-points/) and crafting a quality item only gives [XP](https://7daystodiemods.com/tag/7-days-to-die-experience/) toward its own crafting skill. So crafting Stoneaxes only gives XP for improving Stoneaxes.\n* Many added Perks\n\n## Changelog\n\n* Fixed a few zombies giving an error when looted\n* Removed the ability to scrap Corn Meal into Grain Servings\n* Changed Corn Meal and Flour to spoil(but not as fast as other foods)\n* Removed the recipe to make Flour with Grain Servings\n\n## Important Note\n\nMod is available in SP/Coop and Server play only available on the Official True Survival Test Server for testing. It is not finished and is still in active development and open to suggestions, feedback and bug reports. At this time no assets may be used for redistribution.\n\n* Test Server  \n   * IP – 172.96.166.50  \n   * Port. – 18733  \n   * PW – In DL ReadME\n* Server Files – Not Available Yet\n\n**[Download](https://github.com/SpiderJZMOD/TrueSurvivalA19TestClient/archive/master.zip)**  \nAlso available on the mod launcher!\n\nIf you appreciate Spider’s work and you want to show support, use this [donate link](http://www.paypal.me/JohnZidar).\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/3966-true-survival/).\n\n**Credits:** Spider",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/SpiderJZMOD/TrueSurvivalA19TestClient/archive/master.zip",
      "Version": "v19"
    },
    {
      "Info": "Also available on the mod launcher!",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/3966-true-survival/",
  "modAuthors": [
    "Spider"
  ],
  "modTags": [
    "7 days to die clothing",
    "7 days to die drinks",
    "7 days to die experience",
    "7 days to die farming",
    "7 days to die food",
    "7 days to die quests",
    "7 days to die skill points",
    "7 days to die stamina",
    "7 days to die starting items",
    "7 days to die tools",
    "7 days to die trader",
    "7 days to die traps",
    "7 days to die weapons",
    "7 days to die zombies"
  ]
}