{
  "modURL": "https://7daystodiemods.com/ztensitys-smx-ui-tweaks/",
  "modCreatedTime": "2021-02-02T06:13:00+00:00",
  "modLastUpdatedTime": "2021-02-02T06:16:51+00:00",
  "modName": "Ztensity's SMX UI Tweaks",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-smx-ui-tweaks-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-smx-ui-tweaks-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-smx-ui-tweaks-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-smx-ui-tweaks-additional-screenshot-4.jpg"
  ],
  "modShortDescription": "SMX Logo, Toolbelt Backsplash, Toolbelt Numbers & Compass Backsplash Removal (Permission Granted by Sirillion)",
  "modDescription": "SMX Logo, Toolbelt Backsplash, Toolbelt Numbers & Compass Backsplash Removal (Permission Granted by Sirillion)\n\n## INTRODUCTION\n\nAfter playing with Sirillion’s SMX series for a few months in my own playthroughs, while also showcasing the UI overhaul alongside my modlets like my Creature Renaming series, Shotgun Messiah Mechs and Unnecessarily Beautiful But Immersive, I’ve now decided to put together a patch for SMX.\n\nIf you’ve used SMX like me, you know that Sirillion has done a powerful job of overhauling and converting the Hud, Menu and general UI of 7 Days to Die to feel truly fresh and almost like a different game, especially when paired with other modlets like Custom Perks by Zuzul0l.\n\nNot only does Sirillion offer changes to the UI, but he has also created a target health bar modlet, a bigger bags expansion and a third forge slot that seamlessly blends in with this SMX series. For compatibility purposes, he has designed optional files that make parts of SMX work better with overhauls like Darkness Falls and other, smaller modlets.\n\nWhile SMX undoubtedly has a tasteful and aesthetic UI that is appealing not only to myself, but also a quarter of a million players around the world, there were a couple [hud](https://7daystodiemods.com/tag/7-days-to-die-hud-mod/) components and one Menu component I felt could be tweaked and that is where SMX UI Tweaks comes into play.\n\nSMX UI Tweaks removes the backsplash behind the inventory toolbelt hud element, it removes the toolbelt numbers under the toolbelt, it remove the compass backsplash, it removes the quest marker from the in-game menu hud and it removes the SMX logo from the main [menu](https://7daystodiemods.com/tag/7-days-to-die-menu/) and from the in-game hud to maintain consistency and increase immersion while playing with Sirillion’s fantastic UI Overhaul series.\n\n## REQUIREMENTS\n\nMost recent builds of 7 Days to Die should be playable with Sirillion’s SMX series and therefore these patches, however the most recent build of the game is recommended as always, which is currently version 19.3b6.\n\nIf you are using the main version of SMX UI Tweaks, you will need to download Sirillion’s SMXhud, which includes SMXhud, SMXhudCP and SMXlib, and SMXMenu, which includes SMXMenu and also SMXlib. If you are using one of or a combination of the optional versions, you may only need to download one or the other.\n\nTo have the same UI, health bar, etc. as all my other modlet’s showcase images however, I would encourage players to install Sirillion’s entire SMX series, the accompanying Target Health Bar, any other optional files of your choice if applicable and then my renaming modlets for creatures like zombies, animals, humans, mechs etc if applicable.\n\nDownload Sirillion’s SMX Series [Here](https://7daystodiemods.com/tag/7-days-to-die-smx-mods/).\n\nNote: When downloading more than one SMX modlet, keep in mind that they all require SMXlib, but only only one SMXlib modlet/folder is required to be in your “mods” folder for the series to work.\n\n## MAIN FILE VS. OPTIONAL FILES\n\nSMX UI Tweaks offers one main download file and four optional download files. The main download disables the SMX logo, the toolbelt backsplash, the compass backsplash and the hud time counter. However, if you choose you only wish to disable select UI elements instead of the entire set from either the hud or the main menu, then you can download the optional files instead. The optional download files consist of:\n\n* [Download](https://drive.google.com/u/0/uc?id=1DLQb8dy1CP7uS4ITDorTiTSRA-AmHxOH&export=download) SMX Logo Removal (Requires SMXhud & SMXMenu)\n* [Download](https://drive.google.com/u/0/uc?id=1pgjdk4iSI1IThiSpxLjqC1n-w4hQufiW&export=download) Compass Backsplash Removal (Requires Only SMXhud)\n* [Download](https://drive.google.com/u/0/uc?id=1ypMqoJAGEVfkvYfx790Ku7cvJJcxEEEl&export=download) Toolbelt Backsplash Removal (Requires Only SMXhud)\n* [Download](https://drive.google.com/u/0/uc?id=1SpfrRSWAgxqAAs93Jwi-4NCTRbAoFlbP&export=download) Toolbelt Numbers Removal (Requires Only SMXhud)\n* [Download](https://drive.google.com/u/0/uc?id=19Zwc7UDfMJtYCEn0LQpoe5j1odnMOOeM&export=download) Hud Time Counter Removal – Darkness Falls Compatibility Immersion Increase\n* [Download](https://drive.google.com/u/0/uc?id=1fvf2PQbPFmhtXDLjQ0d4AgWHjdeh7hiV&export=download) LBRB Pop-Up Removal (Requires Only SMXhud)\n* [Download](https://drive.google.com/u/0/uc?id=1X0EQReykOkDK_RofJemOUwNU1WrRqp3a&export=download) SMX Gamepad Callouts Removal (Requires Only SMXhud)\n\nChoosing to include Toolbelt Numbers Removal in your gameplay will be up to your personal preference, but I believe it comes down to whether you are primarily a keyboard and mouse player, a controller player and whether you pay attention to these numbers. If keyboard and mouse players pay attention to these numbers, they may choose to get all other optional files or a combination of other optional files outside of Toolbelt Numbers Removal, as all these optional files are already included in the main version.\n\nEach optional file should be compatible with each other. All of these shouldn’t be installed with the main file except for Hud Time Counter Removal, LBRB Pop-Up Removal and SMX Gamepad Callouts Removal. These three modlets are not included with SMX UI Tweaks and can be added for increased immersion. However, the other modlets like SMX Logo Removal and Compass Backsplash Removal cannot be used with SMX UI Tweaks, as it would cause problems and be redundant.\n\n**Note:** Hud Time Counter Removal was built for compatibility with Khaine’s Darkness Falls, as it removes the hud counter and backsplash behind the hud time counter in the game menus. However, if you wish to remove the time counter for increased immersion while using Sirillion’s SMX, then you may be able to use this optional file as well for that purpose (even without Darkness Falls).\n\n**Note:** SMX Gamepad Callouts Removal, LBRB Pop-Up Removal and Toolbelt Numbers Removal are three optional files that are optimal for controller players. While Toolbelt Numbers Removal is specifically for SMX only, LBRB Pop-Up Removal and SMX Gamepad Callouts Removal should be possible on vanilla playthroughs as well, as they both remove these UI elements regardless of an SMX install.\n\n## CLIENT VS. SERVER SIDE ONLY\n\nSince you are using Sirillion’s SMXhud and SMXMenu, you should already have his specific modlets ZMXhudCP, SMXhud, SMXMenu and SMXlib in your “mods” folder. Of the four, SMXlib is an asset library required for all SMX mods and coincidently also required for all players.\n\nTherefore, not only are Sirillion’s SMX mods required to be installed on both the server side and the client side, but these patches are also required for all players, regardless of solo play, multiplayer or if on a dedicated server.\n\n## CHANGELOG\n\n**UPDATE 1.2.0**\n\nSMX UI Tweaks has been updated to 1.2.0\\. In this version, I have hidden the quest tracker from the in-game menu hud, so that it’s not cluttered on-screen. Players will still be able to see their quest marker on-screen while not in the in-game menu hud (i.e. crafting, map, etc tabs), but this has been added to increase immersion whether you’re a controller player or a mouse and keyboard player.\n\n**LBRB CONTROLLER POP-UP & CONTROLLER CALLOUTS POP-UP OPTIONAL FILES**\n\nTwo new optional download files are now out! One is titled LBRB Pop-Up Removal and the other is called Gamepad Callouts Removal.\n\nLBRB Pop-Up Removal is a patch designed to remove the LB and RB popups from the in-game menu hud that come up while using a controller to increase immersion. This is optimal for controller players, is compatible with other optional files and can actually be installed alongside SMX UI Tweaks.\n\nSMX Gamepad Callouts Removal is a second patch designed to remove the gamepad callouts that come up while using a controller in the in-game menu hud to increase immersion. This is optimal for controller players, is compatible with other optional files and can also be installed alongside SMX UI Tweaks.\n\n## CREDITS\n\nAll credit is due to Sirillion for his original modlet titled SMX. With Sirillion’s permission , I have created this modlet only to remove the SMX logo, remove the backsplash from behind the inventory toolbelt, remove the numbers from under the toolbelt and remove the backsplash from behind the compass hud element to increase immersion while playing. No assets have been reused.\n\nIn any showcases for all my other modlets (outside of this one), I will continue to use SMX without this modlet to show the most love to the mod author, as he deserves it!\n\n## SHOUTOUTS\n\nI want to finally give a shout out to Qend for providing me with the idea of removing the backsplash behind the toolbelt and then guiding me to the right files to append.\n\nI want to then also thank Alloc and Sphereii for helping with fixing some of the code to make all these changes happen and become available to all players who enjoy using Sirillion’s SMX series.\n\nAs always, without Guppy’s Unofficial Discord for 7 Days to Die’s modding community, I wouldn’t be the modder I am today. Thank you guys!\n\n## OPTIONAL TARGET HEALTH BAR ADD-ON’S\n\nIf you’ve decided to use a health bar modlet like Sirillion’s Target Health Bar, you can find all six of my publicly released renaming modlets [here](https://7daystodiemods.com/ztensitys-creature-renaming-mod-series/).\n\n**[Download](https://drive.google.com/u/0/uc?id=176cUCdoLT2a9CVyKqiBuX7fAW2w_x3_P&export=download)**  \nAlso available on the mod launcher!\n\n**Credits:** [Ztensity](https://7daystodiemods.com/tag/ztensity/), Sirillion",
  "modDownloadURLs": [
    {
      "Info": "SMX Logo Removal (Requires SMXhud & SMXMenu)Download Compass Backsplash Removal (Requires Only SMXhud)Download Toolbelt Backsplash Removal (Requires Only SMXhud)Download Toolbelt Numbers Removal (Requires Only SMXhud)Download Hud Time Counter Removal – Darkness Falls Compatibility Immersion IncreaseDownload LBRB Pop-Up Removal (Requires Only SMXhud)Download SMX Gamepad Callouts Removal (Requires Only SMXhud)Download",
      "URL": "https://drive.google.com/u/0/uc?id=176cUCdoLT2a9CVyKqiBuX7fAW2w_x3_P&export=download",
      "Version": "v19"
    },
    {
      "Info": "Also available on the mod launcher!",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modAuthors": [
    "Ztensity",
    "Sirillion"
  ],
  "modTags": [
    "7 days to die hud mod",
    "7 days to die menu",
    "Ztensity"
  ]
}