{
  "modURL": "https://7daystodiemods.com/telrics-story-time/",
  "modCreatedTime": "2020-01-28T10:15:00+00:00",
  "modLastUpdatedTime": "2021-03-01T04:06:00+00:00",
  "modName": "Telric's Story Time",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/01/7-days-to-die-telrics-story-time-additional-screenshot.jpg"
  ],
  "modShortDescription": "Welcome to Telric's Story Time. Here you can find different 7DTD mods that offer new POIs with full stories and secrets within as well as new challenges.",
  "modDescription": "Welcome to Telric’s Story Time, a place for Telric to tell stories… in due time. Here you can find different 7DTD mods that offer new POIs with full stories and secrets within as well as new challenges. Telric will add these over time as he complete them. Since these are story mode style POIs, he will refrain from adding too many pictures and such, that could spoil any story or event within.\n\nThese POIs are not day 1 POIs and will require ammo and other items in order to complete. Since these are modlets, it will make use of vanilla systems, so some things might seem a bit weird (like using a stone axe to upgrade a door using a key), but use some imagination.\n\nThese are modlets. Simply putting them into your Mods folder will be enough for them to work. You will need a whole new RWG world in order for these to spawn naturally. If you don’t get a new RWG world, you’ll have to manually place the prefab yourself.\n\nTo get these POIs to work efficiently, he had to set them to be a trader, so your starter [quest](https://7daystodiemods.com/tag/7-days-to-die-quests/) may pin this as the closest trader.\n\n## Magisters Mansion\n\nThis mod adds a mansion belonging to the great Giovani. Over time, it has become a haunted place. Rendezvous with Siera Nightstalker at the [mansions](https://7daystodiemods.com/tag/7-days-to-die-prefab/) entrance, follow and assist her, and find out just what happened to this place for it to become haunted.\n\nEven though this may be done during the day, Telric highly recommend doing it at night, as that is how the atmosphere of the mansion was developed. Some things might look strange during the day.\n\n## Spy Party\n\nGo crash the party and save the day for everyone in this spy hunting POI. A spy has infiltrated a nice party and has plans to kill everyone there! It’s up to you to look for clues as to what this spy might look like and poison them so they don’t set the bomb off. Be careful though. If you poison an innocent party goer, the spy will notice and trigger the bomb, killing you. So have a good eye and mind about you when looking for clues!\n\n**Changelog**\n\n* Telric just released a new POI called Spy Party. This adds a Spy Party type minigame. Hunt for clues to find which zombie is the spy. Be careful not to poison an innocent party goer or the spy will trigger a bomb and kill you! Try it out and let me know how you like it! (This is a modlet, just drag and drop. It will require a new RWG to spawn when generating a world.)\n* He has also updated the mansion so it doesnt spawn an absolute ton of mansions when making a new world. It was spawning upwards of 70 magister mansion pois before.\n\n**[Download](https://www.dropbox.com/s/ptotkw2fv6qekhh/TelricsMagistersMansion.zip?dl=1)** Magisters Mansion  \n**[Download](https://www.dropbox.com/s/02p25h3m65les5f/TelricsSpyParty.zip?dl=1)** Spy Party\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/17120-telrics-story-time/).\n\n**Credits:** [Telric](https://7daystodiemods.com/tag/telric/)",
  "modDownloadURLs": [
    {
      "Info": "Magisters Mansion",
      "URL": "https://www.dropbox.com/s/ptotkw2fv6qekhh/TelricsMagistersMansion.zip?dl=1",
      "Version": "v19"
    },
    {
      "Info": "Spy Party",
      "URL": "https://www.dropbox.com/s/02p25h3m65les5f/TelricsSpyParty.zip?dl=1",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/17120-telrics-story-time/",
  "modAuthors": [
    "Telric"
  ],
  "modTags": [
    "7 days to die prefab",
    "7 days to die quests",
    "Telric"
  ]
}