{
  "modURL": "https://7daystodiemods.com/ztensitys-unnecessarily-beautiful-but-immersive-ubbi/",
  "modCreatedTime": "2021-03-01T20:17:00+00:00",
  "modLastUpdatedTime": "2021-03-01T20:21:02+00:00",
  "modName": "Ztensity's Unnecessarily Beautiful But Immersive (UBBI)",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-4.jpg"
  ],
  "modShortDescription": "Designed for 7 Days to Die's 19.3b6 build, Unnecessarily Beautiful But Immersive is a new edition of Hernan's Unnecessary But Beautiful mod.",
  "modDescription": "Designed for 7 Days to Die’s 19.3b6 build, Unnecessarily Beautiful But Immersive is a new edition of Hernan’s Unnecessary But Beautiful mod that was originally released on December 19th, 2019.\n\nOriginally wanting to add a Barista and a large TV, Hernan spent months designing code, textures, maps, 3D models and later compiling the files together to present a multitude of house buildables. Ranging from a variety of TVs, lamps, Kitchen appliances, cabinets and decorations to pool furniture, Bathroom amenities and beyond, he released Unnecessary But Beautiful. With the help of modder Hellsmoke a couple months later, recipes were created, which allowed players to finally craft these items for themselves in February of 2020.\n\nJump ten months later and I found myself inspired to take on my first major project with one goal in mind: increase immersion and make a somewhat fresher experience for players at the same time. With the permission of Hernan himself in early December, I’ve been working hard since for the last four weeks to rebuild this mod for compatibility with the latest build of the game.\n\nNow, I would like to present my rebuild titled, Unnecessarily Beautiful But Immersive!\n\n## WHAT DOES THIS DO & WHAT DOES THIS ADD?\n\nAfter playing the game for hours with this mod, I found ways in which I could increase immersion. With this in mind, Unnecessarily Beautiful But Immersive now includes a variety of new things.\n\nWe’ll first start with what’s familiar and that is Hellsmoke’s recipes. I’ve now updated the recipes file for full compatibility with the latest build of the game. I have also streamlined it into the mod, as it is no longer optional. This means players will no longer have go into their game files to fix this and there is no separate download.\n\nIn order to turn on the [lights](https://7daystodiemods.com/tag/7-days-to-die-lights/), TVs, PC, laptop, fireplace and sound bar, players must now make use of the wire tool.\n\nIn order to craft any of the lights, a player must first have their Intellect perk at lvl 6 and their Advanced Engineering perk at lvl 3.\n\nAlternatively, players can unlock lights early before hitting the appropriate perks if they are lucky enough to find the “basics of electricity schematic.”\n\nAll three beds that are craftable can be used as a bedroll by the player.\n\nEvery item from sofa pieces, TVs, laptops and cabinets to [doors](https://7daystodiemods.com/tag/7-days-to-die-doors/), windows, lamps and beyond all have appropriate names now along with some smoother descriptions as well for their crafting recipes.\n\nThe sound bar now has a sound to it also. Connect it with your wire tool and find out for yourself what it does! Just make sure to turn it off before leaving your game, otherwise it’ll go off when you boot up next!\n\nMost devices that uses a wire tool like a light, TV, speaker, etc. that is vanilla or through a mod will now say “turn on” / “turn off.”\n\nI have of course also added new files, coding, animations etc. that make all of the immersion a reality.\n\nIn short, I have rebuilt an assortment of items such as lights, TVs, a PC, a laptop, a fireplace and a [sound](https://7daystodiemods.com/tag/7-days-to-die-sound-mod/) bar. I have made sure that they have to be turned on by using the wire tool and their animations are cleaned. Similarly to vanilla, lights added by this mod can now only be crafted once you’ve attained the appropriate perks.\n\nIs this mod somewhat unnecessary? Potentially likely, just as Hernan originally stated when he first released his original version. However, is it Beautiful? If I have to ask myself, I’d say everything he created was absolutely aesthetic and now with with weeks of my hard work, there is so much more increased immersion!\n\n## WHAT’S THE SAME?\n\nThis mod still contains 235 items that were originally carefully crafted by Hernan. Almost everything you loved about the previous version of the mod still remain.\n\nHowever, in my efforts to increase immersion, I did tweak a lot of code, removed a lot of behind the scenes things and removed a few items such as a couple offset items, the “RG Gamer” items, the experimental floor speaker and a ceiling light top item due it not working with it’s light it was intended to extend.\n\nAll of these familiar and unnecessarily beautiful things that somehow worked in the zombie apocalypse before, but are more immersive then ever, now work with the latest build of the game seamlessly. Who knew you could have such nice things while trying to survive every 7 days!\n\n## UPDATING OLD VERSION / CLIENT VS. SERVER SIDE ONLY?\n\nThis modlet is a completely new rebuild and will require you to completely remove the “UnnecessarybutBeautiful” folder in your “Mods” folder. Then put this modlet into your “Mods” folder. You should be able to drop this into your pre-existing game (even if you had the Hernan’s version), although a new game is preferred. You will just have to likely rebuild some things you had already crafted. To avoid issues, I would recommend removing the items in your base provided by Hernan’s original modlet first, then placing this into your “Mods” folder.\n\nIf you have never had Hernan’s original Unnecessary But Beautiful mod, you will have no problems adding this mod into your pre-existing game. Just download and drop it into your “Mods” folder and you should be good to go! Most updates also will not require new games. If an update should require a new game, I will make sure to include that in the update notes!\n\nFinally, this modlet can be utilized in multiplayer. However, in order to achieve this, the mod is required to be installed on both the server side and the client side since the mod utilizes more file types than xml and Localization. This means that if you intend to play online with a friend or multiple people, each person absolutely has to have this mod installed in their “Mods” folder.\n\n## COMPATIBILITY?\n\nAs for compatibility issues, there really should not be any compatibility concerns to my knowledge at this point when utilizing the mod with most modlets, as I’ve tested with 30 other mods.\n\nThat said, there may be complications with some untested overhaul mods. Mods like UBBI don’t always work with overhauls like these and I cannot guarantee the success. I can say that if you download the overhaul first, make sure all the mods are up to date and then try to insert this mod into the “Mods” folder later, alongside starting a new save, that it should raise the chances of success.\n\nContinue reading for compatibility information for specifically tested overhauls with UBBI. Below I explain which overhauls are compatible and if standalone versions of UBBI are required for complete compatibility.\n\n### OVERHAUL COMPATIBILITY?\n\nAs of now, I can confirm that UBBI is fully compatible with Darkness Falls, War3zuk Alpha 19 AIO Overhaul and Ravenhearst 7.2\\. I can also confirm that Gnamod and War of the Walkers are also both compatible, but with alternative versions of UBBI, which can both be found below and on the 7D2D mod launcher!\n\nTo learn how to install the 7 Days to Die mod launcher, install an overhaul and then learn how to put UBBI into one of these overhauls, you can now learn by viewing my tutorial [here](https://community.7daystodie.com/topic/23208-7d2d-mod-launcher-guide-overhaul-instructions-unnecessarily-beautiful-but-immersive-127-install/).\n\nIn short, you must first install the mod launcher, install a game copy for one of the overhauls, pre-sync the mods for the overhaul of your choice and then drop UBBI into the “mods” or “mod” folder inside the overhaul of your choice. View the tutorial for more information!\n\n**Note:** Darkness Falls has disabled the “basics of electricity” schematic, so you cannot unlock lights early. However his overhaul is intended to be a challenge!\n\n#### GNAMOD COMPATIBILITY?\n\nI found that Gnamod wasn’t compatible with UBBI out the gate, however I have designed an alternate version that is titled Unnecessarily Beautiful But Immersive – Gnamod Compatibility. This version has been designed for compatibility with Gnamod and should only be downloaded for use with the Gnamod overhaul. This alternate modlet was necessary because certain vanilla ingredients/resources were removed and select ingredients/recipes were added. Therefore, I have tweaked files that will work with Gnamod.\n\nNow, all my modlets are on the 7 Days to Die Mod launcher, including Unnecessarily Beautiful But Immersive – Gnamod Compatibility!\n\n[Download](https://drive.google.com/u/0/uc?id=15yvJnIGEl0bXA1eAQnfy7EwqcvEsXvGi&export=download) UBBI for Gnamod Overhaul Compatibility (Standalone)\n\n#### WAR OF THE WALKERS COMPATIBILITY?\n\nI found that while War of the Walkers appeared to be compatible with UBBI at first, there was a lot of work needed to be done. Therefore, I have designed an alternate version of UBBI that is specifically and only for Dwallorde’s mod overhaul titled War of the Walkers, or WotW for short. If you are using this modlet without WotW, you should immediately delete it and get the standard version of UBBI.\n\nIn the WotW compatibility version of UBBI, quite a lot of things changed behind the scenes. From adjusting the perk requirements to work with an entirely different progression system and utilizing three different workbenches for crafting the recipes to Localization tweaks, added resource requirements for crafting select recipes and more, this is truly a fresh and new experience for those who enjoy UBBI.\n\n[Download](https://drive.google.com/u/0/uc?id=1YbQ656RxxWfMGrINeHHa2iqr3VpL0YgF&export=download) UBBI for War of the Walkers Overhaul Compatibility (Standalone)\n\n## HOW TO’S\n\nTo provide a little assistance, I thought that it would be helpful to provide a few tips that may help with using this mod in your playthroughs. See below!\n\n* How to Search For Recipes to Craft: In order to craft, you must be at the workbench. Once at a workbench, you can easily find each type of recipe you want to craft by searching for their name like “Kitchen,” “Bedroom,” “Bathroom” or simply “HN.” Despite the name changes I have provided, it is still possible to search by “HN” and it is actually the easiest way to find the recipes.\n* How to Turn On Lights, TVs, PC & Sound Bar: After placing an item like a “Floor Lamp,” you must have a wire tool in hand. Next, you must activate the wire tool’s rope on the lamp by pressing e, disconnect by pressing e and then viola, you should now be able to turn your item on/off.\n* How to Unlock Lights: Just like vanilla gameplay, in order to unlock the ability to craft lights added by this mod, you must first attain the perks Intellect lvl 6 and Advanced Engineering lvl 3.\n\nIf you want more information, refer to the Read Me in the modlet, which will provide a little more details. Also refer to additional videos, which will preview the features shared [via YouTube](https://www.youtube.com/channel/UCEp9RXCi5fyLowfKIBXdI9A), which you can find on the videos tab!\n\n## LOCALIZATION FYI\n\nA localization has been put in for “useSwitchLightOff” and “useSwitchLightOn” to make all lights, TVs, fireplace, sound bar and computers turn “on / off” immersively. This will also affect vanilla lights as well or anything else using the “switch class.”\n\nFor the time being, anything using a wire tool will say “turn off” / “turn on.” This means this mod will likely affect other mods that utilize the “switch class” that are higher in the list in the “Mods” folder.\n\nIf you are making a modlet and you don’t want your object to read “turn on/off” and you want it to have the vanilla wording, try making it load after this modlet utilizing a ZZ as the first two characters of name.\n\n## CHANGELOG\n\n### UPDATE 2.0.0!\n\n#### MATERIALS MASTER LIST\n\n* Mair\n* Mwater\n* MbarbedFence\n* MbarbedWire\n* MtrapSpikesWood\n* MtrapSpikesIron\n* MDynamite\n* MLandMine\n* MFuelBarrelMetal\n* MFuelBarrelPolymer\n* Morganic\n* Mdirt\n* MforestGround\n* Mfarmland\n* MfertilizedFarmland\n* MfertilizedClayPlanter\n* Mplants\n* Mleaves\n* Mmushrooms\n* Mcactus\n* Mcorn\n* Mtallgrass\n* Mbridge\\_asphalt\n* Mbridge\\_metal\n* Mbridge\\_concrete\n* Mbridge\\_wood\n* Mgravel\n* Mrubble\n* Mstone\n* MstoneFurniture\n* Mconcrete\n* MrConcrete\n* Mbedrock\n* MoreStone\n* MoreMetal\n* Mbrick\n* Mstone\\_scrap\n* Miron\\_scrap\n* Mbrass\\_scrap\n* Mlead\\_scrap\n* Mmetal\\_weak\n* Mmetal\\_chains\n* Mmetal\\_frame\n* Mmetal\\_rebar\n* Mmetal\\_thin\n* Mmetal\n* Mmetal\\_medium\n* Mmetal\\_hard\n* MmetalDrawbridge\n* MmetalGarageDoor3x2x2\n* MmetalGarageDoor5x3x1\n* MmetalCatwalk\n* Miron\n* Msteel\n* MstainlessSteel\n* MDesertGround\n* Msand\n* Msandstone\n* Mhay\n* Mpaper\n* Mtrash\n* Mleather\n* MleatherKnuckles\n* Mwood\n* Mwood\\_regular\n* Mwood\\_weak\n* Mwood\\_ladders\n* MwoodReinforced\n* MwoodMetal\n* MwoodCatwalk\n* MtreeWoodSmall\n* MtreeWoodMedium\n* MtreeWoodLarge\n* MtreeWoodFull\n* Mcloth\n* MclothStable\n* Mglass\n* MglassBulletproof\n* Msnow\n* Mweb\n* MCardboardLoot\n* Mfurniture\n* Mbrass\n* MdroppedBackpack\n* Mboulder\n* Mcobblestone\n* MmetalNoGlue\n* MstoneNoGlue\n* Mplastics\n* MelectricParts\n* MelectronicParts\n* MmechanicalParts\n* Mpaint\n* MMachineGunParts\n* MBowCrossbowParts\n* MRifleParts\n* MHandGunParts\n* MShotgunParts\n* MRocketLauncherParts\n* MmeleeWpnBatonParts\n* MmeleeWpnKnucklesParts\n* MmeleeWpnBladeParts\n* MmeleeWpnSpearParts\n* MmeleeWpnClubParts\n* MmeleeWpnSledgeParts\n* MmeleeToolSalvageParts\n* MmeleeToolAllSteel\n* MarmorMilitarySet\n* MarmorSteelSet\n* MMotorToolParts\n* MJunkTurretParts\n* MresourceRockSmall\n* MresourceSnowBall\n* MresourceAcid\n* MresourceYuccaFibers\n* MresourceWood\n* MresourceClayLump\n* MresourceCrushedSand\n* MresourceBrokenGlass\n* MresourceScrapIron\n* MresourceForgedIron\n* MresourceMetalPipe\n* MresourceForgedSteel\n* MresourceScrapPolymers\n* MresourceOilShale\n* MresourceBone\n* MresourceLeather\n* MfoodRawMeat\n* MresourceAnimalFat\n* MresourceTestosteroneExtract\n* MresourceCrop\n* MresourceScrapBrassSmall\n* MresourceScrapBrassMedium\n* MresourceScrapBrassLarge\n* MresourceScrapLeadSmall\n* MresourceScrapLeadMedium\n* MresourceScrapLeadLarge\n* MresourceCobblestones\n* MresourceCement\n* MresourceConcreteMix\n* MresourceCloth\n* MmilitaryFiber\n* MresourcePaper\n* MresourceFertilizer\n* MresourceFeather\n* MresourceCoal\n* MresourceOil\n* MresourceSilverNugget\n* MsmallEngine\n* MoldCash\n* MtoolBeaker\n* MtoolBellows\n\n#### CRAFTING TAB NAMES\n\n* Basics\n* Building\n* Resources\n* Ammo/Weapons\n* Tools/Traps\n* Food / Cooking\n* Science\n* Clothing\n* Decor\n* Miscellaneous\n\nTo add the properties in a block, you would simply insert one line such as:\n\n```\n<property name=\"Group\" value=\"Science\"/>\n```\n\nor\n\n```\n<property name=\"Group\" value=\"Building,Basics\" />\n```\n\nThis is just an example.\n\nYou can also put:\n\n```\n<property name=\"Group\" value=\"Building,Basics,Science\"/>\n```\n\n#### BLOCK PROPERTIES CONVERSION IMMERSION CHEAT SHEET\n\n##### MWOOD\\_WEAK\n\n```\n<block name=\"weakWoodWithGlassExample\">\n\t<property name=\"Material\" value=\"Mwood_weak\" />\n\t<property name=\"MaxDamage\" value=\"235\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceWood\" value=\"10\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"1,5\" />\n\t<drop event=\"Destroy\" name=\"resourceBrokenGlass\" count=\"1,3\" />\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"3\" prob=\"0.20\" stick_chance=\"0\" />\n\t<drop event=\"Fall\" name=\"resourceBrokenGlass\" count=\"3\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\n```\n\n##### MWOOD\\_REGULAR\n\n```\n<block name=\"regularWoodExample\">\n\t<property name=\"Material\" value=\"Mwood_regular\" />\n\t<property name=\"MaxDamage\" value=\"200\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceWood\" value=\"10\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"1,5\" />\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"3\" prob=\"0.20\" stick_chance=\"0\" />\n</block>\n```\n\n##### MWOODREINFORCED\n\n```\n<block name=\"reinforcedWoodExample\">\n\t<property name=\"Material\" value=\"MwoodReinforced\" />\n\t<property name=\"MaxDamage\" value=\"250\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceWood\" value=\"10\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"1,5\" />\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"3\" prob=\"0.20\" stick_chance=\"0\" />\n</block>\n```\n\n##### MIRON\n\n```\n<block name=\"ironExample\">\n\t<property name=\"Material\" value=\"Miron\" />\n\t<property name=\"MaxDamage\" value=\"200\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceForgedIron\" value=\"5\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"6\" />\n\t<drop event=\"Fall\" name=\"resourceScrapIron\" count=\"3\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\n```\n\n##### MGLASS\n\n```\n<block name=\"glassExample\">\n\t<property name=\"Material\" value=\"Mglass\" />\n\t<property name=\"MaxDamage\" value=\"200\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"glassBlockVariantHelper\" value=\"3\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceBrokenGlass\" count=\"5\" />\n\t<drop event=\"Fall\" name=\"resourceBrokenGlass\" count=\"7\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\n```\n\n#### BLOCK PROPERTIES CONVERSION IMMERSION CHEAT SHEET FOR WRENCH TOOL LINE\n\n##### SINKS\n\n```\n<block name=\"sinkExample\">\n\t<property name=\"Material\" value=\"MwoodMetal\" />\n\t<property name=\"MaxDamage\" value=\"250\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceWood\" value=\"10\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"5\" />\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"2,4\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceMetalPipe\" count=\"1,3\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"3\" prob=\"0.20\" stick_chance=\"0\" />\n</block>\n```\n\n##### LIGHTS\n\n```\n<block name=\"lightExample\">\n\t<property name=\"Material\" value=\"Miron\" />\n\t<property name=\"MaxDamage\" value=\"335\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceForgedIron\" value=\"5\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"6\" />\n\t<drop event=\"Destroy\" name=\"resourceHeadlight\" count=\"1,3\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceElectricParts\" count=\"1,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceScrapIron\" count=\"3\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\n```\n\n##### TVS (TVS W/WOOD)\n\n```\n<block name=\"tvSetExample\">\n\t<property name=\"Material\" value=\"MwoodMetal\" />\n\t<property name=\"MaxDamage\" value=\"300\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceWood\" value=\"10\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"2,6\" />\n\t<drop event=\"Destroy\" name=\"resourceElectricParts\" count=\"1,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"0,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"0,3\" prob=\"0.20\" stick_chance=\"0\"/>\n\t<drop event=\"Fall\" name=\"resourceScrapIron\" count=\"0,2\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\n```\n\n##### TVS (TVS W/METAL)\n\n```\n<block name=\"tvSetTwoExample\">\n\t<property name=\"Material\" value=\"Mmetal_thin\" />\n\t<property name=\"MaxDamage\" value=\"250\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceForgedIron\" value=\"5\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"2,6\" />\n\t<drop event=\"Destroy\" name=\"resourceElectricParts\" count=\"1,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"0,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceScrapIron\" count=\"0,2\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\n```\n\n##### SOUND BAR / PC / LAPTOP / FIREPLACE\n\n```\n<block name=\"techExample\">\n\t<property name=\"Material\" value=\"Mmetal_thin\" />\n\t<property name=\"MaxDamage\" value=\"150\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceForgedIron\" value=\"1\"/>\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"1,4\" />\n\t<drop event=\"Destroy\" name=\"resourceElectricParts\" count=\"1,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"0,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceScrapIron\" count=\"0,2\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\n```\n\n##### DOORS\n\n```\n<block name=\"doorExample\">\n\t<property name=\"Material\" value=\"MwoodMetal\" />\n\t<property name=\"MaxDamage\" value=\"1200\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceForgedIron\" value=\"10\" />\n\t</property>\n\t<property name=\"CustomUpgradeSound\" value=\"place_block_wood\" />\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"10\" />\n\t<drop event=\"Destroy\" name=\"resourceNail\" count=\"5,6\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceMechanicalParts\" count=\"0,1\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"5\" prob=\"0.75\" stick_chance=\"1\" />\n</block>\n```\n\n##### APPLIANCES (FRIDGE, STOVE, OVEN, TOASTER, COFFEE MAKER, MICROWAVE)\n\n```\n<block name=\"appliancesExample\">\n\t<property name=\"Material\" value=\"Miron\" />\n\t<property name=\"MaxDamage\" value=\"400\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceForgedIron\" value=\"5\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"0,4\" prob=\"1\"/>\n\t<drop event=\"Destroy\" name=\"resourceElectricParts\" count=\"2,5\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceMetalPipe\" count=\"1,3\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceSpring\" count=\"0,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceScrapIron\" count=\"3\" prob=\"0.20\" stick_chance=\"0\" />\n</block>\n```\n\n##### BEDROOM BLOCKS (DRAWERS & RACKS)\n\n```\n<block name=\"generalDrawerExample\">\n\t<property name=\"Material\" value=\"MwoodReinforced\" />\n\t<property name=\"MaxDamage\" value=\"225\"/> (250 bigger / 225 smaller)\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceWood\" value=\"10\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"1,5\" />\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"3\" prob=\"0.20\" stick_chance=\"0\" />\n</block>\n```\n\n##### SOFA BLOCKS\n\n```\n<block name=\"furnitureExample\">\n\t<property name=\"Material\" value=\"Mleather\" />\n\t<property name=\"MaxDamage\" value=\"125\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceLeather\" value=\"3\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceLeather\" count=\"1,4\" prob=\"1\"/>\n\t<drop event=\"Fall\" name=\"resourceNail\" count=\"5\" prob=\"0.20\" stick_chance=\"0\" />\n\t<drop event=\"Fall\" name=\"resourceLeather\" count=\"4\" prob=\"0.20\" stick_chance=\"0\" />\n</block>\n```\n\n## CREDITS\n\nMost assets including the UNITY3D Files for resources, PNGs for UIAtlases, block coding and 12 original localized files were are all created, designed and published first by Hernan (HN). With his permission, I have presented a newer edition/rebuild of the mod with new features, more in-depth immersion, better compatibility with the latest build and further accessibility across all websites.\n\nThe recipes file was originally designed and coded by modder Hellsmoke. Hernan uploaded this on 2/12/2020 as an optional download. I am now including this as part of the new edition of Unnecessary but Beautiful to not only keep it updated for all players, but also make the localization available for further immersion to make recipes feel like part of vanilla game.\n\nThe UI seen in any pictures or videos from my showcase is provided by Sirillion’s SMX mod pack found [here](https://7daystodiemods.com/tag/7-days-to-die-smx-mods/). His mod is a staple in my load order and only enhances the appearance of my mods further. Thank you Sirillion for your fantastic work!\n\n## SHOUTOUTS\n\nI want to finally give a huge shoutout to everyone who helped me get this huge project finished, including Xyth, Guppycur, Bdubyah, Ragsy, Mumpfy, Snufkin, TSBX, Zorro, Khaine, saminal, Artjom, sphereii, wrathmaniac, InnocuousChaos, chiko, Haidr’Gna and Beardman via Guppy’s Unofficial Discord for 7 Days to Die’s modding community. Full thank you’s are in my Read Me guys and I encourage you guys to check that out. I truly appreciate all your guys help!\n\n**[Download](https://drive.google.com/u/0/uc?id=1Mm6VUYuQP7tIgGUjIXJSEu5DD8pKncUr&export=download)** Unnecessarily Beautiful But Immersive v2.0.0  \n**[Download](https://drive.google.com/u/0/uc?id=1Hmod8gEHzj5O1ydZ3MS39Jxukf1asDhL&export=download)** UBBI SMX Patch\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/23102-ztensitys-unnecessarily-beautiful-but-immersive-ubbi/).\n\n**Credits:** [Ztensity](https://7daystodiemods.com/tag/ztensity/), Hernan, Hellsmoke",
  "modDownloadURLs": [
    {
      "Info": "\nDesigned for 7 Days to Die’s 19.3b6 build, Unnecessarily Beautiful But Immersive is a new edition of Hernan’s Unnecessary But Beautiful mod that was originally released on December 19th, 2019.\nOriginally wanting to add a Barista and a large TV, Hernan spent months designing code, textures, maps, 3D models and later compiling the files together to present a multitude of house buildables. Ranging from a variety of TVs, lamps, Kitchen appliances, cabinets and decorations to pool furniture, Bathroom amenities and beyond, he released Unnecessary But Beautiful. With the help of modder Hellsmoke a couple months later, recipes were created, which allowed players to finally craft these items for themselves in February of 2020.\nJump ten months later and I found myself inspired to take on my first major project with one goal in mind: increase immersion and make a somewhat fresher experience for players at the same time. With the permission of Hernan himself in early December, I’ve been working hard since for the last four weeks to rebuild this mod for compatibility with the latest build of the game.\nNow, I would like to present my rebuild titled, Unnecessarily Beautiful But Immersive!\n<img loading=\"lazy\" class=\"alignnone wp-image-10368 size-full\" src=\"https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-1.jpg\" alt=\"7 days to die ztensity's unnecessarily beautiful but immersive (ubbi) additional screenshot 1\" width=\"730\" height=\"411\" srcset=\"https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-1.jpg 730w, https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-1-300x169.jpg 300w\" sizes=\"(max-width: 730px) 100vw, 730px\"/>\nWHAT DOES THIS DO & WHAT DOES THIS ADD?\nAfter playing the game for hours with this mod, I found ways in which I could increase immersion. With this in mind, Unnecessarily Beautiful But Immersive now includes a variety of new things.\nWe’ll first start with what’s familiar and that is Hellsmoke’s recipes. I’ve now updated the recipes file for full compatibility with the latest build of the game. I have also streamlined it into the mod, as it is no longer optional. This means players will no longer have go into their game files to fix this and there is no separate download.\nIn order to turn on the lights, TVs, PC, laptop, fireplace and sound bar, players must now make use of the wire tool.\nIn order to craft any of the lights, a player must first have their Intellect perk at lvl 6 and their Advanced Engineering perk at lvl 3.\nAlternatively, players can unlock lights early before hitting the appropriate perks if they are lucky enough to find the “basics of electricity schematic.”\nAll three beds that are craftable can be used as a bedroll by the player.\nEvery item from sofa pieces, TVs, laptops and cabinets to doors, windows, lamps and beyond all have appropriate names now along with some smoother descriptions as well for their crafting recipes.The sound bar now has a sound to it also. Connect it with your wire tool and find out for yourself what it does! Just make sure to turn it off before leaving your game, otherwise it’ll go off when you boot up next!\nMost devices that uses a wire tool like a light, TV, speaker, etc. that is vanilla or through a mod will now say “turn on” / “turn off.”\nI have of course also added new files, coding, animations etc. that make all of the immersion a reality.\nIn short, I have rebuilt an assortment of items such as lights, TVs, a PC, a laptop, a fireplace and a sound bar. I have made sure that they have to be turned on by using the wire tool and their animations are cleaned. Similarly to vanilla, lights added by this mod can now only be crafted once you’ve attained the appropriate perks.\nIs this mod somewhat unnecessary? Potentially likely, just as Hernan originally stated when he first released his original version. However, is it Beautiful? If I have to ask myself, I’d say everything he created was absolutely aesthetic and now with with weeks of my hard work, there is so much more increased immersion!\n<img loading=\"lazy\" class=\"alignnone wp-image-10369 size-full\" src=\"https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-2.jpg\" alt=\"7 days to die ztensity's unnecessarily beautiful but immersive (ubbi) additional screenshot 2\" width=\"730\" height=\"411\" srcset=\"https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-2.jpg 730w, https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-2-300x169.jpg 300w\" sizes=\"(max-width: 730px) 100vw, 730px\"/>\nWHAT’S THE SAME?\nThis mod still contains 235 items that were originally carefully crafted by Hernan. Almost everything you loved about the previous version of the mod still remain.\nHowever, in my efforts to increase immersion, I did tweak a lot of code, removed a lot of behind the scenes things and removed a few items such as a couple offset items, the “RG Gamer” items, the experimental floor speaker and a ceiling light top item due it not working with it’s light it was intended to extend.\nAll of these familiar and unnecessarily beautiful things that somehow worked in the zombie apocalypse before, but are more immersive then ever, now work with the latest build of the game seamlessly. Who knew you could have such nice things while trying to survive every 7 days!\n<img loading=\"lazy\" class=\"alignnone wp-image-10370 size-full\" src=\"https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-3.jpg\" alt=\"7 days to die ztensity's unnecessarily beautiful but immersive (ubbi) additional screenshot 3\" width=\"730\" height=\"411\" srcset=\"https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-3.jpg 730w, https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-3-300x169.jpg 300w\" sizes=\"(max-width: 730px) 100vw, 730px\"/>\nUPDATING OLD VERSION / CLIENT VS. SERVER SIDE ONLY?\nThis modlet is a completely new rebuild and will require you to completely remove the “UnnecessarybutBeautiful” folder in your “Mods” folder. Then put this modlet into your “Mods” folder. You should be able to drop this into your pre-existing game (even if you had the Hernan’s version), although a new game is preferred. You will just have to likely rebuild some things you had already crafted. To avoid issues, I would recommend removing the items in your base provided by Hernan’s original modlet first, then placing this into your “Mods” folder.\nIf you have never had Hernan’s original Unnecessary But Beautiful mod, you will have no problems adding this mod into your pre-existing game. Just download and drop it into your “Mods” folder and you should be good to go! Most updates also will not require new games. If an update should require a new game, I will make sure to include that in the update notes!\nFinally, this modlet can be utilized in multiplayer. However, in order to achieve this, the mod is required to be installed on both the server side and the client side since the mod utilizes more file types than xml and Localization. This means that if you intend to play online with a friend or multiple people, each person absolutely has to have this mod installed in their “Mods” folder.\nCOMPATIBILITY?\nAs for compatibility issues, there really should not be any compatibility concerns to my knowledge at this point when utilizing the mod with most modlets, as I’ve tested with 30 other mods.\nThat said, there may be complications with some untested overhaul mods. Mods like UBBI don’t always work with overhauls like these and I cannot guarantee the success. I can say that if you download the overhaul first, make sure all the mods are up to date and then try to insert this mod into the “Mods” folder later, alongside starting a new save, that it should raise the chances of success.\nContinue reading for compatibility information for specifically tested overhauls with UBBI. Below I explain which overhauls are compatible and if standalone versions of UBBI are required for complete compatibility.OVERHAUL COMPATIBILITY?\nAs of now, I can confirm that UBBI is fully compatible with Darkness Falls, War3zuk Alpha 19 AIO Overhaul and Ravenhearst 7.2. I can also confirm that Gnamod and War of the Walkers are also both compatible, but with alternative versions of UBBI, which can both be found below and on the 7D2D mod launcher!\nTo learn how to install the 7 Days to Die mod launcher, install an overhaul and then learn how to put UBBI into one of these overhauls, you can now learn by viewing my tutorial here.\nIn short, you must first install the mod launcher, install a game copy for one of the overhauls, pre-sync the mods for the overhaul of your choice and then drop UBBI into the “mods” or “mod” folder inside the overhaul of your choice. View the tutorial for more information!\nNote: Darkness Falls has disabled the “basics of electricity” schematic, so you cannot unlock lights early. However his overhaul is intended to be a challenge!\nGNAMOD COMPATIBILITY?\nI found that Gnamod wasn’t compatible with UBBI out the gate, however I have designed an alternate version that is titled Unnecessarily Beautiful But Immersive – Gnamod Compatibility. This version has been designed for compatibility with Gnamod and should only be downloaded for use with the Gnamod overhaul. This alternate modlet was necessary because certain vanilla ingredients/resources were removed and select ingredients/recipes were added. Therefore, I have tweaked files that will work with Gnamod.\nNow, all my modlets are on the 7 Days to Die Mod launcher, including Unnecessarily Beautiful But Immersive – Gnamod Compatibility!\nUBBI for Gnamod Overhaul Compatibility (Standalone)\nWAR OF THE WALKERS COMPATIBILITY?\nI found that while War of the Walkers appeared to be compatible with UBBI at first, there was a lot of work needed to be done. Therefore, I have designed an alternate version of UBBI that is specifically and only for Dwallorde’s mod overhaul titled War of the Walkers, or WotW for short. If you are using this modlet without WotW, you should immediately delete it and get the standard version of UBBI.\nIn the WotW compatibility version of UBBI, quite a lot of things changed behind the scenes. From adjusting the perk requirements to work with an entirely different progression system and utilizing three different workbenches for crafting the recipes to Localization tweaks, added resource requirements for crafting select recipes and more, this is truly a fresh and new experience for those who enjoy UBBI.\nDownload UBBI for War of the Walkers Overhaul Compatibility (Standalone)\nHOW TO’S\nTo provide a little assistance, I thought that it would be helpful to provide a few tips that may help with using this mod in your playthroughs. See below!\nHow to Search For Recipes to Craft: In order to craft, you must be at the workbench. Once at a workbench, you can easily find each type of recipe you want to craft by searching for their name like “Kitchen,” “Bedroom,” “Bathroom” or simply “HN.” Despite the name changes I have provided, it is still possible to search by “HN” and it is actually the easiest way to find the recipes.How to Turn On Lights, TVs, PC & Sound Bar: After placing an item like a “Floor Lamp,” you must have a wire tool in hand. Next, you must activate the wire tool’s rope on the lamp by pressing e, disconnect by pressing e and then viola, you should now be able to turn your item on/off.How to Unlock Lights: Just like vanilla gameplay, in order to unlock the ability to craft lights added by this mod, you must first attain the perks Intellect lvl 6 and Advanced Engineering lvl 3.\nIf you want more information, refer to the Read Me in the modlet, which will provide a little more details. Also refer to additional videos, which will preview the features shared via YouTube, which you can find on the videos tab!\nLOCALIZATION FYI\nA localization has been put in for “useSwitchLightOff” and “useSwitchLightOn” to make all lights, TVs, fireplace, sound bar and computers turn “on / off” immersively. This will also affect vanilla lights as well or anything else using the “switch class.”\nFor the time being, anything using a wire tool will say “turn off” / “turn on.” This means this mod will likely affect other mods that utilize the “switch class” that are higher in the list in the “Mods” folder.\nIf you are making a modlet and you don’t want your object to read “turn on/off” and you want it to have the vanilla wording, try making it load after this modlet utilizing a ZZ as the first two characters of name.\n<img loading=\"lazy\" class=\"alignnone wp-image-10371 size-full\" src=\"https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-4.jpg\" alt=\"7 days to die ztensity's unnecessarily beautiful but immersive (ubbi) additional screenshot 4\" width=\"730\" height=\"411\" srcset=\"https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-4.jpg 730w, https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-4-300x169.jpg 300w\" sizes=\"(max-width: 730px) 100vw, 730px\"/>CHANGELOG\nUPDATE 2.0.0!\nMATERIALS MASTER LIST\nMairMwaterMbarbedFenceMbarbedWireMtrapSpikesWoodMtrapSpikesIronMDynamiteMLandMineMFuelBarrelMetalMFuelBarrelPolymerMorganicMdirtMforestGroundMfarmlandMfertilizedFarmlandMfertilizedClayPlanterMplantsMleavesMmushroomsMcactusMcornMtallgrassMbridge_asphaltMbridge_metalMbridge_concreteMbridge_woodMgravelMrubbleMstoneMstoneFurnitureMconcreteMrConcreteMbedrockMoreStoneMoreMetalMbrickMstone_scrapMiron_scrapMbrass_scrapMlead_scrapMmetal_weakMmetal_chainsMmetal_frameMmetal_rebarMmetal_thinMmetalMmetal_mediumMmetal_hardMmetalDrawbridgeMmetalGarageDoor3x2x2MmetalGarageDoor5x3x1MmetalCatwalkMironMsteelMstainlessSteelMDesertGroundMsandMsandstoneMhayMpaperMtrashMleatherMleatherKnucklesMwoodMwood_regularMwood_weakMwood_laddersMwoodReinforcedMwoodMetalMwoodCatwalkMtreeWoodSmallMtreeWoodMediumMtreeWoodLargeMtreeWoodFullMclothMclothStableMglassMglassBulletproofMsnowMwebMCardboardLootMfurnitureMbrassMdroppedBackpackMboulderMcobblestoneMmetalNoGlueMstoneNoGlueMplasticsMelectricPartsMelectronicPartsMmechanicalPartsMpaintMMachineGunPartsMBowCrossbowPartsMRiflePartsMHandGunPartsMShotgunPartsMRocketLauncherPartsMmeleeWpnBatonPartsMmeleeWpnKnucklesPartsMmeleeWpnBladePartsMmeleeWpnSpearPartsMmeleeWpnClubPartsMmeleeWpnSledgePartsMmeleeToolSalvagePartsMmeleeToolAllSteelMarmorMilitarySetMarmorSteelSetMMotorToolPartsMJunkTurretPartsMresourceRockSmallMresourceSnowBallMresourceAcidMresourceYuccaFibersMresourceWoodMresourceClayLumpMresourceCrushedSandMresourceBrokenGlassMresourceScrapIronMresourceForgedIronMresourceMetalPipeMresourceForgedSteelMresourceScrapPolymersMresourceOilShaleMresourceBoneMresourceLeatherMfoodRawMeatMresourceAnimalFatMresourceTestosteroneExtractMresourceCropMresourceScrapBrassSmallMresourceScrapBrassMediumMresourceScrapBrassLargeMresourceScrapLeadSmallMresourceScrapLeadMediumMresourceScrapLeadLargeMresourceCobblestonesMresourceCementMresourceConcreteMixMresourceClothMmilitaryFiberMresourcePaperMresourceFertilizerMresourceFeatherMresourceCoalMresourceOilMresourceSilverNuggetMsmallEngineMoldCashMtoolBeakerMtoolBellows\nCRAFTING TAB NAMES\nBasicsBuildingResourcesAmmo/WeaponsTools/TrapsFood / CookingScienceClothingDecorMiscellaneous\nTo add the properties in a block, you would simply insert one line such as:\n<property name=\"Group\" value=\"Science\"/>\nor\n<property name=\"Group\" value=\"Building,Basics\" />\nThis is just an example.\nYou can also put:\n<property name=\"Group\" value=\"Building,Basics,Science\"/>\nBLOCK PROPERTIES CONVERSION IMMERSION CHEAT SHEET\nMWOOD_WEAK\n<block name=\"weakWoodWithGlassExample\">\n\t<property name=\"Material\" value=\"Mwood_weak\" />\n\t<property name=\"MaxDamage\" value=\"235\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceWood\" value=\"10\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"1,5\" />\n\t<drop event=\"Destroy\" name=\"resourceBrokenGlass\" count=\"1,3\" />\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"3\" prob=\"0.20\" stick_chance=\"0\" />\n\t<drop event=\"Fall\" name=\"resourceBrokenGlass\" count=\"3\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\nMWOOD_REGULAR\n<block name=\"regularWoodExample\">\n\t<property name=\"Material\" value=\"Mwood_regular\" />\n\t<property name=\"MaxDamage\" value=\"200\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceWood\" value=\"10\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"1,5\" />\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"3\" prob=\"0.20\" stick_chance=\"0\" />\n</block>\nMWOODREINFORCED\n<block name=\"reinforcedWoodExample\">\n\t<property name=\"Material\" value=\"MwoodReinforced\" />\n\t<property name=\"MaxDamage\" value=\"250\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceWood\" value=\"10\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"1,5\" />\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"3\" prob=\"0.20\" stick_chance=\"0\" />\n</block>\nMIRON\n<block name=\"ironExample\">\n\t<property name=\"Material\" value=\"Miron\" />\n\t<property name=\"MaxDamage\" value=\"200\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceForgedIron\" value=\"5\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"6\" />\n\t<drop event=\"Fall\" name=\"resourceScrapIron\" count=\"3\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\nMGLASS\n<block name=\"glassExample\">\n\t<property name=\"Material\" value=\"Mglass\" />\n\t<property name=\"MaxDamage\" value=\"200\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"glassBlockVariantHelper\" value=\"3\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceBrokenGlass\" count=\"5\" />\n\t<drop event=\"Fall\" name=\"resourceBrokenGlass\" count=\"7\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\nBLOCK PROPERTIES CONVERSION IMMERSION CHEAT SHEET FOR WRENCH TOOL LINE\nSINKS\n<block name=\"sinkExample\">\n\t<property name=\"Material\" value=\"MwoodMetal\" />\n\t<property name=\"MaxDamage\" value=\"250\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceWood\" value=\"10\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"5\" />\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"2,4\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceMetalPipe\" count=\"1,3\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"3\" prob=\"0.20\" stick_chance=\"0\" />\n</block>\nLIGHTS\n<block name=\"lightExample\">\n\t<property name=\"Material\" value=\"Miron\" />\n\t<property name=\"MaxDamage\" value=\"335\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceForgedIron\" value=\"5\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"6\" />\n\t<drop event=\"Destroy\" name=\"resourceHeadlight\" count=\"1,3\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceElectricParts\" count=\"1,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceScrapIron\" count=\"3\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\nTVS (TVS W/WOOD)\n<block name=\"tvSetExample\">\n\t<property name=\"Material\" value=\"MwoodMetal\" />\n\t<property name=\"MaxDamage\" value=\"300\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceWood\" value=\"10\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"2,6\" />\n\t<drop event=\"Destroy\" name=\"resourceElectricParts\" count=\"1,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"0,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"0,3\" prob=\"0.20\" stick_chance=\"0\"/>\n\t<drop event=\"Fall\" name=\"resourceScrapIron\" count=\"0,2\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\nTVS (TVS W/METAL)\n<block name=\"tvSetTwoExample\">\n\t<property name=\"Material\" value=\"Mmetal_thin\" />\n\t<property name=\"MaxDamage\" value=\"250\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceForgedIron\" value=\"5\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"2,6\" />\n\t<drop event=\"Destroy\" name=\"resourceElectricParts\" count=\"1,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"0,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceScrapIron\" count=\"0,2\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\nSOUND BAR / PC / LAPTOP / FIREPLACE\n<block name=\"techExample\">\n\t<property name=\"Material\" value=\"Mmetal_thin\" />\n\t<property name=\"MaxDamage\" value=\"150\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceForgedIron\" value=\"1\"/>\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"1,4\" />\n\t<drop event=\"Destroy\" name=\"resourceElectricParts\" count=\"1,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"0,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceScrapIron\" count=\"0,2\" prob=\"0.20\" stick_chance=\"0\"/>\n</block>\nDOORS\n<block name=\"doorExample\">\n\t<property name=\"Material\" value=\"MwoodMetal\" />\n\t<property name=\"MaxDamage\" value=\"1200\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceForgedIron\" value=\"10\" />\n\t</property>\n\t<property name=\"CustomUpgradeSound\" value=\"place_block_wood\" />\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"10\" />\n\t<drop event=\"Destroy\" name=\"resourceNail\" count=\"5,6\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceMechanicalParts\" count=\"0,1\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"5\" prob=\"0.75\" stick_chance=\"1\" />\n</block>\nAPPLIANCES (FRIDGE, STOVE, OVEN, TOASTER, COFFEE MAKER, MICROWAVE)\n<block name=\"appliancesExample\">\n\t<property name=\"Material\" value=\"Miron\" />\n\t<property name=\"MaxDamage\" value=\"400\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceForgedIron\" value=\"5\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceScrapIron\" count=\"0,4\" prob=\"1\"/>\n\t<drop event=\"Destroy\" name=\"resourceElectricParts\" count=\"2,5\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceMetalPipe\" count=\"1,3\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Destroy\" name=\"resourceSpring\" count=\"0,2\" tag=\"salvageHarvest\" tool_category=\"Disassemble\"/>\n\t<drop event=\"Fall\" name=\"resourceScrapIron\" count=\"3\" prob=\"0.20\" stick_chance=\"0\" />\n</block>\nBEDROOM BLOCKS (DRAWERS & RACKS)\n<block name=\"generalDrawerExample\">\n\t<property name=\"Material\" value=\"MwoodReinforced\" />\n\t<property name=\"MaxDamage\" value=\"225\"/> (250 bigger / 225 smaller)\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceWood\" value=\"10\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceWood\" count=\"1,5\" />\n\t<drop event=\"Fall\" name=\"resourceWood\" count=\"3\" prob=\"0.20\" stick_chance=\"0\" />\n</block>\nSOFA BLOCKS\n<block name=\"furnitureExample\">\n\t<property name=\"Material\" value=\"Mleather\" />\n\t<property name=\"MaxDamage\" value=\"125\"/>\n\t<property class=\"RepairItems\">\n\t\t<property name=\"resourceLeather\" value=\"3\" />\n\t</property>\n\t<drop event=\"Destroy\" name=\"resourceLeather\" count=\"1,4\" prob=\"1\"/>\n\t<drop event=\"Fall\" name=\"resourceNail\" count=\"5\" prob=\"0.20\" stick_chance=\"0\" />\n\t<drop event=\"Fall\" name=\"resourceLeather\" count=\"4\" prob=\"0.20\" stick_chance=\"0\" />\n</block>\nCREDITS\nMost assets including the UNITY3D Files for resources, PNGs for UIAtlases, block coding and 12 original localized files were are all created, designed and published first by Hernan (HN). With his permission, I have presented a newer edition/rebuild of the mod with new features, more in-depth immersion, better compatibility with the latest build and further accessibility across all websites.\nThe recipes file was originally designed and coded by modder Hellsmoke. Hernan uploaded this on 2/12/2020 as an optional download. I am now including this as part of the new edition of Unnecessary but Beautiful to not only keep it updated for all players, but also make the localization available for further immersion to make recipes feel like part of vanilla game.\nThe UI seen in any pictures or videos from my showcase is provided by Sirillion’s SMX mod pack found here. His mod is a staple in my load order and only enhances the appearance of my mods further. Thank you Sirillion for your fantastic work!\nSHOUTOUTS\nI want to finally give a huge shoutout to everyone who helped me get this huge project finished, including Xyth, Guppycur, Bdubyah, Ragsy, Mumpfy, Snufkin, TSBX, Zorro, Khaine, saminal, Artjom, sphereii, wrathmaniac, InnocuousChaos, chiko, Haidr’Gna and Beardman via Guppy’s Unofficial Discord for 7 Days to Die’s modding community. Full thank you’s are in my Read Me guys and I encourage you guys to check that out. I truly appreciate all your guys help!\nDownload Unnecessarily Beautiful But Immersive v2.0.0",
      "Version": "v19"
    },
    {
      "Info": "UBBI SMX Patch\nThe forum topic of the mod is here.\nCredits: Ztensity, Hernan, Hellsmoke\nShare this mod with your friends:Download Unnecessarily Beautiful But Immersive v2.0.0",
      "URL": "https://drive.google.com/u/0/uc?id=1Hmod8gEHzj5O1ydZ3MS39Jxukf1asDhL&export=download",
      "Version": "v19"
    },
    {
      "Info": "UBBI SMX Patch",
      "URL": "https://drive.google.com/u/0/uc?id=1Hmod8gEHzj5O1ydZ3MS39Jxukf1asDhL&export=download",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/23102-ztensitys-unnecessarily-beautiful-but-immersive-ubbi/",
  "modAuthors": [
    "Ztensity",
    "Hernan",
    "Hellsmoke"
  ],
  "modTags": [
    "7 days to die doors",
    "7 days to die lights",
    "7 days to die sound mod",
    "7 days to die windows",
    "Ztensity"
  ]
}