{
  "modURL": "https://7daystodiemods.com/white-river-tools-of-citizenship/",
  "modCreatedTime": "2021-03-13T06:25:00+00:00",
  "modLastUpdatedTime": "2021-03-13T06:41:26+00:00",
  "modName": "White River - Tools of Citizenship",
  "modImages": [],
  "modShortDescription": "The White River settlements are looking for new citizens to contribute and are willing to give extra tools and equipment that they've collected.",
  "modDescription": "The White River settlements are looking for new citizens to contribute and are willing to give extra tools and equipment that they’ve collected. They are offering to provide to a select few survivors access to higher quality tools, weapons, armor, and equipment in exchange for volunteering to complete various tasks for the settlement. There is a limited supply and these items are only available to those who gain citizenry with White River settlements. In addition to the reward, the player is sometimes also offered a small stack of wet concrete blocks, from the last of the Trader’s community inventory to assist in re-establishing a homestead.\n\nThis modlet collection extends the new player White River citizenship [quest](https://7daystodiemods.com/tag/7-days-to-die-quests/) line to provide a handful of quests to obtain improved tools, weapons, and armor. Each item has a small back-story and explanation in an attempt to blend with the vanilla game and Trader. This gives new players a chance to obtain better equipment through a method other than randomness or traditional progression. The rewards this Modlet pack provides were carefully considered against Vanilla gameplay. In most cases, the named items only provide a small improvement over the items they were created from. Due to the multi-tier design of this modlet collection, it provides equipment for beginners all the way up through the elite.\n\nThis modlet pack is **XML XPath ONLY** and only needs to be installed on the server or player hosting the game! Other players do not need to install this modlet pack locally.\n\nThe modlet collection provides multi-tier quest lines, first requiring the player to craft a +Declaration of Citizenship. This allows them to begin a quest to volunteer to help lay to rest 10 old residents now turned zombie. This earns the player a +White River Citizenship Card which they can then use to select which quest they would like to pursue. The player’s citizenship card is returned to them after they complete the settlement’s quest. If it is lost for any reason, the player can craft a new +Declaration of Citizenship to start the process over of becoming a White River citizen. The +White River Citizenship Card can also be used to pursue two higher-level citizenship cards through killing of 100 Zombies or 1000 Zombies, respectively. These higher tiers of citizenship allows for the pursuit of Veteran and Elite level equipment.\n\n**Citizenship is offered in three-tiers:**\n\n* **Tier 1:** Kill 10 Zombies. This is the Basic level of citizenship. Reward: +White River Citizenship Card\n* **Tier 2:** Kill 100 Zombies. This is the Veteran level of citizenship. Reward: +White River Veteran Citizenship Card\n* **Tier 3:** Kill 1000 Zombies. This is the Elite level of citizenship. Reward: +White River Elite Citizenship Card\n\nOnce the player obtains their citizenship card, they can use this to craft quest-starter items for the equipment quests below. Some of the quests below offer a veteran version which rewards a sealed crate containing better quality, more items, and greater quantity of each multi-quantity item. Some offer an even higher level set of rewards for elite citizens. However, after a “Veteran” or “Elite” quest is complete, only a basic citizenship card is returned. The player must successfully complete the Tier 2 or 3 citizenship quest again in order to pursue another Veteran/Elite equipment quest.\n\n## Quest Listing\n\n### Vehicles\n\n* **Spirit of Vengeance** – Take on a demon Juggernaut and obtain a super-fast vehicle. A player using this vehicle is a sure-sign of their elite status. Big thanks to [Snufkin’s Server-Side Zombies](https://7daystodiemods.com/server-side-zombies/) & [Snufkins’s Server-Side Vehicles](https://7daystodiemods.com/server-side-vehicles/) for a big part of the base code for the vehicle and zombie. Tested for compatibility with Snufkin’s mods, so you can run both at the same time if you want!\n* **Amelia’s Gyrocopter** – Discover the truth of what happened to Amelia Earhart. Fight a Wendigo to reclaim her long-lost schematics explaining how to build a three-seater souped-up Gyrocopter. Guaranteed to get you and your friends across the map with speed and ease.\n\n### Tools\n\n* **Black Bart’s Flaming Dig Tools** – Uncover the long-buried stash from the most famous stagecoach robber in the western U.S., providing a steel Pickaxe & Shovel with flaming mods and better stats than Vanilla. Stamina trait sure to keep you digging and digging and digging.\n* **Bunyan’s FireAxe** – Help the Trader stock up on potable water in exchange for a Paul Bunyan-branded FireAxe.\n* **Dundee’s Hunting Knife** – Help the Trader collect bone shivs in exchange for Dundee’s famous Hunting Knife with slightly better stats than Vanilla.\n* **Jason’s Machete** – Obtain a replica of Jason’s famous machete in exchange for helping the settlement. Big thanks to Wyldwitchykat for this addition!\n* **Rick Danger’s Auger** – Obtain two higher tier Augers, the latter of which will turn even the largest mountain to butter, but will expend a LOT of gasoline and degrade your Auger quick.\n* **Taza’s Axe** – The famed Taza’s Axe, already awesome.\n\n### Weapons\n\n* **Bambi’s Killer Compound Bow** – Earn the famed deer killer, “Bambi’s Killer Compound Bow” or “Forest Prince Compound Bow” with slightly better stats than Vanilla.\n* **Bear Grylls’s Claws** \\-“Why fight bare fisted when you can fight bear fisted.” Thanks, SteamM0nkey for this idea.\n* **Callinicus’s Greek Fire** – Find the book randomly in the world and learn to craft greek fire arrows. Shoot one zombie with a greek fire arrow, and the fire spreads to other entities that it touches.\n* **Daryl’s Crossbow** – Obtain a replica copy of the same crossbow Daryl from the Walking Dead used: The Zombiekiller Crossbow.\n* **Deschain’s Revolver** – Collect the eight Dark Tower series books and craft nineteen doors to have one of Roland Deschain’s legendary revolvers bestowed upon you. Has custom bullets that are expensive to craft, but super powerful.\n* **Leon’s Modded SMG** – Help Leon finish his DIY gun project, resulting in a 9mm SMG weapon with slightly better stats than Vanilla.\n* **Pavlichenko’s Rifle** – Locate and assemble a branded Marksman rifle from the famed marksman, Pavlichenko.\n\n### Armor\n\n**Kuva’s Red Armor** – Discover the secret ingredient in Kuva’s Legendary Red Armor. This armor is rumored to be lightweight and stealthy, with resistances to heat & cold, and an extra mod slot per piece. The basic quest is EASY, but the Veteran quest is HARD.\n\n### Resources\n\n* **Brass For Lead** – Help the community restock its Lead supply and in exchange receive some brass.\n* **Everdeen’s Arrows & Bolts** – The settlement is trying to put together a feast. Help feed everyone in exchange for named arrows or bolts guaranteed to fly true.\n* **Gupta’s Bandages** – Can’t craft first aid bandages? Trade Aloe Leaves & Cotton for a few highly-sought-after Gupta’s First Aid Bandages & a First Aid Kit.\n* **QwikCrete** – Learn the secret to making quick-drying concrete blocks!\n* **Elite Random** – Obtain a sealed crate from four veteran cards that gives you a single random elite quest starter. Obtain a veteran card back at the start of your elite quest. If you complete the Elite quest, you obtain an Elite citizen’s card!\n* **Remington’s Steel Ammo** – A spin off of [Khaine’s Steel Ammo](https://7daystodiemods.com/steel-ammo/) mod that turns his mod into a questable achievement. Cheap-to-make bullets that degrade your weapons faster. Also, now with an auto turret that takes steel 762 rounds.\n* **Molino Bulletproof Glass** – Exchange regular bulletproof glass blocks with the Trader and they will teach you how to create clear Molino-branded bulletproof glass. Thanks to arramus & Fuzzy Pug for the idea & quest code.\n\nNearly all quests are designed to be repeatable in case of loss of equipment or to try your luck at a higher quality reward. Black Bart’s dig tools are unique and the quest is designed NOT to be repeatable!\n\n**Now With Multiple Languages Localization/Support:** English, German, French, Italian, Japanese, Korean, Polish, Portuguese, Russian, Turkish, Simplified Chinese, Traditional Chinese, Spanish.\n\n### Upcoming Quests\n\n* **Dwarven Bellows** – Faster Smelting, Faster Crafting, Bundled Forged Items\n* **Steel Spikes** – Double the durability of Iron Spikes\n* **Basilone’s M60**\n* **Brienne’s Heavy Armor**\n\n## Acknowledgements\n\n* Wyldwitchyka: For the addition of the Jason’s machete quest modlet\n* Morggin: For the name and lore behind Black Bart, for the Bambi Terminator Crossbow, and for the idea of an Elite level set of quests\n* RichardPaul: For the poem used in the Black Bart quest line.\n* Aeyvi-Daro: For quest text and testing assistance on all quests.\n* mr.devolver: Big thanks for the help fixing the GoTo Trader, improving the quest integration with the trader, and helping seek out a path to add the quests to the Trader dialog!\n* arramus & Fuzzy Pug: Fuzzy Pug requested a new quest be added that grants clear bulletproof glass. arramus was kind enough to do the heavy lifting to create the quest, ShoudenKalferas rebranded the naming of it but mostly kept the quest and code intact as was provided.\n* sechsterversuch & Zeeeni: BIG thanks to these two for providing a full German language translation for every quest, and for testing the translations afterwards!\n\n## Changelog\n\n**White River Tools of Citizenship A19.4\\_1.0:**\n\n* German localization translated by sechsterversuch & Zeeeni. Big thanks to them for this!\n* All other language translations generated via IBM Watson Language Translator\n\n**New Quests Added:**\n\n* Amelia’s Gyrocopter\n* Molino Bulletproof Glass\n* Created Darkness Falls Compatibility Modlet, that allows this quest pack to be used with [Darkness Falls](https://7daystodiemods.com/darkness-falls-mod/).\n\n**Additions to Existing Quests:**\n\nAdded a Remington’s Steel 762 Auto Turret to the Remington Steel Ammo quest. This turret fires slower, aims slower, and has a smaller turn radius, but uses the steel 762 ammo and does more damage in turn.\n\n**Bugfixes:**\n\n* Writ exploit/loophole fixed. No longer can players endlessly craft writs without having worked through the quest itself. The fix implements a token coin that is provided to the player when they accept the quest that is an ingredient in crafting the writ. A player without this token coin would be unable to craft the writ.\n* Fixed bug with quest pack’s lootable books.\n* Fixed multiple small typos in various Localization.txt files.\n* Added the proper perk enhancements to the Deschain’s Revolver, Bambi’s Bow, Daryl’s Crossbow, and Rick Danger’s Augers quest items.\n\n**Tuning:**\n\n* Completely re-tuned the Dundee’s Knife as it was substantially over-powered in comparison to vanilla. The intention of this quest pack has always been to only provide items that are a notch better than vanilla, so as to not throw off overall balancing of the game.\n* Reduced the amount of bicycle parts and overall higher tier loot provided by the citizen’s crates.\n* Adjusted the loot in BlackBart’s coffin to be gold & silver instead of dukes to better follow the storyline.\n* Made the steel ammo more difficult to craft. Repair kits are easy to come by, so weapon damage alone is not enough of a detriment to the extra damage and ease of crafting that steel ammo provides. Also tuned the ammo to cause more weapon degradation.\n* Adjusted the AI behavior and difficulty of the Spirit of Vengeance boss.\n* Added longShaft tag to Bunyan’s FireAxe, Jason’s Machete, and Rick Danger’s Augers to allow them to hold the burning shaft mod.\n* Added sneak damage bonus to Jason’s Machete.\n* Reduced the probability of finding the dark tower books. The item is supposed to be a legendary item, so it should be extremely difficult to collect all the books to obtain it.\n* Reduced the block damage on both Rick Danger Augers as they were too over powered.\n\n**[Download](https://github.com/XelaNull/7DTD-WhiteRiver_ToC/archive/WhiteRiverToC_19.4_1.0.zip)** White River – Tools of Citizenship  \n_Recommended for use with a new game. If you choose not to, anyone with an active quest will have to drop their quest and start it over._  \n**[Download](https://github.com/XelaNull/7DTD-WhiteRiver_ToC_DarknessFalls/archive/White_River_Tools_of_Citizenship_A19.4_1.0_-_Darkness_Falls.zip)** Darkness Falls Compatibility  \n_If you wish to install White River – Tools of Citizenship quest pack into your Darkness Falls game, this compatibility modlet is REQUIRED. Please note that you will see two WRN in your console log. This is expected and not a problem._\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/12269-white-river-tools-of-citizenship/).\n\n**Credits:** [ShoudenKalferas](https://7daystodiemods.com/tag/shoudenkalferas/)",
  "modDownloadURLs": [
    {
      "Info": "White River – Tools of Citizenship",
      "URL": "https://github.com/XelaNull/7DTD-WhiteRiver_ToC/archive/WhiteRiverToC_19.4_1.0.zip",
      "Version": "v19"
    },
    {
      "Info": "Recommended for use with a new game. If you choose not to, anyone with an active quest will have to drop their quest and start it over.",
      "Version": "v19"
    },
    {
      "Info": "Darkness Falls Compatibility",
      "URL": "https://github.com/XelaNull/7DTD-WhiteRiver_ToC_DarknessFalls/archive/White_River_Tools_of_Citizenship_A19.4_1.0_-_Darkness_Falls.zip",
      "Version": "v19"
    },
    {
      "Info": "If you wish to install White River – Tools of Citizenship quest pack into your Darkness Falls game, this compatibility modlet is REQUIRED. Please note that you will see two WRN in your console log. This is expected and not a problem.",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/12269-white-river-tools-of-citizenship/",
  "modAuthors": [
    "ShoudenKalferas"
  ],
  "modTags": [
    "7 days to die quests",
    "ShoudenKalferas"
  ]
}