{
  "modURL": "https://7daystodiemods.com/safe-space-bedroll-mod/",
  "modCreatedTime": "2021-03-15T03:45:30+00:00",
  "modLastUpdatedTime": "2021-03-15T03:45:31+00:00",
  "modName": "Safe Space Bedroll Mod",
  "modImages": [],
  "modShortDescription": "Magejosh had friends that said their biggest issue with playing on servers was the lack of a pause button. He came up with a way to alter the bedroll to become something that could fill that role for them.",
  "modDescription": "Magejosh had friends that said their biggest issue with playing on servers was the lack of a pause button because they have a life that has dynamic demands on their time. Others have mentioned the lack of a sleep system to skip past bits of time in the game sucks. He came up with a way to alter the bedroll to become something that could fill that role for them. As a part of this mod he altered the recipe for the bedroll, and unless you are playing DF you will likely not have access to the fifth ingredient, which is the blessed metal mod. In that case you should comment out that ingredient or replace it with another difficult to craft/loot item to counterbalance the value of the bedroll.\n\nYou have a limited time that the buff is active once you walk off the bedroll. If you run, you will likely ragdoll. Visual effects are to simulate the dream state, and to mitigate using the bedroll to try to cheese the horde with. They will linger for a few seconds after the buff fades. The buff is on a short duration timer, and will be removed if you use either primary or secondary actions.\n\nIf however you just stand on the bedroll in a space that will make it hard for a zombie that may find you while afk to knock you off the bedroll, then you will be safe and can just think of the zombie attacks like a bad dream that you wake up to find is real when you return to your keyboard.\n\nA19.4 verified version here! (yes it also works with Darkness Falls)\n\n**[Download](https://gitlab.com/magejoshplays/7-days-to-die-a19-mods/-/raw/cf5698007cf7034c961a757f818839b3a9adc3de/mjSafeSpaceBedroll.zip)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/23876-safe-space-bedroll-modlet/).\n\n**Credits:** [Magejosh](https://7daystodiemods.com/tag/magejosh/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/magejoshplays/7-days-to-die-a19-mods/-/raw/cf5698007cf7034c961a757f818839b3a9adc3de/mjSafeSpaceBedroll.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/23876-safe-space-bedroll-modlet/",
  "modAuthors": [
    "Magejosh"
  ],
  "modTags": [
    "Magejosh"
  ]
}