{
  "modURL": "https://7daystodiemods.com/requests-a-mod-that-allows-you-to-take-multiple-quests-from-a-bulletin-board/",
  "modCreatedTime": "2021-03-28T05:01:00+00:00",
  "modLastUpdatedTime": "2021-03-28T05:03:37+00:00",
  "modName": "ReQuests - A Mod That Allows You to Take Multiple Quests From a Bulletin Board",
  "modImages": [],
  "modShortDescription": "As is, the mod adds a new recipe: Bulletin Board. When place, this board spawns Quest Papers once a week.",
  "modDescription": "This mod, while fully functional, is a WIP in Tristam’s eyes. It needs heavy rebalancing in order to not throw the game for a loop. He has posted it so that people can give him feedback on what they would want in a new version.\n\nAs is, the mod adds a new recipe: Bulletin Board. When place, this board spawns Quest Papers once a week. Those quest papers can be read to give you the quests they describe. Most are duplicates of vanilla quests. Others will offer specific rewards such as Bike Parts, Weapons, Ammo, or Medicine. The names of the Quest Papers will tell you what biome the quest will take place in. If no biome is listed, it will be random. If you read a Quest Book for a quest that does not exist, such as a Tier 4 Wasteland Quest in a map that has no Tier 4 POI in the Wasteland, you will get a quest location that says “No Trader.” Simply remove the quest from your quest log and pick something else.\n\nThe [quests](https://7daystodiemods.com/tag/7-days-to-die-quests/) he designed are meant to be fun and convenient far more than being balanced. When you are sent to a POI to clear it out, you’ll have to kill X amount of zombies. The higher the tier, the more zombies you have to deal with. They don’t have to be the zombies in the POI you were sent to– any zombies will do.\n\n**For those who care about his logic behind the design of this mod, it’s as follows:**\n\n1. You kill X amount of zombies instead of clearing a POI because it isn’t fun to go through an entire skyscraper, especially alone, and miss a single room of zombies you then have to hunt down. Worse so if you miss enough zombies that the game doesn’t point out which room they’re in.\n2. He didn’t want to have to spec intelligence if he wanted a vehicle or wait until his gamestage was high enough for them to appear in the trader.\n3. He turned up his game difficulty by increasing the zombie spawn. He wanted a way to balance the scales a bit by giving himself a surefire way to get resources. He was aiming for his game to be more “action packed” and less “difficult” in his design.\n4. He set it up so that you get 50 of each Quest paper each week. As is, the Bulletin Board is easy to create (10 nails, 100 wood) and he know people would just craft 100 of them and plaster their base with it rather than follow some arbitrary one-board-per-base self-imposed rule. So long as someone doesn’t come along and take all the papers for an entire team, you’ll be fine. And even if they do, make another one.\n5. There’s no way for you to absolutely know which papers will work until you try them. He didn’t want people to get a bad roll of a bunch of quest papers they couldn’t use. The mod is designed to take randomness out of the game, not add it in.\n6. He made it cheap because you can go to a trader in the first 10 mins of a game, so he wanted you to get access to this mod asap as well.\n7. He didn’t like waiting until he had farmed quest after quest to get to the higher tier quests. He revel in the challenge of doing top tier quests with under-leveled characters. The vanilla game supports it as well since you can share quests with friends.\n8. It helps new players catch up to late game players if they join the game late.\n9. He’s considering making the bulletin board an item you get only when you first enter the game, but he also didn’t want people to be crippled if that one board is destroyed. Letting it be created by a rare item keeps it from being easily accessible, and making it super sturdy encourages using it to stave off hordes. He also don’t want the item given out by vanilla quests, as it’ll clutter quest rewards when you no longer need them.\n10. He doesn’t like only being able to accept one quest at a time from a trader, when they are holding on to several at once. Just feels like extra back and forth to him, though he know that it’s designed to eat up daylight.\n\nHe’s looking for suggestions on how to improve the mod. He’s thinking about making quests that take place in various biomes reward more based on the difficulty of said biome. So it’d be Pine Forest -> Desert/Snow -> Burnt Forest -> Wasteland\n\nHe has also considered having a new McGuffin rewarded when you complete quests, and those are used to craft the higher level quests. But he didn’t want to do that since it would, again, suck if you couldn’t start the quest since you had no POI for it.\n\nIf anyone knows how to keep two bulletin boards from being in close proxy, lmk. He tried taking info from the trees and seeds under block.xml but to no avail.\n\n## Changelog\n\n* Fixed the broken quests.\n* Burnt Forest icons are now red to better differentiate them from Wasteland’s.\n* Added text to quests when you read them describing the quest in a lore friendly way.\n* Quests are now named properly in your quest log.\n* All quests can now be seen on your map.\n* Rewards of some quests were not given out properly, this is fixed. Ammo quests now only offer ammo as a reward. All quests (with one exception) still offer EXP and Dukes.\n\nNew icons for the brand new quests to fit the theme. Vehicle parts are shown for quests that reward parts. A vehicle is displayed for quests that reward the vehicle itself. In this version, only the 4×4 has a vehicle reward, which is available alongside its Parts version. Other vehicles only offer Part quests att, and the Gyro is not included at all.\n\nProbably some other crap he forgot about.\n\n**[Download](https://drive.google.com/file/d/1veTV6Rp86kWe_M7b4ZgXw5dT-R6DFGdA/view?usp=sharing)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/23952-tristams-hodgepodge-o-mods/).\n\n**Credits:** [Tristam](https://7daystodiemods.com/tag/tristam/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/1veTV6Rp86kWe_M7b4ZgXw5dT-R6DFGdA/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/23952-tristams-hodgepodge-o-mods/",
  "modAuthors": [
    "Tristam"
  ],
  "modTags": [
    "7 days to die quests",
    "Tristam"
  ]
}