{
  "modURL": "https://7daystodiemods.com/nuka-colas-mod/",
  "modCreatedTime": "2020-05-08T11:32:00+00:00",
  "modLastUpdatedTime": "2021-04-16T15:51:20+00:00",
  "modName": "Nuka Colas Mod",
  "modImages": [],
  "modShortDescription": "This 7 Days to Die mod adds in 4 refreshing flavors of Nuka Cola! Take your pick from the classic Nuka Cola, Nuka Cherry, Nuka Quartz, or Nuka Quantum!",
  "modDescription": "This 7 Days to Die mod adds in 4 refreshing flavors of Nuka Cola! Take your pick from the classic Nuka Cola, Nuka Cherry, Nuka Quartz, or the ever rare Nuka Quantum!\n\nEach [drink](https://7daystodiemods.com/tag/7-days-to-die-drinks/) has its own buff. May cause certain side effects…\n\nCan be looted almost any place normal water is found, but is very rare. Also can be available in regular vending machines, so make sure to check every one you find! Will give back a bottlecap when you drink one.\n\nThey can also be placed down as a block, similar to the torch, so you can use their warm, radiated [light](https://7daystodiemods.com/tag/7-days-to-die-lights/) to see your surroundings.\n\nThe Nuka Grenade, which can be crafted using Nuka Quantums.\n\nThe Bottlecap Mine, which is crafted from loot only lunchboxes and bottlecaps from Nukas. These lunchboxes can also be placed down and used as storage. Can’t pick them back up though!\n\nBdubyah has also added a Nuka Vending Machine, which has a working a broken variant. They are added to the placeholder block, so any POI that uses it has a chance to get one of them instead of the regular machines. Won’t work on existing saves though.\n\nThe mod now also includes the Nuka Factory [prefab](https://7daystodiemods.com/tag/7-days-to-die-prefab/), so you don’t need to use the separate files. You find the Factory, you might be able to learn the recipes!\n\n**Important:** If you’ve installed the prefab manually before, or have Compopack installed, make sure to delete those files so the modlet version loads!\n\n**For A19:** [The Wasteland](https://7daystodiemods.com/the-wasteland/)\n\n**[Download](https://gitlab.com/bdubyah/Mods---A18/-/archive/master/Mods---A18-master.zip?path=NukaColas)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/11875-bdubyahs-modlets/).\n\n**Credits:** [Bdubyah](https://7daystodiemods.com/tag/bdubyah/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/bdubyah/Mods---A18/-/archive/master/Mods---A18-master.zip?path=NukaColas",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/11875-bdubyahs-modlets/",
  "modAuthors": [
    "Bdubyah"
  ],
  "modTags": [
    "7 days to die beverages",
    "7 days to die drinks",
    "7 days to die food",
    "7 days to die lights",
    "7 days to die prefab",
    "Bdubyah"
  ]
}