{
  "modURL": "https://7daystodiemods.com/telrics-fishing/",
  "modCreatedTime": "2021-01-31T20:39:00+00:00",
  "modLastUpdatedTime": "2021-04-28T22:06:19+00:00",
  "modName": "Telric's Fishing",
  "modImages": [],
  "modShortDescription": "Telric is releasing this as a bit of a test to see how people feel about the way he's doing fishing. This is part of an RPG mod he's working on.",
  "modDescription": "Telric is releasing this as a bit of a test to see how people feel about the way he’s doing fishing. This is part of an RPG mod he’s working on, but has been dummed down quite a bit to be a standalone mod.\n\nThis mod only has one type of fish you can catch (due to each fish requiring a completely different fishing pole) and one recipe (due to him not being a recipes guy…). To begin [fishing](https://7daystodiemods.com/tag/7-days-to-die-fishing/), find a body of water and step in it. You’ll be able to cast your line with left click. Wait for a bite (which will move your crosshairs and make a splashing sound), then quickly reel it in by hitting the F key rapidly. Once you’ve gotten 100 or more points (shown in your buff stack), you’ll catch the fish. Right click at that time to collect it off the rod. You can grill one fish into two fillets at a campfire with a grill in it.\n\nDoes not require restart.\n\nRequires client to install as well as server.\n\nTested and works with Alpha 19.4 b3\n\nRecommended to be played single player or multiplayer, however has not been fully tested with multiplayer (it uses buffs, but only on players so it should be good… should.)\n\n## Changelog\n\n* **_(new)_** Added craftable fishing location to place on piers and docks.\n* Telric just put out a revised copy. Be careful though. If you had the old mod installed, you may get errors. You’ll need to remove the fishing spot blocks that you placed (need to dig under them so they fall). The new files remove that feature. In the new mod, you can fish in any body of water, as long as you’re standing in it. Doesn’t have to be deep. Just a toe tickle. He removed the pop ups and changed some sounds. He tested with the tooltip pop up, but it was extremely all over the place as to when it’d pop up. Since you can only have 1 tooltip on screen at once, it would get backlogged and appear after you’d already caught the fish. So he didnt add that. He did add a splashing sound when you have a bite. Also he editted the icon a little bit so you can tell it’s a fishing pole a bit faster.\n* Added some recipes for the can of tuna and can of salmon. Each require a can and a fish to craft. Also removed the German translation stuff for now.\n\n**WARNING!** If you have this mod installed already, but want the revised copy, you must remove all fishing blocks before you install. If you don’t, you’ll probably have errors as they have been removed. If you’re downloading for the first time, ignore this message.\n\n**[Download](https://www.dropbox.com/s/7sg7di56ox7abw3/TelricsFishingA19.zip?dl=1)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/19976-telrics-a19-modlets/).\n\n**Credits:** [Telric](https://7daystodiemods.com/tag/telric/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://www.dropbox.com/s/7sg7di56ox7abw3/TelricsFishingA19.zip?dl=1",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/19976-telrics-a19-modlets/",
  "modAuthors": [
    "Telric"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die fishing",
    "7 days to die food",
    "Telric"
  ]
}