{
  "modURL": "https://7daystodiemods.com/telrics-spiders/",
  "modCreatedTime": "2020-08-28T01:36:00+00:00",
  "modLastUpdatedTime": "2021-04-28T22:07:21+00:00",
  "modName": "Telric's Spiders",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/07/7-days-to-die-telrics-spiders-additional-screenshot.jpg"
  ],
  "modShortDescription": "This mod adds some new spider enemies. They will spawn more at night. There is a chance a spider egg cluster will spawn too.",
  "modDescription": "This mod adds some new spider enemies. They will spawn more at night. There is a chance a spider egg cluster will spawn too. This is a good source of eggs and spider silk, which is used to craft spider web traps. These traps slow and damage the enemy. Skinning [spiders](https://7daystodiemods.com/tag/7-days-to-die-animals/) gives spider silk, and a very small chance to give you a mountable spider. Wild spiders will die after 5 minutes of being alive, to keep the population down and allow actual zombies the chance to spawn more often. A rare queen spider can also spawn and will give much more silk than regular spiders as well as a higher chance to drop the mount.\n\nDoes not require restart.\n\nRequires client to install as well as server.\n\nTested and works with Alpha 19.4 b3\n\nRecommended to be played single player or multiplayer. Works fine on servers as well.\n\n## Changelog\n\n* **_(new)_** Added new black spiders, and made spiders capable of jumping. Also changed the audio source of the spider, so now you can pinpoint where they are a bit easier.\n* Updated to allow spider web traps to be repairable with spider silk and a stone axe, nailgun, or claw hammer as well as have more health. Lowered egg chance to 0,3 instead of the 4,8 count.\n\n**[Download](https://www.dropbox.com/s/89h92yfv1uuwvd2/TelricsSpidersA19.zip?dl=1)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/19976-telrics-a19-modlets/).\n\n**Credits:** [Telric](https://7daystodiemods.com/tag/telric/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://www.dropbox.com/s/89h92yfv1uuwvd2/TelricsSpidersA19.zip?dl=1",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/19976-telrics-a19-modlets/",
  "modAuthors": [
    "Telric"
  ],
  "modTags": [
    "7 days to die animals",
    "Telric"
  ]
}