{
  "modURL": "https://7daystodiemods.com/cpt-krunchs-4k-rwg-map-lando-v2-0-a19-1-cp46/",
  "modCreatedTime": "2020-10-27T03:26:38+00:00",
  "modLastUpdatedTime": "2021-05-09T20:11:38+00:00",
  "modName": "Cpt Krunch's 4k RWG Map 'Lando v2.0' A19.1 CP46",
  "modImages": [],
  "modShortDescription": "4k RWG Map made using Nitrogen, Unity, and a few other applications. This map was built with Compo Pack 46.",
  "modDescription": "4k RWG Map made using Nitrogen, Unity, and a few other applications. This map was built with Compo Pack 46, and requires it to be installed on a clean copy of 7DTD A19.1.\n\nCpt Krunch has also included some of his favorite mods to accompany the map. Install instructions, along with Mods and Map detailed included in install.\n\nHe know almost all of the modders who have given him permission to use their work in this modlet, but there are a few he could not reach, if you would like your mods pulled from any of these packs he’s putting together, please let him know and he will pull them. He make zero money on the packs and do not ever sell others work.\n\nHe has not taken any pieces from existing overhauls, or modified the included modlets in any way.\n\nHe HIGHLY recommend locking both your Server and Client to 19.1 if you intend to keep both the [map](https://7daystodiemods.com/tag/7-days-to-die-maps/) and the mods going up until the next update.\n\nHe has added these mods for install simplicity and version uniformity for both Single and Multi Player.\n\nStand alone version of the map is also available, but still requires Compo Pack 46.\n\nFairly simple map with 4 highways, some RWG and some hand placed area, with a hand painted biome file.\n\nThis is not a high polished Official Map release and the Snow Biome is blah, but he has updated quite a bit from the old A18 version, and it will provide a fun adventure with good performance on a small map.\n\n**[Download](https://drive.google.com/file/d/1JIXAu6GUCUNHdm_FV_BaE8HAZDeu_blZ/view?usp=sharing)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/22333-cpt-krunchs-4k-rwg-map-lando-v20-a191-cp46/).\n\n**Credits:** [Cpt Krunch](https://7daystodiemods.com/tag/cpt-krunch/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/1JIXAu6GUCUNHdm_FV_BaE8HAZDeu_blZ/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/22333-cpt-krunchs-4k-rwg-map-lando-v20-a191-cp46/",
  "modAuthors": [
    "Cpt Krunch"
  ],
  "modTags": [
    "7 days to die maps",
    "Cpt Krunch"
  ]
}