{
  "modURL": "https://7daystodiemods.com/tactical-action-by-ivandx/",
  "modCreatedTime": "2021-05-17T02:26:00+00:00",
  "modLastUpdatedTime": "2021-05-17T02:29:20+00:00",
  "modName": "Tactical Action by IvanDX",
  "modImages": [],
  "modShortDescription": "This mod is now more about adding more HQ vanilla-esque guns, and nothing else. Thanks again to IvanDX for his blessing and original work.",
  "modDescription": "Massive update. It’s been updated to 19.4! Derived from Ivan’s latest release, found here: [Tactical Action](https://7daystodiemods.com/tactical-action/)\n\nCredit goes to IvanDX for the original mod. Tristam just rebalanced it to fit with vanilla, added descriptions, fleshed out things such as the boxes, crates, and metalboxes, and changed their ammo contents and drop rate. [Weapons](https://7daystodiemods.com/tag/7-days-to-die-weapons/) can now be found in the Secret Stash, crafted at workbenches, and have matching schematics.\n\nTL;DR: This mod is now more about adding more HQ vanilla-esque guns, and nothing else. Thanks again to IvanDX for his blessing and [original work](https://7daystodie.com/forums/showthread.php?101011-MOD-TacticalAction-A17-TrainingManual). Without him, this wouldn’t exist.\n\n## Changelog\n\n* **_(new)_** Made it possible to craft the mods for the TA Guns. Vanilla schematics are used to unlock their TA equivalents. So Laser sights unlock TA’s Laser Sight crafting, etc. One new tier 3 schematic is added for the gun mods that are combinations of Reflex Sights and Scopes, as well as the other rare ones.\n* **_(new)_** Only Red Glow Sticks will be in loot, in order to unclutter your inventory. You can still change their colors like normal.\n* **_(new)_** More localization edits spacing out and/or renaming items. Should cover everything this mod offers now.\n* Updated the recipes for Metal boxes so that all are craftable, fixed the recipe for 40mm Grenade rounds to work at Demo Expert Level 5, and the localization files’ names so that all weapon and ammo names are spaced out properly.\n* Updated to 19.4 and now uses IvanDX’s latest version.\n* Updated to v9\\. Lots of changes and fixes.\n* Updated to v7\\. Fixed the Katana unlock recipe. Now unlocks with the third Night book.\n* Updated for A19.\n* Updated with some changes done to the mod. Made it so the guns accept vanilla ammo as well as ammo when appropriate.\n\n**[Download](https://drive.google.com/file/d/1zlF4zlYZphwvZxbcKJAALEEebO9Ql9Wv/view?usp=sharing)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/17314-tacticalaction-by-ivandx-updated-to-183/).\n\n**Credits:** [Tristam](https://7daystodiemods.com/tag/tristam/), IvanDX",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/1zlF4zlYZphwvZxbcKJAALEEebO9Ql9Wv/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/17314-tacticalaction-by-ivandx-updated-to-183/",
  "modAuthors": [
    "Tristam",
    "IvanDX"
  ],
  "modTags": [
    "7 days to die ammo",
    "7 days to die melee weapons",
    "7 days to die weapons",
    "Tristam"
  ]
}