{
  "modURL": "https://7daystodiemods.com/crop-growth-by-weather/",
  "modCreatedTime": "2021-01-27T06:09:07+00:00",
  "modLastUpdatedTime": "2021-05-19T09:15:23+00:00",
  "modName": "Crop Growth by Weather",
  "modImages": [],
  "modShortDescription": "A mod that allows crop growth to be negatively affected by adverse weather conditions. Each crop has a general range of temperatures in which it can grow.",
  "modDescription": "A mod that allows crop growth to be negatively affected by adverse weather conditions.\n\n## Features\n\nRight now, the only thing that affects crops is the biome temperature.\n\nEach crop has a general range of temperatures in which it can grow. If the temperatures go outside this range, crop growth is stalled. Extreme temperatures outside this range will cause the crop to die.\n\nHarvestable, fully-grown crops are also affected. Extreme temperatures will also cause them to die.\n\nIf a crop dies, a message is sent to the players in the chat. This mod can also message players if a crop’s growth is stalled, but this feature is turned off by default. This can be customized.\n\nIf a crop grows naturally in a specific biome (like aloe in the desert biome or blueberries in the snow biome), that crop’s temperature range is generally matched to that biome.\n\nFor [crops](https://7daystodiemods.com/tag/7-days-to-die-farming/) that don’t grow in a particular biome, Khzmusik has tried to follow the temperatures for that crop to grow in real life, but with adjustments to account for the biome temperature ranges in 7D2D.\n\n**Specifically:**\n\n* Blueberries grow best in cold temperatures.\n* Mushrooms and potatoes grow best in cool temperatures.\n* Pumpkins and cotton grow best in warm temperatures.\n* Aloe and yucca grow best in hot temperatures.\n* “Super corn” grows well in nearly all temperatures.\n* Everything else grows best in moderate temperatures.\n\nAs a practical matter, this means you can grow most crops in the forest, burnt forest, or wasteland biomes, though you will probably have some crops stall or die. But there are some crops that can realistically be grown only in the snow or desert biomes, and you can’t grow many other crops in those biomes.\n\nThis mod should be a good match for his [Seasonal Weather](https://7daystodiemods.com/seasonal-weather/) mod. You may also consider a adding mod that introduces food spoilage, such as SphereII’s [Food Spoilage](https://7daystodiemods.com/dmt-mods-by-sphereii/) mod.\n\n## Customizing\n\nThe messaging can be turned on or off in worldglobal.xml:\n\n* _PlantGrowing.GrowthAlerts_ turns on/off messages sent whenever a crop’s growth is slowed\n* _PlantGrowing.DeathAlerts_ turns on/off messages sent whenever a crop dies\n\nIt is also possible to customize how much each crop is affected by the weather.\n\nEach crop has four different variables that can be set, that determine how they react to the current biome temperature. These variables are represented by properties on the crop’s block, as specified in blocks.xml:\n\n* _PlantGrowing.MinGrowthTemperature_: The minimum temperature required for the crop to grow.\n* _PlantGrowing.MaxGrowthTemperature_: The maximum temperature required for the crop to grow.\n* _PlantGrowing.MinAliveTemperature_: The minimum temperature required for the crop to stay alive. If the temperature goes below this number, the growing plant dies.\n* _PlantGrowing.MaxGrowthTemperature_: The maximum temperature required for the crop to stay alive. If the temperature goes above this number, the growing plant dies.\n\nYou can also specify the block that replaces the crop when the crop dies. To do this, set the _PlantGrowing.Dead_ property to the name of a block in blocks.xml.\n\nIf you do not want harvestable, fully-grown crops to die in extreme weather conditions, comment out this XML:\n\n```\n<append xpath=\"blocks/block[contains(@name, '3HarvestPlayer')]\">\n    <property name=\"Class\" value=\"PlantGrowing\" />\n    <property name=\"PlantGrowing.GrowthRate\" value=\"63.0\" />\n</append>\n```\n\nThose crops will no longer be of the _PlantGrowing_ class, and will not be affected by the [weather](https://7daystodiemods.com/tag/7-days-to-die-weather/).\n\n## Possible Improvements\n\nThese are things that he could do in future updates, if demand exists, and time permits.\n\n* Add other weather variables, such as the number of days since the last rainstorm, the amount the crop is enclosed (inside a building – see _EntityStats.GetAmountEnclosure_), or a flag to have crops die if it snows.\n* Improved translations. (He translated everything using the web, and he’s sure many are terrible.)\n\n## Installation\n\nThis is a DMT mod. So requires [DMT Modding Tool](https://community.7daystodie.com/topic/13037-dmt-modding-tool/). It is not compatible with EAC. After installation, it is highly recommended to start a new game.\n\n**[Download](https://gitlab.com/karlgiesing/7d2d-a19-modlets/-/archive/master/7d2d-a19-modlets-master.zip?path=khzmusik_Crop_Growth_By_Weather_DMT)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/24348-a19-khzmusiks-modlets/).\n\n**Credits:** [Khzmusik](https://7daystodiemods.com/tag/khzmusik/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/karlgiesing/7d2d-a19-modlets/-/archive/master/7d2d-a19-modlets-master.zip?path=khzmusik_Crop_Growth_By_Weather_DMT",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/24348-a19-khzmusiks-modlets/",
  "modAuthors": [
    "Khzmusik"
  ],
  "modTags": [
    "7 days to die farming",
    "7 days to die weather",
    "Khzmusik"
  ]
}