{
  "modURL": "https://7daystodiemods.com/zmxuicpbbm/",
  "modCreatedTime": "2021-05-31T20:54:00+00:00",
  "modLastUpdatedTime": "2021-05-31T21:39:51+00:00",
  "modName": "ZMXuiCPBBM",
  "modImages": [],
  "modShortDescription": "ZMXuiCPBBM is a big bag conversion mod for SMXui. It consists of three modlets: ZMXuiCPBBM (63s), ZMXuiCPBBMxl (99s) & ZMXuiCPBBMxxl (110s).",
  "modDescription": "ZMXuiCPBBM is a big bag conversion mod for SMXui. It consists of three modlets: ZMXuiCPBBM (63s), ZMXuiCPBBMxl (99s) & ZMXuiCPBBMxxl (110s). These modlets are dependant on each other so if you want to use 110 slots just keep them all but it will scale down the UI a bit to fit on screen. If you want to use 99 slots delete ZMXuiCPBBMxxl. If you want to use 63 slots delete the other two.\n\n* **Dependencies:** [SMXui](https://7daystodiemods.com/smxui/).\n* **Compatibility:** Will probably work with most mods/modlets that doesn’t modify the same windows/areas in the XUI files and have a lower load order.\n\n## Changelog\n\n* **_(new)_** Updated to work with A19.5!\n* Updated for A19.2!\n\n## Terms of Use\n\nYou are allowed to use this modlet as is for your own personal use and/or on a server you run and/or administrate.\n\nYou are under no circumstance allowed to distribute any SMX and/or ZMX branded modlets without written consent from the developer.\n\nIf you wish to distribute SMX and/or ZMX branded modlets as part of your own project and consent have been given you are required to do so in such a way so that all the files of the SMX and/or ZMX modlet or modlets in question remain unaltered and you cannot under any circumstance claim credit for creating the modlet or modlets or any of the files provided with it/them.\n\nIf consent is given you are required to make the changes as a new modlet that injects into the modlet in question and keeping load order in mind it is to be named so that it loads AFTER the original modlet. The original modlet shall be distributed as is with no change to its files what so ever.\n\nIf consent is given it is only given on a case to case basis and those that receive consent cannot pass that consent on to another party or project. Nor will the consent pass on to other creators that opt to include consented work into their project.\n\nYou are not allowed to use any of the assets bundled with SMX and/or ZMX branded modlets in other projects. This restriction applies to all files that the SMX and/or ZMX modlets consist of.\n\nYou are required to seek special consent from the developer should you wish to make changes to any asset files provided with the SMX and/or ZMX branded modlets.\n\nYou are required to inform the developer when your project that contains any SMX and/or ZMX modlet or modlets have been made available to the public.\n\n## Installation and Removal Procedures\n\n* Decompress the modlet using WinRAR or a compatible archiver.\n* Copy or move the Mods folder into your 7 Days to Die installation folder. Overwrite if prompted.\n* Verify the install by checking that the ModInfo.xml file is located in this hierarchy: “\\\\Mods\\\\modletname\\\\ModInfo.xml”\n* Remove by deleting the modlet folder in question inside the Mods folder.\n\n**[Download](https://github.com/Sirillion/ZMXuiCPBBM/archive/refs/heads/master.zip)**\n\nIf you feel like making a donation to support the development of the SMX mods, use [this link](https://www.paypal.com/cgi-bin/webscr?cmd=_donations&business=5VLRBAFXDCXBC&item_name=SMX+Development%C2%A4cy_code=NOK&source=url).\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/14615-smx-alpha191/).\n\n**Credits:** [Sirillion](https://7daystodiemods.com/tag/sirillion/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/Sirillion/ZMXuiCPBBM/archive/refs/heads/master.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/14615-smx-alpha191/",
  "modAuthors": [
    "Sirillion"
  ],
  "modTags": [
    "7 days to die backpack",
    "7 days to die bigger backpack",
    "7 days to die smx mods",
    "Sirillion"
  ]
}