{
  "modURL": "https://7daystodiemods.com/smxui/",
  "modCreatedTime": "2021-05-31T20:55:00+00:00",
  "modLastUpdatedTime": "2021-05-31T22:26:30+00:00",
  "modName": "SMXui - The UI Replacement Mod",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/02/7-days-to-die-SMXui-the-ui-replacement-mod-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/02/7-days-to-die-SMXui-the-ui-replacement-mod-additional-screenshot-2.jpg"
  ],
  "modShortDescription": "SMXui is an extension of SMXhud and SMXmenu and will bring the art style over to the rest of the user interface.",
  "modDescription": "SMXui is an extension of [SMXhud](https://7daystodiemods.com/smxhud/) and [SMXmenu](https://7daystodiemods.com/smxmenu/) and will bring the art style over to the rest of the user interface.\n\nSirillion has tried to maintain as close a relation to the vanilla interface as possible but he has also granted himself some artistic freedom when it comes to some areas. It deviates from vanilla with the fifth crafting queue slot which he added to make it fit the overall design better.\n\nThe other changes he made are all optional like the third forge slot and the 63, 99 and 110 slot big bag conversion modlets for those that want a bit bigger bags.\n\n* **Dependencies:** SMXlib, ZMXuiCP.\n* **The Optionals:** [ZMXuiCPBBM](https://7daystodiemods.com/zmxuicpbbm/), [ZMXuiCPTFS](https://7daystodiemods.com/zmxuicptfs/)\n* **Compatibility:** Will probably work with most mods/modlets that doesn’t modify the same windows/areas in the XUI files and have a lower load order.\n\n## Changelog\n\n* **_(new)_** Updated to work with A19.5!\n* Moved the Perks UI to a separate mod.\n* Players Window: Adjusted the width of the distance column by 20px.\n* Fixed a small bug in the itemInfoPanel window.\n* Fixed two bugs with the perks/buffs. Thanks Napalm91 for reporting!\n* Fixed a layering issue in the books window.\n\n## Terms of Use\n\nYou are allowed to use this modlet as is for your own personal use and/or on a server you run and/or administrate.\n\nYou are under no circumstance allowed to distribute any SMX and/or ZMX branded modlets without written consent from the developer.\n\nIf you wish to distribute SMX and/or ZMX branded modlets as part of your own project and consent have been given you are required to do so in such a way so that all the files of the SMX and/or ZMX modlet or modlets in question remain unaltered and you cannot under any circumstance claim credit for creating the modlet or modlets or any of the files provided with it/them.\n\nIf consent is given you are required to make the changes as a new modlet that injects into the modlet in question and keeping load order in mind it is to be named so that it loads AFTER the original modlet. The original modlet shall be distributed as is with no change to its files what so ever.\n\nIf consent is given it is only given on a case to case basis and those that receive consent cannot pass that consent on to another party or project. Nor will the consent pass on to other creators that opt to include consented work into their project.\n\nYou are not allowed to use any of the assets bundled with SMX and/or ZMX branded modlets in other projects. This restriction applies to all files that the SMX and/or ZMX modlets consist of.\n\nYou are required to seek special consent from the developer should you wish to make changes to any asset files provided with the SMX and/or ZMX branded modlets.\n\nYou are required to inform the developer when your project that contains any SMX and/or ZMX modlet or modlets have been made available to the public.\n\n## Installation and Removal Procedures\n\n* Decompress the modlet using WinRAR or a compatible archiver.\n* Copy or move the Mods folder into your 7 Days to Die installation folder. Overwrite if prompted.\n* Verify the install by checking that the ModInfo.xml file is located in this hierarchy: “\\\\Mods\\\\modletname\\\\ModInfo.xml”\n* Remove by deleting the modlet folder in question inside the Mods folder.\n\n**[Download](https://github.com/Sirillion/SMXui/archive/refs/heads/master.zip)** SMXui  \n**[Download](https://github.com/Sirillion/SMXlib/archive/refs/heads/main.zip)** SMXlib\n\nIf you feel like making a donation to support the development of the SMX mods, use [this link](https://www.paypal.com/cgi-bin/webscr?cmd=_donations&business=5VLRBAFXDCXBC&item_name=SMX+Development%C2%A4cy_code=NOK&source=url).\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/14615-smx-alpha191/).\n\n**Credits:** [Sirillion](https://7daystodiemods.com/tag/sirillion/)",
  "modDownloadURLs": [
    {
      "Info": "SMXui",
      "URL": "https://github.com/Sirillion/SMXui/archive/refs/heads/master.zip",
      "Version": "v19"
    },
    {
      "Info": "SMXlib",
      "URL": "https://github.com/Sirillion/SMXlib/archive/refs/heads/main.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/14615-smx-alpha191/",
  "modAuthors": [
    "Sirillion"
  ],
  "modTags": [
    "7 days to die smx mods",
    "Sirillion"
  ]
}