{
  "modURL": "https://7daystodiemods.com/snufkins-community-pack-server-side-vehicles/",
  "modCreatedTime": "2021-06-12T04:47:00+00:00",
  "modLastUpdatedTime": "2021-06-12T04:50:28+00:00",
  "modName": "Snufkin's Community Pack Server Side Vehicles",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-snufkins-community-pack-server-side-vehicles-additional-screenshot-6.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/10/7-days-to-die-snufkins-community-pack-server-side-vehicles-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/10/7-days-to-die-snufkins-community-pack-server-side-vehicles-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-snufkins-community-pack-server-side-vehicles-additional-screenshot-4.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-snufkins-community-pack-server-side-vehicles-additional-screenshot-5.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/10/7-days-to-die-snufkins-community-pack-server-side-vehicles-additional-screenshot-1.jpg"
  ],
  "modShortDescription": "The Snufkin's Community Pack Server Side Vehicles is a growing collection of customised vehicles which consists of Snufkin's originals, with some A19 updates.",
  "modDescription": "The Snufkin’s Community Pack Server Side Vehicles is a growing collection of customised vehicles which consists of [Snufkin’s originals](https://7daystodiemods.com/server-side-vehicles/), with some A19 updates, alongside additional vehicles supported by the community. It would be nice to see this grow and live up to its name. They hope other community modders will consider adding to the collection.\n\nFor now, here is what Snufkin’s Community Pack Server Side Vehicles offers:\n\n1. **Armored Car** – 4 seater road vehicle (Snufkin)\n2. **Army Truck** – 6 seater road vehicle (Snufkin with stability and context edits by oakraven)\n3. **Raft** – 4 seater water vehicle (Snufkin)\n4. **Sled** – 1 seater road vehicle (Snufkin with additional comfort by oakraven)\n5. **Jet Pack** – 1 seater flying vehicle (Snufkin)\n6. **Hell Beast** – 2 seater road motorcycle (Snufkin)\n7. **Parachute** – 1 seater gliding descent vehicle (Snufkin)\n8. **ATV** – 2 seater road motorcycle (Snufkin with functionality fix by oakraven)\n9. **Hell Hound 4×4** – 6 seater road vehicle (oakraven)\n10. **Hell Fire** – 2 seater road motorcycle (oakraven)\n11. **Hell Spikey 4×4** – 6 seater road vehicle (oakraven)\n12. **Hell Dog** – 2 seater road motorcycle (oakraven)\n13. **Shark Blimp** – 2 seater flying shark (oakraven)\n14. **Whirligig** – 3 seater flying VTOL ‘chopper’ (Arramus with kind permission from Bdubyah to use the settings for the MD-500 helicopter from [Bdub’s Vehicles](https://7daystodiemods.com/bdubyahs-vehicles-all-in-one/))\n15. **Magic Bus** – 6 seater road vehicle (oakraven)\n16. **Battle Bus** – 6 seater road vehicle (oakraven)\n17. **Hell Car** – 4 seater road vehicle (oakraven)\n18. **Bath Blimp** – 1 seater flying bath (arramus)\n19. **Battle Bus Drone** – 6 seater flying vehicle (oakraven with assistance from arramus)\n20. **PeNa 1979 Express** – 4 seater flying vehicle (oakraven) – Thanks to PeNa1979 for play testing the Snufkin range of mods.\n21. **Psyren Ride** – 4 seater road vehicle (oakraven)\n22. **Green Max** – 4 seater road vehicle (oakraven)\n23. **Red Max** – 4 seater road vehicle (oakraven)\n24. **Hell Piggy** – 2 seater road vehicle (oakraven)\n25. **Catfish Blimp** – 1 seater flying cart (oakraven and arramus)\n\nAirborne vehicles using Blimp settings need to be filled with gas to get the sounds working.\n\nDre kindly puts the [vehicles](https://7daystodiemods.com/tag/7-days-to-die-vehicles/) to test with his regular gaming party and focusses on ensuring the seating is oriented towards a full party for questing and looting adventures alongside general stability and function checks.\n\nBe warned, as with the original warning by Snufkin, these vehicles have their ‘moments’ and will not always perform as hoped. However, this pack does offer choice, and you can select a vehicle for your own style of gameplay if you want to venture away from the standard offerings.\n\nHere are just a few sample images to give a visual overview.\n\nThe whole collection:\n\nAnticlockwise from the ATV (which can perform turns while in the air but needs care while breaking unless you really want to do a quick 180 flip), Hell Fire, Hell Dog, and Hell Beast (which get some decent speed and can hop over a vehicle before performing a drifting stop, and Whirligig (offering the VTOL and speed burst of a chopper).\n\nFrom back to front, the raft is in the river (and gently follows the panning direction of the water if it isn’t brought onto shore), with the parachute (requiring a high building and a gentle breeze), Hell Spikey 4×4 (which can carry a full party complement on a quest) and the Armored Car (offering added protection). Finally is the Shark Blimp (that can turbo ascend and descend like a rocket).\n\n## Changelog\n\nHere is a small update to the Snufkin’s Community Pack Server Side Vehicles.\n\nThis update changes the recipe ingredients for a variety of vehicles that were very easy to manufacture and brings them more into balance with the regulars. Server Admin are typically knowledgeable with how to increase/decrease recipe demands as they become familiar with the code, whereas some of the most common requests were from players asking how to make it more difficult to create a Shark Blimp and vehicles of that nature. Server Admin were typically increasing the challenge anyway and can decrease where appropriate.\n\nIn addition, here is a new Blimp type vehicle that uses the power of flying Catfish to provide levitation. The Catfish were found by oakraven in the game files and this brings them back into the game. Just a fun vehicle to add to the Shark Blimp and Bath Blimp (but with increased recipe requirements).\n\nPlayers will sit on the push bar with feet inside. A lantern is hiding inside the cart rubbish pile and will add some localised illumination while the Catfish have a headlight beam each.\n\n## Installation\n\nIf you’ve never installed a mod before it is necessary to create a mod folder in the main directory or in an area suggested by your server host if they have modified the installation. Simply make a new folder called **Mods** (with a capital **M** to reflect standard nomenclature). If you drag the mod folder directly out of the zipped file it can be placed directly into the **Mods** folder and the game will look in there as you launch your World. If you allow your unzip function to extract the folder, it may make another unnecessary folder and place the mod inside it. This will not be recognised by the game/server if you place it in the **Mods** folder like this. Please take it out of the extra folder level. The top layer will be a single folder and in the second layer you will see a **ModInfo.xml** file with or without additional folders depending on the mod. This will become elementary once you’ve launched a few mods.\n\nThe magic of this mod is that is only needs to be installed in the server/person who has launched the main environment that others join. It is a technical work of art. Enjoy.\n\n**[Download](https://github.com/arramus/Snufkin-CommunityPack-ServerSideVehicles-A19-2021June12/archive/refs/heads/main.zip)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/22357-snufkins-community-pack-server-side-vehicles/).\n\n**Credits:** [Arramus](https://7daystodiemods.com/tag/arramus/), Snufkin, oakraven, Dre, BubbaJoe, h0tr0d, Sunbursts",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/arramus/Snufkin-CommunityPack-ServerSideVehicles-A19-2021June12/archive/refs/heads/main.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/22357-snufkins-community-pack-server-side-vehicles/",
  "modAuthors": [
    "Arramus",
    "Snufkin",
    "oakraven",
    "Dre",
    "BubbaJoe",
    "h0tr0d",
    "Sunbursts"
  ],
  "modTags": [
    "7 days to die vehicles",
    "Arramus"
  ]
}