{
  "modURL": "https://7daystodiemods.com/the-working-tfp-raft/",
  "modCreatedTime": "2020-06-30T21:21:00+00:00",
  "modLastUpdatedTime": "2021-06-12T21:22:14+00:00",
  "modName": "The Working TFP Raft",
  "modImages": [],
  "modShortDescription": "The TFP raft was rigged as a 'working water entity' by DUST2DEATH and the 'Raft float xml physics' applied by Ragsy.",
  "modDescription": "The TFP raft was rigged as a ‘working water entity’ by DUST2DEATH and the ‘Raft float xml physics’ applied by Ragsy.\n\n## Launch\n\nThe Raft can be placed in shallow water with level ground underneath much the same as the latest version of the ‘[boating modlet](https://7daystodiemods.com/a-working-boat-mod-water-vehicles-project/)‘. You can also place the Raft on a flat piece of ground and as near to water as possible and launch from a steeper riverbank side. When launching from land move the raft down slowly towards water and turn it slightly sideways as you approach the waters edge and use the spacebar (tiltback) as you enter the water.\n\nOnce in the water level the Raft and off you go.\n\nThe Raft will behave a bit irratically on land and will wobble about a bit initially, on water the Raft is very stable.\n\n## Controls\n\nNormal keys W and Shift for forward momentum and Space bar and C control the up and down angles (same as a gyro) which you may need to adjust slightly as you travel on water. Although once levelled the Raft is much more stable than a boat. Steer the Raft with the A and D keys.\n\nIf you let go of W and shift (Turbo) then the Raft slowly comes to a stop, there is no reverse on a raft although pressing S will slow the Raft down more quickly this replaces Spacebar as the brake key.\n\nTo ‘anchor the Raft’ and stop it drifting away use C and Spacebar to level the Raft until it stops drifting, useful if you have a [fishing](https://7daystodiemods.com/tag/7-days-to-die-fishing/) mod installed.\n\n**Note:** The speed of the Raft is reduced as compared to the testing video and the camera angle shortened.\n\n## Crafting\n\nThe Raft is craftable in a standard workbench with no progression needed at the cost of having enough resources and actually finding a working workbench. Finding a workbench in early game would be a bonus and allow you to make the Raft a lot sooner.\n\nThe recipe’s are simple and use standard in game resources… feel free to alter the recipe if you wish.\n\nRaft has 4 seating positions… not tested in Multiplayer yet.\n\n## Important Notes\n\n* The Assets in this Modlet are purchased (unless otherwise stated) and therefore you are not allowed to extract and alter them in any way.\n* The assets can be used in other mods that are purely ‘non profit’. These assets must not be used in any venture that attempts to make money out of modding.\n* If you use the xml code Ragsy came up with do the right thing and credit him for the float code.\n\n**[Download](https://gitlab.com/Ragsy2145/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=The%20TFP%20Raft%20Modlet%20A19)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/14070-community-watercraft-projects/).\n\n**Credits:** [Ragsy2145](https://7daystodiemods.com/tag/ragsy2145/)  \n_Additional Credits:_ The Fun Pimps, DUST2DEATH, 7 Days to Die Forum Community, Guppy’s Modding Discord",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/Ragsy2145/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=The%20TFP%20Raft%20Modlet%20A19",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/14070-community-watercraft-projects/",
  "modAuthors": [
    "Ragsy2145Additional Credits: The Fun Pimps",
    "DUST2DEATH",
    "7 Days to Die Forum Community",
    "Guppy’s Modding Discord"
  ],
  "modTags": [
    "7 days to die boat",
    "7 days to die vehicles",
    "Ragsy2145"
  ]
}