{
  "modURL": "https://7daystodiemods.com/a-working-boat-mod-water-vehicles-project/",
  "modCreatedTime": "2021-07-04T00:22:00+00:00",
  "modLastUpdatedTime": "2021-07-04T00:24:48+00:00",
  "modName": "A Working Boat Mod - Water Vehicles Project",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/06/7-days-to-die-a-working-boat-mod-water-vehicles-project-additional-screenshot.jpg"
  ],
  "modShortDescription": "Place the boat in water in a 'shallow water' area that is fairly level ground underneath. Then add fuel to boat and off you go.",
  "modDescription": "After discovering and making a vehicle float on water uncontrollably sometime ago Ragsy kept on going back to it inbetween other work he was doing and eventually made controllable versions of various in game vehicles both the pimps ones and some custom models by Guppycur and DUST2DEATH purely as proof of concept.\n\nGuppy then kindly bought and rigged some custom boat models especially for this endeavour and they chose the flat bottomed boat version as the most suitable for the start of the water vehicles project way back in A17.\n\nRagsy thanks Guppy for his time and his efforts with Ragsy in the early days getting the models rigged so Ragsy could apply his float xml code on the models.\n\nStill an ongoing work in progress but usable as an XML Only mod (no SDX or DMT) so far.\n\nThis mod does not change water blocks at all, so its going to be just add the xml mod and off you go/float. And as per usual with mods that add new models both client and server would need the mod.\n\n## How to Use the Mod\n\nA showcase of this mod and other water vehicles, [Bathtubboat](https://7daystodiemods.com/bath-boat-mod/), [Windsurfer](https://7daystodiemods.com/windsurfer-mod/) and [Jetski](https://7daystodiemods.com/jetski-mod/)… some in background are being developed for future use in game:\n\n### Launch\n\nPlace the boat in water in a ‘shallow water’ area that is fairly level ground underneath, boat will rise to surface ready for use once placed, if you have no shallow water in your map then build a small launch dock like in this example kindly supplied by sinder.\n\nThen add fuel to boat and off you go. The boats are economical on fuel so fuel will last a very very long time.\n\nThe boat will behave irratically if placed on land and will damage player made blocks, it will move about a bit on its own but is perfectly stable on water.\n\n### Controls\n\nSpace bar and C control the up and down angles (same as a gyro) which you may need to adjust slightly as you travel on water. Steer the boats with the A and D keys.\n\nIf you let go of W and shift (Turbo) then the boat slowly comes to a stop, pressing S will slow the boat down more quickly this replaces Spacebar as the brake key.\n\nTo ‘anchor the boat’ and stop it drifting away use C and Spacebar to level the boat until it stops drifting, useful if you have a [fishing](https://7daystodiemods.com/tag/7-days-to-die-fishing/) mod installed.\n\n### General Information\n\nBoats can be picked up into inventory if you sink it at any point provided the ‘inventory is empty’, although be careful if you sink it too far away from the shores as it could be a long swim back or a long swim to recover the boats.\n\n### Crafting\n\nThe boats are craftable in a standard workbench with no progression needed as the boats are intended as an early game version at the cost of resources and actually finding a working workbench early in the game would be a bonus and allow you to make the boats a lot sooner. The recipe is simple and uses in game resources.\n\n## The Future\n\nAlong the way hopefully they can expand this to have some bigger boats and different types of watercraft such as, a canoe, a raft, small sail boat, fishing boat and perhaps even a jetski.\n\n## Changelog\n\n**Update Version 2**\n\n* Fixed exit position thanks to DUST2DEATH for the info on his APC exit co-ordinates…\n\n**Update Version 3**\n\n* Fully updated to A18 compatible xml physics and boats now placeable in water.\n\n**Update Version 4**\n\n1. Fixed momentum and now boats will slowly come to a halt and stop… They stop quicker with pressing the S key\n2. Both boats can anchor in water just make sure boats are level in the water using c or spacebar and they wont drift away… Useful for fishing mods and the like.\n3. Fixed placing in water… Boats were slow to come to surface.\n4. Boat stabilty improved and stopped the random quick sinking when tilted too much.\n5. Added a second seat to the flat bottomed boat (not tested in MP yet).\n6. Adjusted turn rates and speeds to more suitable levels (subjective).\n7. Boat names changed for readability… May effect mods that reference the original names.\n\n**Update Version 5**\n\n1. **_(new)_** Update fix for Version 5  \n   1. Particles change to world space  \n   2. Fixed Flatbottom Boat moving with no fuel\n2. Added Spanish translation to the original Boating Mod localisation pushed to GitLab. Translations supplied by Orlydb.\n3. Texture settings adjusted\n4. Re-scaled/resized both boats\n5. Added decorative cooler box to flat bottomed boat\n6. Added a third seat to the flat bottomed boat (not tested in MP yet).\n7. Depth masks applied to boats to stop water seeping effect and allow boats to ride lower in water for more realism effect.\n8. Particle system added… this can be toggled via the ‘F’ key (headlight function)\n9. Added ‘drag’ colliders to bottom of boats to counter land use. Boats will stick in ground and steering is compromised\n10. Added Localisation file\n11. Added working propellers\n\n**Note:** With the amount of changes you must start a new save after installing this version. If you install during a current game you will loose the boats you have made. For best result remove version 4 when you finish your current game and then install version 5 and start a new game.\n\n## Important Notes\n\n* The Assets in this Mod are purchased (unless otherwise stated) and therefore you are not allowed to extract and alter them in any way.\n* The assets can be used in other mod overhauls that are purely ‘non profit’. These assets must not be used in any venture that attempts to make money out of modding.\n* If you use the xml code Ragsy came up with do the right thing and credit him for the float code.\n\n**[Download](https://gitlab.com/Ragsy2145/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=Boat_Modlet_V5)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/14070-community-watercraft-projects/).\n\n**Credits:** [Ragsy2145](https://7daystodiemods.com/tag/ragsy2145/), Guppycur  \n_Additional Credits:_ 7 Days to Die Forum community, The Fun Pimps, The ‘Crew’ on Guppy’s Discord, Haidrgna, ActiniumTiger (for new texture for dingy), Orlydb (for Spanish translation)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/Ragsy2145/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=Boat_Modlet_V5",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/14070-community-watercraft-projects/",
  "modAuthors": [
    "Ragsy2145",
    "GuppycurAdditional Credits: 7 Days to Die Forum community",
    "The Fun Pimps",
    "The ‘Crew’ on Guppy’s Discord",
    "Haidrgna",
    "ActiniumTiger (for new texture for dingy)",
    "Orlydb (for Spanish translation)"
  ],
  "modTags": [
    "7 days to die boat",
    "7 days to die vehicles",
    "Ragsy2145"
  ]
}