{
  "modURL": "https://7daystodiemods.com/purgatory-server-side-overhaul-collection-mod/",
  "modCreatedTime": "2021-07-10T05:14:41+00:00",
  "modLastUpdatedTime": "2021-07-10T05:51:30+00:00",
  "modName": "Purgatory Server-Side Overhaul Collection Mod",
  "modImages": [],
  "modShortDescription": "You have been magically trapped in Purgatory and have to find a way to survive until you can find a way to escape.",
  "modDescription": "Purgatory was a wild idea Magejosh had before he knew anything about modding back in 2020\\. He has learned so much since starting work on this. He know he has a lot left to do to really make it fully match his vision, but it’s at the point it’s fun and playable. To him and his playtesters at least. He hope you like it.\n\n_You have been magically trapped in Purgatory and have to find a way to survive until you can find a way to escape._\n\nPurgatory is confirmed working on a19.5 and can be used as a server side only overhaul for servers. This means anyone installing it to their server will be able to have any player with only the vanilla game client still connect to and play on a server using Purgatory. If you are using one of the maps provided, or generated with a Purgatory modded game client, then the players will need to get a copy of Purgatory or Compopack v47 rwg mod version and add that to their mods folder or they may not be able to connect to your map due to the number of new POI’s to download.\n\nPurgatory is intended to create a new challenge for the experienced 7 days player. Dying is no longer without consequence. It should also be expected, often.\n\nIn this version the endgame has been disabled for more time to be spent on better balancing and bug fixes. That does not remove the challenge or reduce the reasons to play through to at least level 500 to unlock your final items in your build. There are magic items, and almost every item destroys when it’s fully degraded. There’s many new challenges besides the zombie’s rage and magical powers. There are 4 new perk trees, and many perks have been rebalanced. Your [backpack](https://7daystodiemods.com/tag/7-days-to-die-backpack/) and the loot game have been greatly altered to add new fun and challenges as well. Stun Baton and Spear have been rebalanced and improved as well.\n\n## Credits\n\nCredits listing with links to original versions of mods used in the overhaul’s collection: [Credits List](https://docs.google.com/document/d/1D48Z5aJbMBLBz9KmtpzyslyuoD_pHkPTm_WrqU3J8Lc/edit?usp=sharing)\n\n## Known Bugs\n\n* Some users have reported a red error which points to profiles.sdx on game client load. Closing the console and ignoring it has not seemed to cause any further issues in all the testing done so far. You should be able to ignore it.\n* Also know for the quad shotgun to cause a red error when out of ammo and using right click to reload.\n\n**[Download](https://drive.google.com/file/d/1aLjegyc4tSAODnNdRq1MxKBcNkkN1RAN/view?usp=sharing)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/24751-purgatory-server-side-overhaul-collection-mod-official-a195-v100-download/).\n\n**Credits:** [Magejosh](https://7daystodiemods.com/tag/magejosh/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/1aLjegyc4tSAODnNdRq1MxKBcNkkN1RAN/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/24751-purgatory-server-side-overhaul-collection-mod-official-a195-v100-download/",
  "modAuthors": [
    "Magejosh"
  ],
  "modTags": [
    "7 days to die backpack",
    "7 days to die loot",
    "7 days to die melee weapons",
    "7 days to die perks",
    "7 days to die quests",
    "7 days to die weapons",
    "7 days to die zombies",
    "Magejosh"
  ]
}