{
  "modURL": "https://7daystodiemods.com/ztensitys-creature-renaming-mod-series/",
  "modCreatedTime": "2021-01-09T08:02:00+00:00",
  "modLastUpdatedTime": "2021-07-12T08:41:46+00:00",
  "modName": "Ztensity's Creature Renaming Mod Series",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/12/7-days-to-die-ztensitys-creature-renaming-mod-series-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/12/7-days-to-die-ztensitys-creature-renaming-mod-series-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/12/7-days-to-die-ztensitys-creature-renaming-mod-series-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/12/7-days-to-die-ztensitys-creature-renaming-mod-series-additional-screenshot-4.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/12/7-days-to-die-ztensitys-creature-renaming-mod-series-additional-screenshot-5.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/12/7-days-to-die-ztensitys-creature-renaming-mod-series-additional-screenshot-6.jpg"
  ],
  "modShortDescription": "Select A19 patches that rename zombies, animals, machines and more!",
  "modDescription": "Select A19 patches that rename zombies, animals, machines and more!\n\nInto hours of playing 7 Days to Die and diving into the vast modding community, Ztensity decided to use Sirillion’s entire [SMX](https://7daystodiemods.com/tag/7-days-to-die-smx-mods/) series. Sirillion’s mods overhaul the UI of 7 Days to Die, which make changes to the HUD, Menu and general UI. Ztensity realized sometime later his favorite mod of this series was Sirillion’s optional Target Health Bar designed for compatibility with his UI overhaul.\n\nAfter playing 7 Days to Die with a full list of mods including the SMX series, Ztensity quickly realized that some animals, zombies, machines, etc. would show up in the health bar from the Target Health Bar mod as “animalZombieBear” and “zombieJoeRadiated,” instead of “Infected Bear” or “Radiated Cadaver.” He then began slowly writing his creature renaming mod series that now currently spans six different mod patches. With the intent to increase immersiveness when encountering different creatures in game, each mod is now publicly available as separate downloads.\n\n## Dependencies\n\nBefore deciding to install any of his mods, you must first have to have a Health Bar mod to see the name changes. See below:\n\n* Sirillion’s [SMX Series Target Health Bar](https://7daystodiemods.com/zmxhudcpthb/)\n* Khaine’s [HP Bars](https://7daystodiemods.com/hp-bars/)\n\nIt’s worthy to note that if you are using the Mod Launcher, you can install all of Sirillion’s SMX series of mods there. That said, once you have installed one of the health bar mods, you can then download Ztensity’s “vanilla” mod and the others if you have their appropriate mod they are patching in your “Mods” folder.\n\n## ZT0-VanillaCreatureRenaming\n\nThis mod can be installed right away in 19.2 (b4). Surprisingly, a variety of animals, select turrets and zombies needed renaming. He’s sure this is because the developers were never intending for us to see there names in the way the health bar allow. However, he recognized it was necessary as his first mod an even renamed some vanilla creatures for a new experience. He believe this is the most important mod for each player using a health bar mod, as it will improve immersiveness when viewing vanilla creatures. If you’re adding creatures from additional mods, keep looking for his other mods below!\n\n**[Download](https://drive.google.com/u/0/uc?id=1zcU6s0Uv8pZUdRmA16fYyazwm-QNSIFm&export=download)** ZT0-VanillaCreatureRenaming\n\n## ZT1-CreaturePackZombieNames\n\nThis mod is what he’s calling a “patch” to Xyth’s [0-CreaturePackZombies](https://7daystodiemods.com/creature-packs-a-community-entity-project/). Similar to the Vanilla Creature Renaming mod, this mod will rename every zombie that this pack adds to the game in 19.2 (b4).\n\n**[Download](https://drive.google.com/u/0/uc?id=19t6HlV58hUWJlPqvcOYuF_6dvwry8eCS&export=download)** ZT1-CreaturePackZombieNames\n\n## ZT1-CreaturePackHumanNames\n\nThis mod is another patch to Xyth’s [0-CreaturePackHumans](https://7daystodiemods.com/creature-packs-a-community-entity-project/). Unlike the Vanilla Creature Renaming mod, this mod will rename every human that this pack adds to the game in 19.2 (b4).\n\n**[Download](https://drive.google.com/u/0/uc?id=1YwGdJ7JVq6TEju5vhAAvu4-5Z6zpuzuE&export=download)** ZT1-CreaturePackHumanNames\n\n## ZT1-CreaturePackAnimalNames\n\nThis mod is another patch to Xyth’s [0-CreaturePackAnimals](https://7daystodiemods.com/creature-packs-a-community-entity-project/). This is also like the Vanilla Creature Renaming mod, however, this mod will rename every animal that this pack adds to the game in 19.2 (b4).\n\n**[Download](https://drive.google.com/u/0/uc?id=1B-O2KzbKOtAb3N3xP1C8PRUr2FlMBHHk&export=download)** ZT1-CreaturePackAnimalNames\n\n## ZT1-CreaturePackMechNames\n\nThis mod is another patch to Xyth’s [0-CreaturePackMechs](https://7daystodiemods.com/creature-packs-a-community-entity-project/). Far different from the Vanilla Creature Renaming mod and Xyth’s other Creature Pack’s, this mod renames the mech creatures that this pack adds to the game in 19.2 (b4).\n\n**[Download](https://drive.google.com/u/0/uc?id=1efxl1-Ielkab6fNBW_mWCljN9Iq4J_NT&export=download)** ZT1-CreaturePackMechNames\n\n## ZT1-HDMumpfySkinsZombieNames\n\nThis mod is a patch to Mumpfy’s [New Zombie Textures](https://7daystodiemods.com/new-zombie-textures-by-mumpfy/). What separates this mod from the others is that it’s not apart of the Creature Pack Series and instead, it gives proper names to new zombie variants that have been added by this particular mod to the game in 19.2 (b4).\n\n**[Download](https://drive.google.com/u/0/uc?id=19mc_HoyC8mc3V-PhcUyySVwk5jgbjzqz&export=download)** ZT1-HDMumpfySkinsZombieNames\n\n## Changelog\n\n**Update 1.1!**\n\nAll creature renaming mods have been updated to version 1.1 which includes a minimal .txt file update. All that has been added is a Read Me. What is exciting about this update, is that it is one step closer to getting all of his mods onto the launcher!\n\n## Notes\n\n### NPC Packs Information\n\nZtensity does plan to eventually work on renaming mods for Xyth’s 1-NPCPackAnimals, 1-NPCPackHumans and 1-NPCPackMechs. However, due to complications currently with SphereII’s NPC Dialog Windows and 0-SpherellCore, he put his experimental mods on the backburner. Mod author SphereII has stated that a planned update for both Winterween and 0-SpherellCore is in the works to hopefully be pushed by A19.3\\. For now, he will wait for that update to be released before tackling renaming NPCs of any kind.\n\n### Future Updates\n\nThese are his first mods and he decided after a lot of time tweaking names, testing, etc. it was time to go public. That said, he focused only on the mods he was using by Xyth and Mumpfy. He may occasionally release updates to names of any of these creatures, thereby archiving the old files and providing the both the new file and the older files as downloadable links, in what will likely be different places of the post. At that time, it’ll be up to players discretion if they will take the update or not, although he would strongly encourage that you do, as he is all for increasing immersiveness.\n\n### Renaming “Patches” Eventual Expansion\n\nHis plan will be to eventually begin creating new mods to patch names for creatures from other mod authors, to further increase immersiveness for players. If you have a mod you use a lot that hasn’t been touched, feel free to suggest it and he will consider it for his next renaming mod!\n\n### Shout Outs\n\nIf it wasn’t for discussion, guidance and help getting started from other mod authors in Guppy’s Discord like wrathmaniac, TSBX, Xyth, Mumpfy, SphereII, Sirillion, saminal, Khaine, chiko and Guppy himself, none of this would have been possible.\n\n### Credits\n\nNone of Xyth’s Creature Packs would be possible either if it wasn’t for the hard work and communication of this powerful modding community. Primarily, he want to give an extra thank you to not only Xyth, but also DarkStarDragon, Guppycur and TSBX for work on the zombies, Robeloto for work on Spider sounds, Mumpfy for work on re-texturing and new asset creation, and XML work by Kergan, SaltyAF and Chikorina (Chiko).\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/22779-ztensitys-creature-renaming-modlet-series/).\n\n**Credits:** [Ztensity](https://7daystodiemods.com/tag/ztensity/)",
  "modDownloadURLs": [
    {
      "Info": "ZT0-VanillaCreatureRenamingDownload ZT1-CreaturePackZombieNamesDownload ZT1-CreaturePackHumanNamesDownload ZT1-CreaturePackAnimalNamesDownload ZT1-CreaturePackMechNamesDownload ZT1-HDMumpfySkinsZombieNames",
      "URL": "https://drive.google.com/u/0/uc?id=1zcU6s0Uv8pZUdRmA16fYyazwm-QNSIFm&export=download",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/22779-ztensitys-creature-renaming-modlet-series/",
  "modAuthors": [
    "Ztensity"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die npcs",
    "7 days to die zombies",
    "Ztensity"
  ]
}