{
  "modURL": "https://7daystodiemods.com/age-of-oblivion-farm-life-revisited/",
  "modCreatedTime": "2021-07-14T01:36:00+00:00",
  "modLastUpdatedTime": "2021-07-14T01:38:47+00:00",
  "modName": "Age of Oblivion (Farm Life Revisited)",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/07/7-days-to-die-age-of-oblivion-farm-life-revisited-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/07/7-days-to-die-age-of-oblivion-farm-life-revisited-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/07/7-days-to-die-age-of-oblivion-farm-life-revisited-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/07/7-days-to-die-age-of-oblivion-farm-life-revisited-additional-screenshot-4.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/07/7-days-to-die-age-of-oblivion-farm-life-revisited-additional-screenshot-5.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/07/7-days-to-die-age-of-oblivion-farm-life-revisited-additional-screenshot-6.jpg"
  ],
  "modShortDescription": "This is my rebuild of the Farm Life Expanded mod. This is an Alpha release and is still limited in features. It is meant as a preliminary test to receive feedback.",
  "modDescription": "This is my rebuild of the [Farm Life Expanded](https://7daystodiemods.com/farm-life-expanded/) mod. This is an Alpha release and is still limited in features. It is meant as a preliminary test to receive feedback and find any issues.\n\nWhile most of the assets and recipes come from the Farm Life Expanded mod this is a brand new mod and not simply a fix for the old one.\n\n## About\n\nEverything within this mod starts at the [Farm](https://7daystodiemods.com/tag/7-days-to-die-farming/) Table, Craft the Farm Table and you will have access to everything. There are many Crafting tables, they are:\n\n* Farm Table\n* Cloning Station\n* Butcher Table\n* Brew Station\n* Cold Smoker\n* Dairy Churn\n* Gas Oven\n* KitchNaid\n* Rustic Smoker\n* Webber Grill\n* Wood Grill\n* Webber and Wood Grill are identical except for appearance as well the Rustic and Cold Smokers are identical.\n\nThere are limited [food](https://7daystodiemods.com/tag/7-days-to-die-food/) recipes available right now but enough to make a difference.\n\nMany Crops do not have any use. (But they will)\n\nAnimal Breeding/crafting has been completely overhauled! In order to craft another living thing you first need a Cloning Table. You then need a Cloning Chamber. To craft a cloning chamber you will require Cryogenic Material and DNA, Both of which can be found in the world. DNA can be extracted from Raw Meat using the Cloning Table. there are 3 types of Cryogenic Material and two types of DNA.\n\n### What Can You Clone?\n\nThanks to Arramus and Oak Raven for allowing me to integrate Oak’s pets and Guards! As a result we can clone:\n\n* Turret Guards\n* Animal Guards\n* Pet [animals](https://7daystodiemods.com/tag/7-days-to-die-animals/)\n* A Chicken that lays Eggs\n* A Cow that makes milk\n* A Cow to harvest Beef and Leather\n* A Pig to harvest Pork\n\nThere will be many more to come!\n\nCloning stations come in Normal and Advanced Versions! Normal one are only good for one use, Advanced ones can be reused! Be careful Cloning is a finnicky process and does not work 100% of the time. In fact it only works from 20-50% of the time. Failure results in Rotten Flesh\n\nIn this Alpha the time to clone has been reduced greatly in order to make testing easier. The time will be increased in the next version.\n\nThere are still Items without Descriptions and there is no Quest system right now. There is still a lot to be added to get to 1st Full release.\n\nI am officially separating things into two different releases! Going forward Subsequent releases will be known as Age of Oblivion as the Mod has been moving away from just Farming components. As a result I am now releasing a “Release” version of Farm Life Revisited Lite. This version is just the farming components, Crops, Food, Animals (Cloning). This release will still get bug fixes and will get any Farm related content that gets added to Age of Oblivion.\n\n## Changelog\n\n**Alpha 1.8 Released!**\n\n* Includes bug fixes for some of the Friendly animals\n* Reduced greatly the number of Bats that spawn!\n* Made the spawning of Friendly’s be specific to Biome. ie Peguin in Snowy area’s and Elephant in Desert\n* Added a Bunch more Friendly Animals! Turtle, Sheep, Zebra, Pug, Beagle, Goose, Leopard, Comodo Dragon\n* Balanced the number of Oblivion Crates that appear and the loot they contain. Added More Beakers and Steroids for Cloning!\n\nFine Tuned Batcar01 – Drives better and faster! More vehicle tune ups are coming!\n\n**Alpha 1.75 Released!**\n\n* Bug fixes!\n* Cloning now takes longer\n* Crops no longer grow almost instantly!\n* Now includes the fantastc Mod White River Tools of Citizenship!\n* Now includes Expanded Firearms!\n* More Friendly animal will be found in the World\n* Oblivion Loot Crates can now be found in the world\n* Now grants 2 skill points per level! (If not wanted simply delete the 2 Skill Points Directory)\n\n**Alpha 1.71 Released!**\n\nFixes issue with Clone Chambers not being unlocked and Advanced Forge Display\n\n**Alpha 1.7 Released!**\n\n* More Bug Fixes\n* More Food Recipes! (Finally!)\n* Deep Fryer – for many of these new recipes!\n* New Oven Model\n* New Chain Link Fence and a Brick/Metal Fence!\n* New Oblivion Work Bench – All workbenches are crafted from this Bench… even Vanilla ones.\n\n**Alpha 1.6 Released!**\n\n* Mainly Small Bug Fixes to 1.5\n* Improved handling most vehicles\n* Added Community Creature Packs\n* 90 Slot Backpack.\n* Traders will now sell Raw meat\n* Fixes and Changes to Questline (Still a work in Progress)\n\n**Alpha 1.5 is Available! Big Update!**\n\n**Note:** Lots of Changes… You will 1000% have to start a new game and I would recommend playtesting for awhile before starting a serious game with it\n\nRestructured Folder and file Structure. Standardized Naming. (Search AOO to find items)\n\n**Added:**\n\n* Advanced Forge\n* Resurrection Table\n* Alchemy Table\n* Many Vehicles\n* Lots of Decor! Windows, Doors and Furniture\n* Working Windmill\n\nand other smaller tweaks.\n\n**Alpha 1.3 Released!**\n\n* Oak’s pets now completely integrated (No separate Directory)\n* Many tiny code fixes that probably were not noticeable to most.\n* Garden Hoe recipe added.\n* All New Cloning Chambers!\n* New Pets! Elephant, Penguin, Camel, Cat!\n* New Guard! Pumpkin Man! Burns you enemies alive!\n\n**Alpha 1.21 Released!**\n\nFixed issue with recipes not being unlocked.\n\n**Alpha 1.2 is available!**\n\nFixed Garden Hoe to properly prepare ground to be able plant.\n\n**Alpha 1.1 is out!**\n\n* Fixed up the Skill Tree (Not Completed)\n* Started a new Quest system (Not Completed)\n* Added Farm Crop Plots\n* Added another Gas Oven, pizza oven and more Grills.\n* All you do is craft “Ovens” “Grills” or Smokers and you from their each model is a Variant option.\n* Added a few Descriptions that were missing. (still many missing)\n* Removed Press “E” to pick up a Crop. when harvested this way the crop does not get replanted.\n* Removed a block for an apple tree that is no longer used. (only mattered if you were using creative mode and found that particular tree.)\n\n## Future Plans\n\n* A robust quest progression\n* Decor! There will be a lot of Decorative Blocks eventually added. Emphasis of the mod is to build a beautiful and Functional Farm!\n* A lot More Recipes\n* Many More Animals, more types of meat!\n* Vehicles\n\n**[Download](https://drive.google.com/file/d/1bDVxkE28J9jMc6Q9JihR8GHkr1FjbXIC/view?usp=sharing)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/23943-farm-life-revisited/).\n\n**Credits:** [Pipermac](https://7daystodiemods.com/tag/pipermac/), OakRaven, Arramus, Phredd, Stasis78, Mayic",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/1bDVxkE28J9jMc6Q9JihR8GHkr1FjbXIC/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/23943-farm-life-revisited/",
  "modAuthors": [
    "Pipermac",
    "OakRaven",
    "Arramus",
    "Phredd",
    "Stasis78",
    "Mayic"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die doors",
    "7 days to die farming",
    "7 days to die food",
    "7 days to die recipes",
    "7 days to die vehicles",
    "7 days to die windows",
    "Pipermac"
  ]
}