{
  "modURL": "https://7daystodiemods.com/the-wasteland/",
  "modCreatedTime": "2021-07-14T17:02:00+00:00",
  "modLastUpdatedTime": "2021-07-14T17:05:14+00:00",
  "modName": "The Wasteland",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/08/7-days-to-die-the-wasteland-additional-screenshot-7.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-the-wasteland-additional-screenshot-8.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-the-wasteland-additional-screenshot-9.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-the-wasteland-additional-screenshot-10.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-the-wasteland-additional-screenshot-11.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/08/7-days-to-die-the-wasteland-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/08/7-days-to-die-the-wasteland-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/08/7-days-to-die-the-wasteland-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-the-wasteland-additional-screenshot-4a.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/08/7-days-to-die-the-wasteland-additional-screenshot-5.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/08/7-days-to-die-the-wasteland-additional-screenshot-6.jpg"
  ],
  "modShortDescription": "This is the A19 versions of Nuka Colas and Wasteland Weapons, combined into one mod.",
  "modDescription": "This is the A19 versions of [Nuka Colas](https://7daystodiemods.com/nuka-colas-mod/) and [Wasteland Weapons](https://7daystodiemods.com/wasteland-weapons/), combined into one mod.\n\n## Nuka Colas\n\nTake your pick from the classic Nuka Cola, Nuka Cherry, Nuka Quartz, or the ever rare Nuka Quantum!\n\nEach [drink](https://7daystodiemods.com/tag/7-days-to-die-drinks/) has its own buff. May cause certain side effects…\n\nCan be looted almost any place normal water is found, but is very rare. Also can be available in regular vending machines, so make sure to check every one you find! Will give back a bottlecap when you drink one.\n\nThey can also be placed down as a block, similar to the torch, so you can use their warm, radiated [light](https://7daystodiemods.com/tag/7-days-to-die-lights/) to see your surroundings.\n\nSunset Sarsaparilla has been added. Similar effects and loot locations to Nuka Cola.\n\nThe Nuka Grenade, which can be crafted using Nuka Quantums.\n\nThe Bottlecap Mine, which is crafted from loot only lunchboxes and bottlecaps from Nukas. These lunchboxes can also be placed down and used as storage. Can’t pick them back up though!\n\nNuka Vending Machine, which has a working and broken variant. They are added to the placeholder block, so any POI that uses it has a chance to get one of them instead of the regular machines. Won’t work on existing saves though.\n\nSunset Sarsaparilla Vending Machine, which has a working and broken variant. They are added to the placeholder block, so any POI that uses it has a chance to get one of them instead of the regular machines. Won’t work on existing saves though.\n\n## Raider NPCs\n\nMelee and ranged variants of each. Also a boss variant. High health, high damage resistance. Regular guys drop loot like zombies, at a slightly higher rate. Boss guys have their own loot drop, at a 50% rate. They aren’t perfect, but do well enough to present a challenge. They are mostly used in the new POIs, but they do have a small chance to spawn out in the wild.\n\n## Soldier NPCs\n\nSimilar stats and locations as the Raiders.\n\n## Mutant NPCs\n\nMelee mutants that pack a punch. These can be in a few POIs, or out roaming the land. They can be in hordes as well.\n\n**Modified over 20 POIs to have Raiders, Soldiers, or Mutants instead of zeds.** They are just slightly tweaked vanilla prefabs to make them not stand out. They have similar loot to the vanilla POIs, with a few changes. They are full of enemies usually though, so be prepared. They are almost all quest options, with one a Tier 2, and most of them being Tier 4, with a couple being Tier 5\\. These are a good way to find energy ammo as well.\n\n## Power Armor\n\nThanks to Snufkin, Bdubyah now has Power Armor. Comes in several different paint schemes. Can only be looted form Power Armor Stands located in random POIs, which are only lootable one time each. Repairs with special repair kits. Has unique mods that can be found in loot.\n\nThe mod now also includes the Nuka Factory [prefab](https://7daystodiemods.com/tag/7-days-to-die-prefab/), so you don’t need to use the separate files. You find the Factory, you might be able to learn the recipes! **If you’ve installed the prefab manually before, or have Compopack installed, make sure to delete those files so the modlet version loads!**\n\nThere is also now a Vault 101 POI! Should spawn when generating a new world. Tier 5 quest location.\n\nBdubyah also has included a mutant specific POI by arramus, the Behemoth’s Abode! Should spawn when generating a new world.\n\nThey mostly spawn well in RWG, and Bdubyah has included the info he think is necessary to make them work with NitroGen. Let him know if it isn’t right.\n\n## Melee Weapons\n\nNon-craftable. Found only in loot. Most are fairly weak, and break easily. Most repair with their dominant material, not repair kits. Gets bonuses from corresponding perks(Deep Cuts, Pummel Pete, etc.)\n\n* **Banjo** – Attacks like a light sledgehammer. Play some notes with a power attack!\n* **Baton** – Attacks like a club.\n* **Cleaver** – Attacks like a knife.\n* **Crowbar** – Attacks like a club.\n* **Cuestick** – Attacks like a spear. Power attack is just a stronger thrust.\n* **Nail Board** – Attacks like a sledgehammer.\n* **Pipe Hammer** – Attacks like a club.\n* **Pipe Wrench** – Attacks like a club.\n* **Rebar Club** – Attacks like a slow sledgehammer. Massive stamina usage, but very high damage.\n* **Rolling Pin** – Attacks like a club. Make Grandma proud!\n* **Supa Sledge** – Attacks like a sledgehammer. Keep a good grip on it!\n* **Tire Iron** – Attacks like a club.\n\n## Legendary Melee\n\n* **The Break** – Custom pool cue.\n* **Duke’s Judgement** – Unique Supa Sledge.\n* **Mad Bean’s Club** – Homemade club.\n* **Navezgane Slugger** – Unique baseball bat.\n* **Open Breaker** – Custom made heavy [weapon](https://7daystodiemods.com/tag/7-days-to-die-weapons/).\n\n## Pipe Guns\n\nFairly weak and has a low durability. Affected by appropriate perks.\n\n* **Pipe Pistol** – Simple homemade pistol. Low durability. Regular 9mm only.\n* **Pipe Rifle** – Crude rifle. Starts out as a short barrel. Low durability. Regular 9mm only.\n* **Pipe Shotgun** – Pipes and some bolts. The Shotgun starts as a basic short barrel, single shot version which you can craft into a long barrel version at a workbench. Reload animations for the Shotguns are in, but the hands can’t be fixed AFAIK. Regular shells only.\n\n**The pipe guns will break once they degrade!**\n\n## Current Weapon Mods Available\n\n* **Oil Filter Suppressor** – Usable on the Pipe Pistol and Rifle, and most vanilla weapons. Can be wrenched from cars and in some loot. Big though, and limits ADS effectiveness. Slight loss of range and damage and also adds a small increase to degradation of the weapon due to increased blowback.\n* **Extended Mag** – For the Pipe Pistol and Rifle. Doubles the pistol and rifle capacity, also actually shows on the gun, unlike vanilla. Only works on pipe guns.\n* **Long Barrel** – Versions for both the rifle and shotgun. This adds a longer barrel, increasing effective range. Makes hip fire more unwieldy, and also slightly increase weapon degradation. Works as a mod for the rifle, used as a recipe ingredient for the shotgun.\n* **Cylinder Mag** – Can be used on long or short pipe shotguns. Ups the shell capacity to 4 rounds.\n* **Homemade Flashlight** – Custom attachment for all WW guns, and most vanilla weapons. Simple flashlight and duct tape. Not as effective as the regular weapon light mod.\n\n## Energy Weapons\n\nThese scale with Advanced Engineering.\n\n* **Laser Pistol** – Rare military sidearm. Can be rarely found or crafted once a schematic is read. Accepts all laser attachments except the scope. Uses Energy Cells. [Ammo](https://7daystodiemods.com/tag/7-days-to-die-ammo/) has small chance to cause “Disintegration”.\n* **Laser Shotgun** – Rare military firearm. Can be rarely found or crafted once a schematic is read. Uses Shotgun Microfusion Cells. Ammo has small chance to cause “Disintegration”.\n* **Laser Rifle** – Rare military firearm. Can be rarely found or crafted once a schematic is read. Accepts all laser attachments except the scope. Uses Microfusion Cells. Ammo has small chance to cause “Disintegration”.\n* **Plasma Pistol** – Experimental military weaponry. Can be rarely found or crafted once a schematic is read. Uses Plasma Energy Cells. Ammo has small chance to cause “Disintegration”.\n* **Plasma Rifle** – Experimental military weaponry. Can be rarely found or crafted once a schematic is read. Uses Plasma Microfusion Cells. Ammo has small chance to cause “Disintegration”.\n\n## Laser Weapon Mods\n\n* **Overcharged Capacitor** – Increases damage output as well as magazine size. Slight degradation increase.\n* **Laser Focuser** – Increase damage slightly. Moderate increase to Max Range and Damage Falloff Range. Slight degradation increase.\n* **Laser Splitter** – Increase damage slightly. Fires 2 beams at once. Slight spread when hip firing, but can be accurate when ADS firing. Slight degradation increase.\n* **Laser Scope** – Adds a scope. Only for the Laser Rifle. Slight damage increase. Works well with the Focuser.\n\n## Legendary Guns\n\n* **Silent But Deadly** – Custom pistol. Comes with a silencer. Higher capacity.\n* **Long Distance** – Unique rifle. Has a 4x scope. Higher dismemberment chance.\n* **Firestarter** – Quality homemade shotgun. Single shot. Very high limb dismemberment. Accepts all shells and applies Dragon’s Breath to them.\n* **Lincoln’s Repeater** – .44 Magnum lever action rifle. Able to penetrate multiple targets. High dismemberment. Accepts 8x scopes.\n* **Maria** – 9mm. High capacity. Moderate dismemberment. Accepts a reflex sight.\n* **Pew Pew** – Higher damage and magazine capacity.\n* **AER-15 Prototype** – Unique prototype variant of the laser rifle. Higher damage per beam and shoots 5 rounds in one trigger pull. Hip fire behaves more like a shotgun while aimed fire allows heavy damage to a single target.\n* **Alien Blaster** – Wait, what?\n* **Cryolator** – Custom made weapon that damages and slows enemies. Affected enemies move slower and take more damage. Critical hit freeze enemies. Very rare ammo that can only be looted.\n* **Arizona Campaign Scout Rifle** – Modified Heavy Sniper.\n* **Le Fusil Terribles** – Absolutely terrible shotgun. Don’t use this.\n\nCan be found in certain loot. Also can be a quest reward. Very rare. **Legendary weapons won’t permanently break.**\n\n## Other guns\n\n* **10mm Pistol** – Slightly more powerful than basic 9mm weapons. HP and AP rounds are learned from the same book as 9mm rounds. Schematic or loot only.\n* **10mm Revolver** – Slightly more powerful than basic 9mm weapons. HP and AP rounds are learned from the same book as 9mm rounds. Schematic or loot only.\n* **10mm SMG** – Slightly more powerful than basic 9mm weapons. HP and AP rounds are learned from the same book as 9mm rounds. Schematic or loot only.\n* **Railway Rifle** – If those puny bullets aren’t cutting it, craft this bad boy and show them who’s boss! Schematic or loot only.\n* **FatMan Launcher** – Only available in loot. Launches any mini mukes you come across and maybe something else… Loot only.\n* **Lever Action Rifle** – Old rifle, chambered in .44 Magnum. Crafts with hunting rifle parts. Accepts 8x scopes. Unlocks with the Dead Eye perk, level 3, or schematic.\n* **Triple Barrel Shotgun** – Quality, custom shotgun. Good room clearing weapon. Unlocks with the Boomstick perk, level 3, or schematic.\n* **Combat Shotgun** – Military-grade shotgun. Good room clearing weapon. Schematic or loot only.\n* **Service Rifle** – Old military infantry rifle. Loot only.\n* **Heavy Sniper** – Old 7.62 military rifle. Comes with a scope. High damage, semi-auto. Unlocks with the Dead Eye perk, level 5, or schematic.\n* **Incinerator** – Highly modified military flamethrower. Uses custom ammo. Launches molotov-like projectiles. Schematic or loot only.\n* **Flare Gun** – Survival flare gun. The gun itself it loot only but you can craft more flares.\n\nSchematics are rare loot or a quest reward.\n\n## Explosives\n\n* **Nuka Grenade** – Powerful grenade. Unlocks with the Demolitions Expert perk.\n* **Cryo Grenade** – Powerful grenade. Damages and slows enemies. Unlocks with the Demolitions Expert perk.\n\n## Changelog\n\n**Updated to 2.3 for A19.5**\n\n* Added: Atom Car\n* Added: Old Semi\n* Added: Old Pickup\n* Added: Incinerator mods\n* Added: New T4 POI\n* Changed: Metal box no longer uses loot list that destroys on close\n* Changed: Reverted the NPCs AI so hopefully the ranged ones will attack more consistently\n* Changed: Old Ambulance loot changed to more appropriate one (will take effect on new worlds only he think, maybe unvisited chunks)\n* Fixed: Vault 101 small sleeper error\n* Fixed: Nuka Factory Rad Ghoul sleeper issue\n* Fixed: Scale issue on Rad B Gone and Rad Z drop meshes\n\n**[Download](https://gitlab.com/bdubyah/Mods---A19/-/archive/master/Mods---A19-master.zip?path=The%20Wasteland)** The Wasteland  \n**[Download](https://gitlab.com/bdubyah/Mods---A19/-/archive/master/Mods---A19-master.zip?path=zzz_The_Wasteland_ChikosJPLocalization)** Japanese Localization\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/11875-bdubyahs-modlets/).\n\n**Credits:** [Bdubyah](https://7daystodiemods.com/tag/bdubyah/)",
  "modDownloadURLs": [
    {
      "Info": "The Wasteland",
      "URL": "https://gitlab.com/bdubyah/Mods---A19/-/archive/master/Mods---A19-master.zip?path=The%20Wasteland",
      "Version": "v19"
    },
    {
      "Info": "Japanese Localization",
      "URL": "https://gitlab.com/bdubyah/Mods---A19/-/archive/master/Mods---A19-master.zip?path=zzz_The_Wasteland_ChikosJPLocalization",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/11875-bdubyahs-modlets/",
  "modAuthors": [
    "Bdubyah"
  ],
  "modTags": [
    "7 days to die ammo",
    "7 days to die drinks",
    "7 days to die food",
    "7 days to die lights",
    "7 days to die melee weapons",
    "7 days to die npcs",
    "7 days to die prefab",
    "7 days to die weapons",
    "Bdubyah"
  ]
}