{
  "modURL": "https://7daystodiemods.com/telrics-animal-husbandry/",
  "modCreatedTime": "2021-07-19T20:48:00+00:00",
  "modLastUpdatedTime": "2021-07-19T22:43:01+00:00",
  "modName": "Telric's Animal Husbandry",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/06/7-days-to-die-telrics-animal-husbandry-additional-screenshot.jpg"
  ],
  "modShortDescription": "This mod adds in 36 animals to raise as your own. Find them in the wild, or purchase them from the traders to start raising, breeding, and butchering them for resources.",
  "modDescription": "This mod adds in 36 animals to raise as your own. Find them in the wild, or purchase them from the traders to start raising, breeding, and butchering them for resources.\n\nAnimals have three growth stages: baby, young, and adult. Each animal has it’s own growth rate. Keeping an animal fed will increase this rate, allowing your animals to grow even faster.\n\nUpon growing into an adult, the [animals](https://7daystodiemods.com/tag/7-days-to-die-animals/) will be able to mate, as long as there is a male and a female within a small radius area around each other. Each animal has it’s own mating rate as well. Once the female is pregnant, craft yourself some sterile gloves of that animal species and left click to get your own baby. Place it on the ground to see whether it will be male or female, and start the raising process all over again.\n\nRead the in game journal entries for a few handy notes on how this mod works.\n\nDoes not require restart. Tested and works with Alpha 19.5 b60.\n\n## Changelog\n\nReduced the volume of the gender reveal sound. Fixed bears (they the wrong tag so they couldn’t eat carnivore food). Telric reduced the mating speed a bit, but it will always be random. As each animal has it’s own mating rate, it’s all variable based on the animal, but in the code, it randomly rolls a number between 0 and 200, if there is a male near a female. This happens every second. If that number happens to be below the animal’s mating rate (for instance, the bear has 8 rate), it will trigger being pregnant and allow you to get a baby. What he has done is just increase the timer on that buff from 1 second to 3 seconds, meaning it should happen, in theory, 1/3 less… but of course once an animal is pregnant, it will always be pregnant until you harvest the baby, or leave the area and reset the npc.\n\nSterile gloves are now one time use. He had them not consume because he just didn’t think it would add any form of gameplay to have to craft one each time you want a baby. And he changed the wild animals to be considered animal npcs. The reason they were all marked as regular npcs was to make it so they dont despawn when you leave the chunk / area for a while. He know for a fact zombies do this, and he’s pretty sure animals do as well. But npcs never have disappeared once spawned. Also he lowered the chance of animals spawning a bit.\n\n**This is a single player only mod. It will not work in multiplayer and there will be no support when attempted this way.**\n\n**[Download](https://www.dropbox.com/s/hmuh4xzi4u3zdzv/TelricsHusbandryA19.zip?dl=1)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/19976-telrics-a19-modlets/).\n\n**Credits:** [Telric](https://7daystodiemods.com/tag/telric/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://www.dropbox.com/s/hmuh4xzi4u3zdzv/TelricsHusbandryA19.zip?dl=1",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/19976-telrics-a19-modlets/",
  "modAuthors": [
    "Telric"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die farming",
    "Telric"
  ]
}