{
  "modURL": "https://7daystodiemods.com/mining-mod-with-copper-zinc-and-excavators/",
  "modCreatedTime": "2021-07-20T20:52:00+00:00",
  "modLastUpdatedTime": "2021-07-20T22:55:49+00:00",
  "modName": "Mining Mod With Copper, Zinc & Excavators",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/06/7-days-to-die-mining-mod-with-copper-zinc-and-excavators-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/06/7-days-to-die-mining-mod-with-copper-zinc-and-excavators-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/06/7-days-to-die-mining-mod-with-copper-zinc-and-excavators-additional-screenshot-3.jpg"
  ],
  "modShortDescription": "Added automated mining excavators that will automatically produce a variety of raw ores, stones, and even asphalt, gravel, bones, soil, and glass.",
  "modDescription": "You’ve seen it before: copper and zinc together to make brass! What MeanCloud has done here is extended support for ore-laden sub-biomes by adding copper and zinc metal boulders and vein generation to the random world generator. You can smelt these materials together to make brass directly in the forge. Additionally, he added automated mining excavators (inspiration and permission from stallionsden’s mod) that will automatically produce a variety of raw ores, stones, and even asphalt, gravel, bones, soil, and glass. But the cost to make them is steep.\n\nAfter retrieving raw ores, you can use the new rock crusher machine to crush them up for you into usable resources. Finally, lots of effort has been made to add copper and zinc as salvageable metals throughout the game from appliances to metal piping as well as automotive pieces and chain-link fences. This mod gives you plenty of options for finding new ways to get brass for all your munitions needs, not to mention all the other ores at a reasonable pace.\n\n## Using This Mod\n\nTo get started mining, MeanCloud highly recommend you create a new random world. If you try to install this mod in an existing game, the new copper and zinc ores and veins will not be generated. You will still find copper and zinc while salvaging and scavenging, but you will not find it while mining unless you create a new random world (see notes further down in this post). Once you’ve found some copper or zinc to mine (or have otherwise looted some), take it to the forge and you’ll find that it now accepts the additional metals which can be smelted down into scrap brass or forged directly into bullet casings. Note that you still need the relevant perk to craft bullet casings and the crucible to pour brass back out of the forge as normal.\n\nThis mod also adds excavators, which are automated mining machines that will drill into the ground and resurface with materials every so often. While they are expensive to make, they will surely make up for their cost in the materials they mine up. Most of the mined ore must be processed by a rock crusher, which this mod also adds. The rock crusher is a new workbench (it looks like a cement mixer once placed) that uses ore blocks and sand to crush the usable materials out of the ore.\n\nExcavators will go through various stages as they mine through the ground:\n\n**Want More?**\n\nTry his [Regenerating Boulders](https://7daystodiemods.com/regenerating-boulders/) mod that lets ore boulders regenerate. There’s a subversion of that mod that works for these copper & zinc ore boulders.\n\n## Important Notes\n\nImportant notes you should read:\n\n### Note for Multiplayer\n\nThe current version of Alpha 19 does not push localization data to users. If you are playing multiplayer (either hosting or via dedicated server), each player will need to install the mining mod themselves to get the proper descriptions of items, blocks, UI labels, etc. that this mod changes.\n\n### Note About World Generation\n\nThis mod adds ore generation in the form of sub-biomes for copper and zinc metal boulders and ore veins. If you do not generate a new world, these boulders and veins will be absent (but you can still definitely acquire copper and vein materials by salvaging and scavenging during normal gameplay). He would recommend that you start a new game if you intend to use this mod.\n\nAdditionally, He is not a graphic artist and did not design 3D models for the copper and zinc metal boulders, so He is re-using the game’s assets for the lead boulder and potassium nitrate boulder. There’s no way to tint 3D entities, so they will unfortunately look exactly like their counterparts as you encounter them in the world. Sorry about that, if you are a graphic designer who knows how to add assets to bundles and you’d like to donate some of your time to provide assets to this mod, He will be more than happy to chat with you about that and give you credit if he use your assets.\n\n### Note About the Forge Changes\n\nIf you are adding this mod to an existing game, please be aware that your existing forges will have all contents erased except for fuel and anything that was queued. This is because this mod is adding extra input materials (copper and zinc) and the 7 Days to Die game engine does not gracefully handle this kind of change. Make sure you’re okay with all players losing forge contents the first time this mod is installed into an existing game world.\n\n### Note About Mod Compatibility\n\nThis mod is not compatible with stallionsden’s [Rain Catcher and Mining Machine](https://7daystodiemods.com/rain-catcher-and-mining-machine/) mod. This mod intentionally uses some of the same block names and lootcontainer IDs to discourage players from attempting to use both mods at once.\n\nAdditionally, this mod is not compatible with the S420’s [Simple UI Forge Input](https://7daystodiemods.com/simple-ui-mods/) mod that changes forges to have three inputs. This mod already includes forges with three inputs anyway, but S420’s overwrites what resources are accepted by the forge, causing errors to be logged to the console since this mod requires copper and zinc to be accepted by the forge.\n\nNeither is this mod compatible with many mods that reskin the forge at all.\n\n### Errors on Startup\n\nIf you fail to install the prefabs correctly, 7 Days to Die will log errors in the console window. You need to install the prefabs to the correct location, even if you aren’t generating a new world or are playing on a dedicated server.\n\n## Changelog\n\n* **_(new)_** Official mod updated to A19.\n* Bugfixes for some git issues.\n* Updated for A19 by Doughphunghus.\n* The existing 3D models for the copper and zinc boulders have been tweaked.\n* A new 3D model has been added for the rock crusher workstation\n* Bullet casings now craft faster (1s per casing)\n\n## How to Setup\n\nDownload and extract this mod to your 7 Days to Die **/Mods** folder.\n\nFor Steam users, that’s **\\\\steamapps\\\\common\\\\7 Days To Die\\\\Mods** (create ‘Mods’ if it doesn’t exist).\n\nOnce extracted, move the files in the mod’s **/Prefabs** folder to your 7 Days to Die **/Data/Prefabs** folder.\n\nFor Steam users, that’s **\\\\steamapps\\\\common\\\\7 Days To Die\\\\Data\\\\Prefabs** (‘Prefabs’ will already exist; if you can’t find it, you’re in the wrong place).\n\n**[Download](https://damned.cloud/files/MeanCloud__Mining_v1.05.zip)** for A19  \n**[Download](https://damned.cloud/files/MeanCloud__Mining_v1.04.zip)** for A18\n\nIf you appreciate MeanCloud’s work and you want to show support, use this [donate link](https://paypal.me/MeanCloud).\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/15288-meanclouds-mining-modlet-with-copper-zinc-and-excavators/).\n\n**Credits:** [MeanCloud](https://7daystodiemods.com/tag/meancloud/)",
  "modDownloadURLs": [
    {
      "Info": "for A19",
      "URL": "https://damned.cloud/files/MeanCloud__Mining_v1.05.zip",
      "Version": "v19"
    },
    {
      "Info": "for A18",
      "URL": "https://damned.cloud/files/MeanCloud__Mining_v1.04.zip",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/15288-meanclouds-mining-modlet-with-copper-zinc-and-excavators/",
  "modAuthors": [
    "MeanCloud"
  ],
  "modTags": [
    "7 days to die mining",
    "MeanCloud"
  ]
}