{
  "modURL": "https://7daystodiemods.com/the-spencer-mansion-incident-challenge-mode/",
  "modCreatedTime": "2021-03-29T01:28:00+00:00",
  "modLastUpdatedTime": "2021-07-22T21:52:07+00:00",
  "modName": "The Spencer Mansion Incident (Challenge Mode)",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/03/7dtd-the-spencer-mansion-incident-challenge-mode-additional-screenshot.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/03/7-days-to-die-the-spencer-mansion-incident-challenge-mode-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/03/7-days-to-die-the-spencer-mansion-incident-challenge-mode-additional-screenshot-2.jpg"
  ],
  "modShortDescription": "Are you a Resident Evil fan? Are you up for a challenge? Welcome to Resident Evil, where it all began!",
  "modDescription": "Are you a Resident Evil fan? Are you up for a challenge? Welcome to Resident Evil, where it all began!\n\nFranticDan started building the Spencer Mansion back in August 2017 (Alpha 16.2), he has been working on this passion project of his for 3 and a half years now. He is very pleased with the final build and would love to share it with the 7 Days to Die community, so that you may all enjoy a very unique 7 Days experience.\n\nThis is a replica of the Spencer Mansion as close to a 1:1 scale within the limitations of the game, using only vanilla assets.\n\nThe goal of the challenge is to build a Gyrocopter and use it to fly to the trader, talking to the trader will complete the challenge.\n\nBut of course there are rules!\n\n**Any of the following will automatically lose the challenge:**\n\n1. Dying.\n2. Going outside the boundary of the [mansion](https://7daystodiemods.com/tag/7-days-to-die-prefab/) on foot. (there’s a visible boundary don’t worry, and there’s nothing out there anyway)\n3. Using any console commands. (only exception is for performance improvements)\n4. Editing any of the files.\n5. Using any mods. (with the exception of localization)\n6. Playing with any amount of day time period.\n7. Playing with more than 125% XP and/or more than 134% Loot.\n\n**Optional extra challenges for those super fans (Feel free to record your gameplay for boasting):**\n\n1. **Knife Only:** Finish the game with only using either the Survival Knife or Combat Knife. Machete doesn’t count.\n2. **Untouchable:** Finish the game without ever taking any damage from any sources.\n3. **Speed Run:** Finish the game as fast as possible. (Some potential competition for people)\n4. **Poisoned:** Upon starting a new game, use the console command “buff buffpoisoned” (without quotations, this is an exemption to the console command rule) and finish the game without ever curing your poison.\n\n**Default Settings:**\n\n**Make sure Friendly Fire is turned on in the Multiplayer tab.**\n\n## Special Thanks\n\n* JaxTeller718 – For getting him into modding.\n* KhaineGB – For helping him with the doors.\n* Khelldon – For the main menu mod.\n* chikorina – For the Japanese Translation, Red and Blue herb models, and investing time to help him.\n* HaidrGna – For helping him with the duplicate toolbelt.\n\n## In-Game Map of the Mansion (Spoilers)\n\n**First Floor:**\n\n**Second Floor:**\n\n## Changelog\n\n**Hotfix v1.13c**\n\nChanged – Swapped Feral Hawaiian model back to the old one. (This fixes the broken AI)\n\n**Hotfix v1.13b**\n\nChanged – Swapped Hawaiian model back to the old one. (This fixes the broken AI)\n\n**Hotfix v1.13a**\n\n* Fixed – Newbie defence buff didn’t work as intended.\n* Changed – Newbie defence buff now mitigates 15% damage.\n\n**v1.13**\n\n* Fixed – some crawlers got stuck in doorways.\n* Fixed – Leather armour pieces can now be scrapped.\n* Removed – Mega crush from vending machine.\n* Added – Mega crush recipe.\n* Added – Newbie coat provides a 10% less stamina drain and boosts Armour by 10 until level 6.\n* Added – Botany book now teaches you how to craft first aid bandages, takes 15 minutes to research.\n* Changed – Rebalanced mega crush buff and duration.\n* Changed – Top row of inventory is a copy of the toolbelt, newly obtained items will NOT go into your toolbelt, unfortunately.\n* Changed – Nerfed bears Health, damage and XP by 25%.\n* Changed – Rebalanced quantity of brass and dukes.\n* Changed – Molotovs need less gas to craft.\n* Changed – You now start with the XP bar half filled.\n\n**v1.12**\n\nRequires a new game!\n\n* Added Assault Shotgun\n* Added crawler variety\n* Stumps always give honey now\n* Lowered health of dead animals by half\n* Increased gamestage needed for iron age to 20\n* Buffed heavy armour perk to 10% per rank\n* Removed 34% and 67% loot abundance\n* Gave flashlight extra dismember chance +1% normal and +2% power\n* Increased combat knife block damage by 50%\n* Removed starting with lockpick, food and drink\n* Moved lockpick, food and drink to the east safe room\n* Lowered ammo stack size to 5 reloads worth (7.62 stacks to 60)\n* Lowered ammo bulk crafting size to 30\n* Removed most vanilla journal entries\n* Added 7 written notes as journal entries\n* New recipe, First Aid Kit can be crafted into 3 First Aid Bandages\n* Increase damage bonus from mods to 16.7%\n* Lowered HP of jail doors to 15k for easier wrenching\n* Insulation and armour plating mods can go onto clothing\n* Increased damage bonus from perks to 17% per rank\n* Lowered ranks of combat perks to 3\n* Destroyed forge must be repaired, gives 45 bullet tips when looted\n\nAND MUCH MORE!\n\n**v1.11a Through to v1.11d**\n\n* Fixed – Some localisation text.\n* Fixed – Red Herb and Blue Herb seeds couldn’t be unlocked.\n* Fixed – More localisation\n* Changed – Slightly increased damage of knives and bullets so that when playing on A, S and S+ difficulty, the final damage inflicted is rounded up 1 more damage.\n* Fixed – Mixing Green and Blue herbs was imbalanced, requiring 2 Green Herbs instead of 1.\n* Fixed – Rebalanced the healing amount of Blue Herb Cream and Green+Blue Herb Cream.\n\n**v1.11**\n\nRequires a new game!\n\n* Added – Red Herbs and Blue herbs and all Herb mixing recipes.\n* Added – Anti-venom First Aid Bandage.\n* Added – Poisoned debuff. Snakes and Spider Zombies inflict poison.\n* Added – New enemies. You can find out what they are for yourself.\n* Removed – Infiltrator and Hardcore Parkour perks.\n* Removed – 2 Grenades and 1 Rocket ammo.\n* Removed – Nightvision goggles\n* Changed – Wrench now benefits from Miner 69’er.\n* Changed – Healing items heal a little more.\n* Changed – Lowered the stack sizes of medical items.\n* Changed – Lowered the stack sizes of Throwables and Rocket Frags.\n* Changed – Rebalanced medical loot\n* Changed – Looted Rifles come with 5 rounds of 762 and Machine guns come with 10 rounds of 762.\n* Changed – 762 ammo requires less gunpowder to craft.\n* Changed – Increased required Gamestage for Iron age to 15.\n* Changed – Coffee and Fortbites have a longer duration.\n\nAND MUCH MORE!\n\n**v1.10**\n\n* Does not require a new game:  \n   * More Japanese translations.  \n   * You can now pick up your traps and electrical blocks with a wrench.  \n   * Handgun and Combat Knife are now black by default.  \n   * Removed schematic unlock listing on gyrocopter parts to remove false hope of finding the schematic.\n* Requires a new game:  \n   * Made it more clear on where to place the ladder in the library.  \n   * Reduced HP on non-gamestaged shipping crates to 75HP for easier access.  \n   * Workbench must be repaired with a claw hammer and 25 repair kits, repair kits are dropped by Tyrant.\n\n**v1.09**\n\n* Reduced food and water drain when you are level 1 through 5 to almost zero.\n* Translated new text to Japanese.\n* Fixed the possibility of the second last quest to bug out and become impossible to complete.\n* Moved the World and Prefabs into the mod folder, for easier installation. (Thanks Chikorina) You must update!\n* Added two new rules: Loot abundance above 134% and XP above 125% also loses the challenge.\n\n**v1.08**\n\nRequires a new game!\n\n* Added a guaranteed Engine.\n* Lowered XP needed to level.\n* Harvesting materials gives triple XP.\n* Learning Elixir is unlocked and uses oil instead of acid to craft.\n* Reduced craft time of Steel, Crucible, Gyrocopter parts and Can of Sham.\n* Crucible needs less clay and stone to craft.\n* Oil is cheaper and faster to craft.\n* Advanced Engineering Rank 5 now needs Intellect 9 instead of 10.\n* Collecting full Gyrocopter gives you forgetting elixir.\n* Tyrant drops learning elixir and blessed metal mod.\n* Tyrant no longer inflicts critical injuries.\n* Extended the Escape phase slightly.\n* Added fat to bacon and eggs recipe, +4 food +2 health.\n* Removed some ammo.\n* Nerfed Fortifying Grip.\n\n**v1.07**\n\nRemoved – Death penalty not working as intended\n\n**v1.06**\n\nYou do not need a new game, you can continue existing playthroughs.\n\n* Lowered Bird Nest respawn time to 7 real hours (Was 15).\n* Shipping crates give more loot.\n* Broken glass can no longer be eaten.\n* Some cooked meals are cheaper to craft.\n* Seeds are cheaper to craft.\n* Fixed the flooding leaking into the back of the kitchen. (Hopefully)\n* Playing a game with day time is now dangerous (Set your game to always be night, change daylight length between -1 and 0 a couple of times)\n* Added a death penalty to reinforce that dying loses the challenge.\n* Crucible can now be scrapped for 15 mechanical parts.\n* Gyrocopter Chassis needs 10 less mechanical parts to craft.\n* Lowered the health of the hardened chest to 10,000 so it can be harvested for mechanical parts.\n\n**v1.05**\n\n* Changed – Japanese sign now have Japanese characters.\n* Added – Super Goggles. All attributes except strength +1, Loot bonus +10, XP +30%, Craft time -20%. (dropped by Tyrant)\n* Changed – Increased Wrench speed by 50% and lowered stamina cost by 33%.\n* Changed – Increased chance to harvest acid from barrels and medical cabinets after reading the wasteland treasure book.\n\n**v1.04**\n\nMake a backup of your save first, there’s a small chance of your character resetting to level 1! Your save can be found here: **C:\\\\Users\\\\your PC name\\\\AppData\\\\Roaming\\\\7DaysToDie\\\\Saves**\n\n* Removed – Lucky Goggles, they give 0 loot bonus. (Sorry, they broke progression)\n* Added – Signs in Japanese. (Requires a new game)\n* Changed – Lowered required attributes for Master Chef, Living off the Land and Iron Gut.\n* Changed – Made some secrets easier to see. (Requires a new game)\n* Removed – Most old cash from loot, increased amount of dukes in loot.\n\n**v1.03**\n\n* Added – Hops farming and 4 extra farm plots. (requires new game)\n* Changed – Planted seeds are now at ready to harvest stage plus seed. (requires new game)\n* Changed – Lowered cost of mechanical parts, electrical parts and springs in various recipes.\n* Changed – Grenades use an electrical part instead of mechanical, and removed spring.\n* Removed – 10 – 50 minute day lengths, Added 105 and 120 minute day lengths.\n* Fixed – Potted plants can be scrapped and smelted\n* Added/fixed – New descriptions and fixed spelling mistakes for Japanese translation\n\n**v1.02**\n\n* Fixed – An oversight where the Sword Key gave you the Handgun instead.\n* Changed – Wolf and Zombie Dog speed lowered so Knife Only playthroughs are more manageable.Added – Japanese Translation\n\n**v1.01**\n\n* Fixed – Playing with 34% and 67% loot abundance made it very likely impossible to get the Pump Shotgun, Rocket Launcher, Magnum Revolver, Grenades and Rocket Launcher ammo.\n* Changed – Lowered Scrap Iron cost for crafting Scrap Armour pieces from 60 to 40.\n\n## How to Install (If Not Using Mod Launcher)\n\n1. Make a fresh copy of the vanilla game folder (A19.3 or A19.4), rename the copy to something like ‘7 Days to Die Spencer Mansion Incident’.\n2. Extract the Data and Mods folders to the new copy you’ve just created. Example location **C:\\\\Steam Games\\\\Survival\\\\7 Days To Die Spencer Mansion Incident**\n\n**Please Read:** When playing the mod for the first time or when playing it again after playing another mod/vanilla, you’ll have to change all of the settings at least once so the game recognizes the new settings. If you don’t, you could be playing with 200% Loot, 300% XP, et cetera, unintentionally. More importantly, you want to avoid playing with any day time. **You WILL NOT have a good time if you have day time.** So be sure to change your settings before playing. **When making a game, be sure to select ‘Spencer Mansion Incident’ as your world name.**\n\n**[Download](https://github.com/Frantic-Dan/Standard-The-Spencer-Mansion-Incident/archive/refs/heads/main.zip)** Standard Install  \n**[Download](https://github.com/Frantic-Dan/Creator-The-Spencer-Mansion-Incident/archive/refs/heads/main.zip)** Content Creator Install  \nAlso available on the mod launcher!\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/23270-the-spencer-mansion-incident-challenge-mode/).\n\n**Credits:** [FranticDan](https://7daystodiemods.com/tag/franticdan/)",
  "modDownloadURLs": [
    {
      "Info": "Standard Install",
      "URL": "https://github.com/Frantic-Dan/Standard-The-Spencer-Mansion-Incident/archive/refs/heads/main.zip",
      "Version": "v19"
    },
    {
      "Info": "Content Creator Install",
      "URL": "https://github.com/Frantic-Dan/Creator-The-Spencer-Mansion-Incident/archive/refs/heads/main.zip",
      "Version": "v19"
    },
    {
      "Info": "Also available on the mod launcher!",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/23270-the-spencer-mansion-incident-challenge-mode/",
  "modAuthors": [
    "FranticDan"
  ],
  "modTags": [
    "7 days to die prefab",
    "7 days to die quests",
    "FranticDan"
  ]
}