{
  "modURL": "https://7daystodiemods.com/fishing-mod-by-meancloud/",
  "modCreatedTime": "2021-07-22T23:37:00+00:00",
  "modLastUpdatedTime": "2021-07-23T08:13:30+00:00",
  "modName": "Fishing Mod by MeanCloud",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2019/11/7-days-to-die-fishing-mod-by-meancloud-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2019/11/7-days-to-die-fishing-mod-by-meancloud-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2019/11/7-days-to-die-fishing-mod-by-meancloud-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2019/11/7-days-to-die-fishing-mod-by-meancloud-additional-screenshot-4.jpg"
  ],
  "modShortDescription": "This mod adds additional features such as more cooking recipes, multiple manual and automatic fishing tools, schematics/recipe unlocks etc.",
  "modDescription": "MeanCloud spent some time developing a fishing mod of his own since he couldn’t get any of the older ones pre-A18 to work. This mod is inspired by Clockwork Orange’s ACP Fishing mod and he’d like to give him credit. This version adds additional features such as more cooking recipes, multiple manual and automatic fishing tools, schematics/recipe unlocks, perk progressions, etc.\n\n## Using This Mod\n\nTo get started fishing, look for a fishing spear you can craft. You can make this tool without any unlocks. Find some natural water (bucketed water intentionally won’t work) and left-click to start [fishing](https://7daystodiemods.com/tag/7-days-to-die-fishing/). When you think you’ve caught something, right-click your tool to gain a fishing cache that you can then place down and destroy to see what you found. For fishing rods, the cache will be attached to your pole automatically when you right-click and then you can right-click some ground to place it.\n\nBetter [tools](https://7daystodiemods.com/tag/7-days-to-die-tools/) are unlocked by looted schematics and the perk system (you can do either depending on your luck). Fishing rods and fishing traps will catch more fish and a variety of other debris that may be in your lakes and rivers.\n\n[Fish](https://7daystodiemods.com/tag/7-days-to-die-animals/) can be eaten raw like raw meat and also cooked and prepared in a variety of ways. The game has a button that shows all recipes an item can be crafted into (including cooking), so have fun exploring.\n\nTo place fishing [traps](https://7daystodiemods.com/tag/7-days-to-die-traps/), you must be standing in water and right-click the trap on dry land. The game considers the first block or two of shoreline to still be under water if your water quality video setting is set to High, so you may need to look around until you find a spot that lets you place the trap down. Traps can take take up to an hour (real time) to catch stuff. Once they have, they won’t catch anything more until you loot them, so keep an eye on your traps.\n\nIf you’re looking for recipes and schematics, look anywhere tool schematics (for fishing rods and traps) or [food](https://7daystodiemods.com/tag/7-days-to-die-food/) schematics (for recipes) are generally found.\n\nFor tools, that includes car parts shipping crates, hidden stash cardboard loot, hero loot crates, loot bags from enemies, junk/garbage piles (including trash cans and dumpsters), destroyed lab equipment, various safes (brewery, Shamway, etc.), traders and some quests.\n\nFor food recipes, try looking for buried treasure map treasure, mailboxes, filing cabinets, kitchen sinks, cupboards, and other kitchen containers (and of course, traders).\n\n## Note For Multiplayer\n\nThe current version of Alpha 19 does not push localization data to users. If you are playing multiplayer (either hosting or via dedicated server), each player will need to install the fishing mod themselves to get the proper descriptions of items, buffs, perks, etc. that this mod changes.\n\n## How to Install\n\nDownload and extract this mod to your 7 Days to Die Mods folder.\n\nFor Steam users, that’s **steamapps\\\\common\\\\7 Days To Die\\\\Mods** (create ‘Mods’ if it doesn’t exist).\n\n## Changelog\n\n* **Mod updated to v1.05 (Official Update):** Support for A19 and active fishing (mash F to reel in your catch!) _Special Thanks: Telric (for his fishing pole Unity asset)_\n* Updated for A19 by Doughphunghus & mr.devolver.\n\n**[Download](https://damned.cloud/files/MeanCloud__Fishing_v1.05.zip)** for A19  \n**[Download](https://damned.cloud/files/MeanCloud__FishingA18_v1.04.zip)** for A18\n\nIf you appreciate MeanCloud’s work and you want to show support, use this [donate link](https://paypal.me/MeanCloud).\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/14889-meanclouds-fishing/).\n\n**Credits:** [MeanCloud](https://7daystodiemods.com/tag/meancloud/)",
  "modDownloadURLs": [
    {
      "Info": "for A19",
      "URL": "https://damned.cloud/files/MeanCloud__Fishing_v1.05.zip",
      "Version": "v19"
    },
    {
      "Info": "for A18",
      "URL": "https://damned.cloud/files/MeanCloud__FishingA18_v1.04.zip",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/14889-meanclouds-fishing/",
  "modAuthors": [
    "MeanCloud"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die fishing",
    "7 days to die food",
    "7 days to die tools",
    "7 days to die traps",
    "MeanCloud"
  ]
}