{
  "modURL": "https://7daystodiemods.com/poison-removal-mod/",
  "modCreatedTime": "2020-07-06T13:26:00+00:00",
  "modLastUpdatedTime": "2021-07-25T02:33:23+00:00",
  "modName": "Poison Removal Mod",
  "modImages": [],
  "modShortDescription": "The Weber 9000 - bbq work station. Activated Carbon - ingredient used to remove the poison from otherwise contaminated food.",
  "modDescription": "So you got poisoned huh… Should a invested in The Weber 9000\\. This beauty takes the poison chance out of properly looked after foods like meat. This beauty does nearly it all bah wash up and kill the zombies… Note: Thats your job Dumb (wise words of Glen season 1 The Walking Dead)\n\nBut wait there is more… Still not satisfied, Make The Weber 9000 and you will be the talk of the town and visitors will show up from all over…\n\nStill wanting more. Build today and we will throw in nothing for free. Thats right you heard correctly Nothing for free. You save 100s\n\nBut wait again there is still more. The Weber 9000 brings with it new ingredients, new post apocolypse assistance and the state of the art and world class menus.\n\nBut wait there is still more. Well to bad thats it lol…\n\nSo what are you still doing here. Go build that Weber 9000 and make your neighbours jealous, visitors so envious they would kill to have one themselves. You still here. This offer wont last long you better get your butt into gear…\n\n**Adds:**\n\n* The Weber 9000 – bbq work station\n* Activated Carbon – ingredient used to remove the poison from otherwise contaminated food (if unsealed food used small chance of poisoning may occur)\n* Combines Valmars Sealed meats modlet – This is the only way to get 100% poison free food guaranteed.\n* Use The Weber 9000 with out the activated Carbons and you have a small 6% chance of still being poisoned.\n* Eat food you just killed you gonna die – Poison chance is 75%\n* Remember to seal your – Raw Meat, Animal Fat, Sham Sandwiches and Rotten Flesh for 100% poison free eating experience.\n\n**Disclaimer**\n\n* No refunds (at all).\n* TFP or myself are not ever held liable for any bad cooks out there or faults in The Weber 9000 no matter if it were a production fault.\n* Not recommended use by Zombies, animals or birds. No seriously they cant cook.\n* All products, foods and/or ingredients required are for you to collect and at all no responsibility of the creators of The Weber 9000.\n\n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/stallionsden/stallionsmodlets/tree/main/Stallionsdens%20Poison%20Removal)**\n\nIf you appreciate Stallionsden’s work and you want to show support, use this [donate link](http://paypal.me/AnthonyCar78).\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/19911-stallionsdens-and-valmars-a19-mod-thread/).\n\n**Credits:** [Stallionsden](https://7daystodiemods.com/tag/stallionsden/)  \n_Additional Credits:_ Valmar, StompyNZ, Rewtgr, SphereII and KhaineGB.",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/stallionsden/stallionsmodlets/tree/main/Stallionsdens%20Poison%20Removal",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/19911-stallionsdens-and-valmars-a19-mod-thread/",
  "modAuthors": [
    "StallionsdenAdditional Credits: Valmar",
    "StompyNZ",
    "Rewtgr",
    "SphereII and KhaineGB."
  ],
  "modTags": [
    "7 days to die food",
    "Stallionsden"
  ]
}