{
  "modURL": "https://7daystodiemods.com/shop-keeping-mod/",
  "modCreatedTime": "2020-07-26T10:19:00+00:00",
  "modLastUpdatedTime": "2021-07-25T02:34:40+00:00",
  "modName": "Shop Keeping Mod",
  "modImages": [],
  "modShortDescription": "Adds shop containers to the 7 Days to Die so a player can set up a shop and sell stuff to other players. You can set your own asking price as well.",
  "modDescription": "This is more a multiplayer mod.\n\nAdds shop containers to the 7 Days to Die so a player can set up a shop and sell stuff to other players. You can set your own asking price as well.\n\nThats right you can run your very own shop right here in the apocalypse. Who said you making money had to stop because the world ended.\n\nAs the shop keeper you are set to keep the shop supplied of stock. Players can buy items from you.\n\nA player can craft certain shop containers to suit their business type they want to run.\n\nWant to run a weapons and ammo store, you can make all the weapon shop containers and set the shop up how you like.\n\nWant a coffee shop go for it set up your own coffee shop.\n\nA brewery, well you can do that to.\n\nYou can even be a jack of all trades and set up shop with everything in it.\n\n## Roleplay\n\nGreat roleplay if you like. players can also request stuff from you if you so wish to go out and hunt for it, you can create stuff for another player of what they request and you can then set your price for it.\n\n## Limitations\n\nAll shop containers are found under shop.\n\nDue to the vending machine code to change the name of the vending machine being in the DLL and hard coded names will all be generic when you have placed the container down and even searching for shop containers in CM menu even tho you have put shop in and you scroll your mouse over it will come up with vending machine.\n\nSimply create some player made signs and display it above the container to let others know what container it is.\n\n## Changelog\n\n* **Added**  \n   * New Business types – Lanscaping, Mortician, Gym, Librarian, Mechanic, Clothing Stores etc  \n   * New shop Pieces added\n* **Fixed**  \n   * Fixed the creative menu names of all shop Pieces, So when you grab it from creative Menu or build it, the actual name of the shop piece appears.\n\nHowever, unfortunately when you approach the shop piece after placing it still shows like the vending machine – interact with vending machine. It is unfortunately Hardcoded. But just use the player made signs to name them for now and hope the tfp gods allow us to change it via xml.\n\n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/stallionsden/stallionsmodlets/tree/main/stallionsdens%20Shop%20Keeping)**\n\nIf you appreciate Stallionsden’s work and you want to show support, use this [donate link](http://paypal.me/AnthonyCar78).\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/19911-stallionsdens-and-valmars-a19-mod-thread/).\n\n**Credits:** [Stallionsden](https://7daystodiemods.com/tag/stallionsden/)  \n_Special Thanks:_ Spectral Force, JaxTeller718, Ghostreaver",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/stallionsden/stallionsmodlets/tree/main/stallionsdens%20Shop%20Keeping",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/19911-stallionsdens-and-valmars-a19-mod-thread/",
  "modAuthors": [
    "StallionsdenSpecial Thanks: Spectral Force",
    "JaxTeller718",
    "Ghostreaver"
  ],
  "modTags": [
    "7 days to die trader",
    "Stallionsden"
  ]
}