{
  "modURL": "https://7daystodiemods.com/vehicle-madness/",
  "modCreatedTime": "2021-02-10T00:32:00+00:00",
  "modLastUpdatedTime": "2021-07-25T18:22:25+00:00",
  "modName": "Vehicle Madness",
  "modImages": [],
  "modShortDescription": "Guppycur's awesome original concept for Vehicle Madness returns to 7 Days to Die in A19. You will come across a variety of vehicles in the world.",
  "modDescription": "Guppycur’s awesome original concept for Vehicle Madness way back in A17 returns to 7 Days to Die in A19, Guppy handed over the reigns of the project to Ragsy to rework and develop further the visions they have for vehicles in the game. This is a ongoing project and Ragsy is glad to say that ActiniumTiger and Marcus have actively joined the ‘pit crew’ and have already done some great work with the mod as well as bringing along some good ideas into the mix that they are looking to implement in the next versions.\n\n* Features currently 26 vehicles (all with overhauled unity vehicle physics and updated to linear colorspace).\n* Revamped the vehicle harvesting system (Balancing feedback required).\n* Updated the custom [vehicles](https://7daystodiemods.com/tag/7-days-to-die-vehicles/) build system.\n* A brand new custom vehicle spawner, so no more double or triple spawned vehicles and vehicle piles. (Custom code was written by HaidrGna and adapted it for Vehicle Madness with his kind permission)\n* Added more vehicles to the craftable options for now.\n\n## About Vehicle Madness\n\nFor those that have not played the mod before… This mod will not let you build the ‘custom vehicles’ in the vanilla style… however you can still build vanilla vehicles in the usual way as all vanilla parts are still available in world. You will come across a variety of vehicles in the world, from firetrucks to humvee’s to police [cars](https://7daystodiemods.com/tag/7-days-to-die-car-mods/) to sedans and a few old rusted vehicles. You can only hope they are running. if not, you’ll be forced to loot them to find salvageable parts, such as:\n\n* Transmission (and damaged version)\n* Engine (and damaged version)\n* Seats (and damaged versions)\n* Carburetor (and damaged version)\n* Battery (and damaged version)\n* Alternator (and damaged version)\n* Chassis (and damaged version)\n* Body parts (doors, hood, trunk and Fender and bumper)\n* Full Vehicle Madness Style Wheels\n* Wheel Rims\n\nThey have adopted a system where 2x Damaged Parts go towards making 1 good working part along with other smaller items in the recipes.\n\nTires that you find on the ground? They can be picked up! But, they are not wheels. You must find a wheel rim, these can be obtained by salvaging the vehicles in the world (you may be lucky and get full wheels and a wheel rim during salvage), or you can make a fully functional wheel by adding tire and wheel rim and using the air compressor tool in the Auto-Workbench. To make the Auto-workbench you need to first be able to craft ‘normal workbenches’ as you will need one to build the full Auto-workbench along with a compressor an ratchet set (lootable in world)… you can then, after learning how, assemble the various vehicle parts into the various assemblies to build your custom vehicle.\n\n* Car body assembly (requires a fully body kit)\n* Electrical subsystem assembly\n* Car engine assembly\n* Car Body Kit\n* Vehicle Madness wheel set\n\nThen Build your chosen custom vehicle from the selection available. **Vanilla vehicles can be crafted using the existing parts as before on a normal workbench so they have left in vanilla items to maintain vanilla compatibility for other vehicle mods that use vanillla resources, vanilla parts will not fit the custom vehicles system build methods.**\n\nYou can only use the cool stuff like firetrucks, police car, military car and 5 ton military [truck](https://7daystodiemods.com/tag/7-days-to-die-truck-mods/) by finding driveable versions!\n\nGas will be at a premium and you will get minimal drops from vehicles, this means you may have to raid gas stations or make your own.\n\nThey recommend that you use a bigger backpack mod such as this one as there are many parts to collect: [KhaineGB’s Bigger Backpack Mod](https://7daystodiemods.com/bigger-backpack-mod-60-96-slot-with-without-food-water-bar-on-hud/)\n\n**More to come…**\n\nNew things are planned along the way, such as a new tire fitting station and car lift system.\n\n* They will be adding more vehicles options for your post apocaliptic driving pleasures currently 10 in total to be added in Beta 2.\n* A Dedicated [POI](https://7daystodiemods.com/tag/7-days-to-die-prefab/) for Automotive Repairs.\n* Looking at a new system to spawn in broken vehicle with no gas that needs fueling to get back to workshop for full repair (early stage development).\n* Changing the engine sounds along the way.\n* Looking to adapt and add his fuel siphon modlet that he developed in A17 for use in Vehicle Madness in A19.\n* Work on localisation updates.\n* Add tracked vehicles into the mix… and a few novelty vehicles.\n* A few vehicles (Motorcycles and the working Chevy) are missing from the original release and may return or may be replaced with new options.\n* Guppy’s fun shopping cart is now a separate thing and can be found [here](https://7daystodiemods.com/shopping-go-karts/).\n\n## Acknowledgements\n\nSpecial thanks to: Guppycur. Also thanks to valdifer for the Spanish Translations for Vehicle Madness, feel free to take the current localizations and add more languages.\n\n**The ‘past and present’ Contributors to Vehicle Madness development:**\n\n* ActiniumTiger\n* Marcus\n* Guppycur\n* HaidrGna\n* Mumpfy\n* Random Person\n* Bdubyah\n* DUST2DEATH\n\nOthers who have been involved of whom i may have forgotten, and rest of the ‘Crew’ on Guppy’s Modding Discord for the support along the way.\n\n## Changelog\n\n* **_(new)_** Added Spanish translation.\n* Added various new wrecks created by bdubyah for the ultimate salvage variation (There is only 1 vanilla sedan in chain as required by some POI’s and all others are now custom).\n* Tweaked some vehicle speeds and camera positions and some storage on the big vehicles.\n* Increased amount of wrecks on roads and in biomes to provide more resources.\n* Experimental block damage changes.\n* Added Quad to world spawns and reduced spawns very slightly (feedback on this will be required as catering for server vs single player).\n* Added compressor to EMS and Military loot options, increased probabilities in automotive and rare automotive loot as were too rare before.\n* Removed damaged motorcyle part2 from spawn (will add more motorcycle variant wrecks at some point).\n\nThey also added some experimental vehicle damage changes. Vehicles can now severely damage wood structures and should no longer bounce of shopping carts or road signs.\n\n## Important Notes\n\n* You are not allowed to extract and alter the assets in this mod in any way, the assets can be used in other mods that are purely ‘non profit’. These assets must not be used in any venture that attempts to make money out of modding.\n* This is an Overhaul mod in modlet form and is required on both Client and Server as with other mods that add new assets.\n* A new game save is required as the mod overhaul adds a lot of new blocks in the game and changes existing ones too!\n\n**[Download](https://gitlab.com/Ragsy2145/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=VehicleMadness_Overhaul_Beta1.1)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/21143-vehicle-madness-mod/).\n\n**Credits:** [Ragsy2145](https://7daystodiemods.com/tag/ragsy2145/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/Ragsy2145/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=VehicleMadness_Overhaul_Beta1.1",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/21143-vehicle-madness-mod/",
  "modAuthors": [
    "Ragsy2145"
  ],
  "modTags": [
    "7 days to die biomes",
    "7 days to die car mods",
    "7 days to die prefab",
    "7 days to die truck mods",
    "7 days to die vehicles",
    "Ragsy2145"
  ]
}