{
  "modURL": "https://7daystodiemods.com/gnamod/",
  "modCreatedTime": "2021-07-25T20:49:00+00:00",
  "modLastUpdatedTime": "2021-07-25T21:02:42+00:00",
  "modName": "Gnamod",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/03/7-days-to-die-gnamod-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/03/7-days-to-die-gnamod-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/06/7-days-to-die-gnamod-changelog-screenshot.jpg"
  ],
  "modShortDescription": "This 7 Days to Die mod includes Gnamod Core, CoreUI, Survival, Horde Mode, Necropolis and Nomadic Mode.",
  "modDescription": "Gnamod has been developed since A14 by Haidr’Gna, hereafter referred to as mod-author. It all began as a set of tweaks for personal use and grew bigger during A15 into a full overhaul. The name is derived from the mod-author’s nickname and has no special meaning and is not an acronym for anything either.\n\nGnamod grew from just one overhaul into a group of mods that all share the same base of alterations to the game. This mod is now referred to as Gnamod Core and is the foundation for nearly all Gnamod versions since A17\\. The only exception is UI, which is known as Gnamod CoreUI and forms the foundation for all UI modifications for Gnamod but is also available as a stand-alone release ([Gnamod UI](https://7daystodiemods.com/gnamod-ui/)).\n\nGnamod is aimed at any player that finds the vanilla game lacking and is seeking more of a challenge in all aspects of the game. It brings back the survival aspect and offers a slower pacing than the vanilla game. The aim is a challenging but also fair gameplay experience where you will have to fight and be smart to earn your place in the world. The zombies are far more relentless, looting a lot more challenging and the world is more interesting.\n\nGnamod is a complete overhaul of the game, which means every aspect of it is altered in some way or will be in future versions of the mod. Gnamod is also continually being worked on and new content is being added. Since A17 introduced xpath there no longer is a need to redo work when a new alpha is released. This means Gnamod will continue to grow along with the game.\n\n## Mod Overview\n\n### Mod Structure\n\nGnamod is build around two Core mods, Gnamod Core and Gnamod CoreUI. Core is the main mod that houses nearly all changes required to overhaul the vanilla game. CoreUI is the same for all the UI changes required for Gnamod. By this design the other versions are just modlets designed to specifically alter or activate certain stuff within Gnamod and thus are dependent on the Core mod to function.\n\n### Terms of Use\n\nThis section applies to all mods released by the mod-author under the name of Gnamod. Any such mod will always start its name with Gnamod, such as Gnamod Core, Gnamod Horde Mode etc.\n\nAssets found in the Gnamod.unity3d contain the work of The Fun Pimps, myself, work from other authors listed under Included Work and used Unity packages, therefore it is **not** allowed to re-use this in any way without permission from the mod-author and/or the original author(s) of the content.\n\nGnamod is free to play by whoever owns 7 Days to Die. This includes running it on a private or rented server and hosting a game for friends. Users of Gnamod are also free to tailor their experience to their needs by altering the XML files. When hosting a server or game with such altered contents, it is required to notify users that an altered version of Gnamod is being used.\n\nUsers are free to borrow ideas that are unique to Gnamod in their own locally used mods or hosted games for friends. When using ideas unique to Gnamod in a mod that will be released to the public you are required to see permission of the mod-author. It is good practice to credit the mod-author and reference Gnamod in the mod’s documentation and advertisement in this case.\n\nUsers are **not** allowed to take the code from this mod to add to another mod in any way without asking the mod-author explicit permission for it. This applies for taking (parts of) the code, XML or assets as well as altered versions of these. Gnamod is intended to use as is and not to be broken down or redistributed in altered form. This includes adding any part of Gnamod into any kind of overhaul mod or mod collection pack.\n\nDue to the nature of Gnamod, the Core mod will likely not be compatible with any kind of modlet and the CoreUI mod will likely not be compatible with any modlet that alters the UI in any way. It is up to modlet authors to facilitate compatibility with Gnamod if they so incline. Bugs and issues that occur because of the use of other mods will not be resolved by the mod-author. It is of course allowed to design modlets that enhance Gnamod. Such modlets should be named in such a way they always load after the Gnamod Core mod.\n\nThe Fun Pimps are ultimately the true owners of this mod as it only works with their game and is only possible because they support the modding community of their game.\n\n## Gnamod Core\n\nThe Core mod is designed in such a way that when possible it adds new content into the game rather than replacing existing content. This way it is less dependent on changes made during the alpha development of the game and whims of its developers. The Core mostly relies on XML alterations and the addition of content through a single Unity package. In the future the Core may also include code scripts when this becomes supported by the game or some feature can no longer be added without it.\n\nThe Core also functions as a standalone mod, only requiring Gnamod CoreUI to function that is developed in conjunction with it. It strives to stay as close to the vanilla experience of the game. This means it will have all elements of it: Looting, Building, Zombie Hordes, Survival, Exploration and Mining. The goal is to create an as realistic as possible survival experience while also challenging players with zombies and deadly wildlife. Another goal is to expand upon the existing game including: Adding more items, blocks, zombie and animal appearances, trees, world props, plants, block shapes, traps and [weapons](https://7daystodiemods.com/tag/7-days-to-die-weapons/).\n\n### Features\n\n#### Zombie and Animal Skins\n\nFor many [Zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) and Animals new skins are added into the mix, this includes work done by Mumpfy. This is an ongoing process where new skins are added when available. The system is designed in such a way new skins can be added easily in ongoing development.\n\n#### Zombie and Animal Randomization\n\nZombies and [Animals](https://7daystodiemods.com/tag/7-days-to-die-animals/) in Gnamod have their stats randomized, this includes HP, Speed, Damage, Size, Walktype and Appearance. This makes zombies challenging and interesting as you never really known beforehand what you are dealing with.\n\n#### Zombie Groups and Classes\n\nThe following groups exist: World, Sleeper, Horde, Bloodmoon, Radiated and Radsleeper. Groups are super types that dictate the zombie’s final power and where they will be encountered. Then there are zombie classes, which dictate their behavior and some of their distinct behavior. The following classes exist: Dasher, Mook, Grunt, Average, Strong, Climber, Puker, Feral, Boss, Volatile and Bomber.\n\n#### Animal Behavior Templates\n\nThere are templates that animals can extend from giving them a certain behavior. Currently there is Timid, Weary, Neutral, Dangerous, Hostile and Undead. Timid animals will never fight, Weary animals have heightened senses and will not fight unless cornered, Neutral animals will mostly move away if you get close but engage when they are threatened, Dangerous animals have lowered senses but will always engage when something gets in their sights, Hostile animals have heightened senses and actively engage. Undead animals are considered zombies and will only attack the player or other non-zombie animals, they will never give up pursuit.\n\n#### Overhauled Spawning\n\nGamestaging, Biome Spawns, Wandering Hordes, Sleepers and Bloodmoons have all been redone for Gnamod. You will find more zombies during the day and a lot more during the nights. Each biome has its spawning tailored to it. Wandering Hordes are staged, which means they come in waves and not all at once, waves can include animals so you may see wolves being chased by zombies etc. Bloodmoons have more interesting waves and animal waves in between to spice things up. Early gamestages the hordes are relatively small, but they will pick up when your gamestage rises.\n\n#### Resource Overhaul\n\nGnamod completely overhauls the raw and manufactured resource system and only keeps a small fraction of the actual vanilla items in place. Some items are just Gnamod copies of the items while most are actual new items added to the game. Gnamod distinguishes resource categories: Mineral (Ores, Soil and Stone), Harvest (Items that you mainly harvest from animals or the world), Junk (Items you loot and have no use other than selling or scrapping), Resource (Items you loot, manufacture or harvest from human made items such as cars), Material (Items used for construction) and Component (Items that are part of weapon or ammo recipes). Gnamod adds well over 130+ items, some which replace a vanilla counterpart, but most are new. Gnamod adds (new) ores such as Copper, Zinc, Lead, Iron, Silver, Gold, Coal, Niter and Shale. Some are not yet available to mine, but others will spawn underground in special nodes you will have to find the old-fashioned way.\n\n#### Workstation Overhaul\n\nWorkstations have had changes, most notably the Forge is no longer being used as is and replaced by the Smelter. The Smelter does not melt materials in it, but instead works like other workstations with recipes turning materials in your inventory into other items. All metals can be turned into a Forged (Ingot) variant which can then be further processed at the Smelter into other items. Each workstation has a basic variation and a more advanced variation that can also handle the basic work. Nearly everything can be a tool for these workstations and thus its vital to check for tool requirements along with other requirements before crafting. In the future this system will be expanded upon to add a lot more specialty tools to craft certain more advanced items.\n\n#### Blueprints\n\nGnamod does away with Frames, instead there are Blueprint blocks in nearly 100 shapes available for 11 different materials. Blueprints appear as blue translucent blocks, support no weight and can be walked through. They are upgraded by using the right tool and material. Materials have different properties and the shape will determine the final strength and support glue of a block. Stone materials have more HP but a lower hardness and explosion resistance than the metal blocks which have 2 stages of upgrade while stone walls need to dry. The following materials exist (in order of strength): Scrapwood, Platedwood, Flagstone, Scrapmetal, Brick, Iron, Granite, Steel, Concrete, Stainless and Hardcrete.\n\n#### New Paintable Shapes\n\nIn addition to Blueprints Gnamod also has additional paintable shapes that do not exist in vanilla. Most prominent is a set of Pallisade blocks that can be crafted early game to build fortifications with. There is also the Porcupine trap shape that acts like the Log spikes from A16 but with more nasty spikes. More (currently missing) shapes will be added in the future.\n\n#### No Magic Upgrades\n\nMost upgrades and repairing have been removed from POI blocks (vanilla blocks not craftable by the player in Gnamod). This means POIs are mostly just a temporary base until you have enough material to build your own structure. Certain repairs or upgrades will be added in future versions so some POIs can be upgraded to a base.\n\n#### Overhauled Vanilla Biomes\n\nAll existing [biomes](https://7daystodiemods.com/tag/7-days-to-die-biomes/) have been redone in a more Gnamod style. Since A18 custom biomes cannot be done properly with XML only because of the Microsplat feature. So instead the 5 still existing biomes have been restyled to fit the Gnamod world. The forest is now home to the Gnamod Connifer forest, the burnt biome houses the Gnamod Fields biome, the desert, snow and wasteland have been redone in Gnamod style as well. Biomes appear in rings on the world with the Wasteland in the center, Snow around it followed by the Forest, Fields and then Desert.\n\n#### Unlocked Map Sizes\n\nThe RWG advanced generation allows to generate maps from 1k to 16k in increments of 512\\. Maps smaller than 2k are not recommended and odd sizes may yield weird worlds for as long as Gnamod still uses the vanilla stamp method for generation.\n\n#### Looting Overhaul\n\nLooting has completely been overhauled bring back the system of how loot worked in A16\\. This means that loot quality only slightly scales with the Gamestage while loot quantity goes up as Gamestage rises. This mostly is due to decreases in probability to find nothing or default loot (usually trash) in most containers. So overall while Gamestage rises so does the chance to find something or more items in containers go up. This is greatly dependant on the type of container, special loot ones will mostly remain similar over the course of a game while the more common containers will see more noticeable increases.\n\n#### More Lootable Stuff\n\nA lot of stuff that is not lootable in the vanilla game has been made lootable in Gnamod. This includes opened containers as well as certain items that looked lootable but where not.\n\n#### Trader Inventory Changes\n\nThe trader inventories have changed so they can sell Gnamod items. They refresh loot daily. The player vending machines also sell some stuff daily so check those out as well.\n\n#### Dyes\n\nGnamod comes with 5000 new dyes to find and use. These dyes cover the whole spectrum of colors so it will be hard to find two copies of the same color.\n\n#### Trader Overhaul\n\nTraders and their stocks have been overhauled. Each trader has specialized stock now. Their compounds have been overhauled and no longer are immune to damage.\n\n#### Economics Overhaul\n\nThe game’s entire economics has been overhauled, prices are based on their components to craft and value in the game. Previously existing exploits have been cleared away.\n\n#### Updated Quests\n\nQuest rewards have been altered to fit the Gnamod style and there are generally more choices available from the start, but you get less money for each completed quest. Reward choices offer cash sometimes and higher tier quests offer more choice variety.\n\n#### Early Game\n\nRebalanced the early game for looting. First 5 gamestages have access to a special starter lootgroup that offers basic stuff needed to get started. This is my way of handing out some basics while keeping it random.\n\n#### Perks\n\nLucky Looter no longer offers a flat bonus to loot gamestage, it can only increase as much as the player’s current level. Added a new perk: Bring it On, which increases all gamestage to increase challenge but also increased looting.\n\n#### Multi-Use Items\n\nGnamod now has items with multiple uses, currently available as Rations and First Aid Kits. These work from the toolbar only but can be used until their durability runs out. The higher the quality the more uses they have.\n\n## Gnamod Horde Mode\n\nGnamod Horde Mode is the full on Arcade version of Gnamod where it all resolves around tower defense. In this mode you will spawn near a machine called ‘Beacon’ that is your only route of escape, or so your poor character thinks. It sends out smoke signals and acts as a radio beacon for airplanes to drop supplies. It also attracts zombies, they just cannot resist punching it. Sadly for you the machine has an unstable nuclear core and to much zombie punches will make it explode and likely take you and your base with it.\n\nThe beacon comes with supply caches where you can exchange currency into supplies and equipment. The secret stash contains supplies that are changed daily. Increase your skill in bartering and intelligence to access the better stock and better prices.\n\nBe aware for the first horde that arrives around 2 PM (12 AM on servers). Surround your Beacon with walls, [traps](https://7daystodiemods.com/tag/7-days-to-die-traps/) and mines and make sure to equip yourself with the best your money can buy. Zombies will drop bags that contain more currency, so keep killing for more supplies.\n\nHorde Mode currently comes with three maps (Easy, Normal, Tough). The Tough map features the Boss Mode POI made by Like A Boss during alpha 17 with some alterations to make if fit with the rest. This POI features sleepers so you will need to fight off enemies right away.\n\n### Features\n\n* Arcade Mode with Beacon to defend.\n* Buy supplies from vendors in the Beacon. Store your stuff in the drawers of the Beacon.\n* Zombies drop money instead of loot.\n* Zombies can see further out and through walls, you cannot hide from the zombies.\n* Progressively harder for each day passed as well as gamestaged.\n\n### Notes & Tips\n\n* There are supplies to be found in both the standard tabs as well as the secret stash. Check each of the vendors (3 on each side with their own customized stock). To progress in Horde Mode you will eventually need to invest in Better Barter to unlock better stashes that contain the best materials.\n* Horde Mode is resource intensive despite Haidrgna’s best efforts. If you run into perfomance issues you may want to consider reducing settings even if the vanilla game runs fine.\n* The command ‘gfx pp enable 0’ will turn off all post processing and can help reduce the load. The mem or memcl (for clients) can free up some memory by calling the garbage collector.\n* You can set Bloodmoon hordes to daily for a different kind of experience.\n\n## Gnamod Survival\n\n**Important:** Survival is currently not available yet for A18\\. It is planned to be included in the 0.9.x release of the mod. This mode will likely not be added before A19.x is stable.\n\nGnamod Survival will be more true to the survival type of gameplay that was before part of Gnamod and Necropolis. This means that loot will be more scarce, gameplay is more focused on survival and less on the base defense part of the game. Construction in this mod will be more limited and getting a steady supply of [food](https://7daystodiemods.com/tag/7-days-to-die-food/) and water will be harder. In a sense this mode will focusing more in realism than on arcade like some of the other mods.\n\nThis mod is currently planned to be added, but is dependent on features to be implemented in Gnamod Core first:\n\n* Loot overhaul Gnamod Style.\n* Item overhaul.\n* Block overhaul.\n* Recipe overhaul.\n* Biome overhaul.\n\n## Gnamod Necropolis\n\n**Important:** Necropolis is currently not available yet for A18\\. It is planned to be included in the 0.9.x release of the mod. This mode will likely not be added before A19.x is stable.\n\nGnamod Necropolis will come back to the game but is very dependent on a lot of system that will be implemented in Core and Survival to work as well as POI work. Haidrgna have great plans for this to come back and will be using a system of world generation he is developing himself. For this a lot of POIs need to be build that requires a community effort.\n\nThis here is also a call to those interested in joining and helping to build POIs for Gnamod and Necropolis.\n\nThe following screenshots are of a prototype city that Haidrgna has been working on, which comes included in the 0.4.1 version of Gnamod Core.\n\n## Gnamod Nomadic\n\n**Important:** Nomadic is currently not available yet for A18\\. It is planned to be included in the 0.9.x release of the mod. This mode will likely not be added before A19.x is stable.\n\nSince the 7DTD world generation changed drastically and the world sizes have been limited this mode is likely not to return before A18 is out. Haidrgna really liked this mode but the small worlds and not working GoTo quest objectives have put off development on it for now.\n\n## Changelog\n\nAlright it is there and ready to go on the Stable branch of the Mod Launcher and the manual downloads have been updated with this version as well. Check the notes for all changes in this new version of Gnamod!\n\n**v0.8.4.0**\n\nGnamod 0.8.4.0 is like 0.8.3.0 in between a big update 0.9 and adding in improvements to existing features where there is no need to hold them back. This update focuses on improvements to the HUD of Gnamod CoreUI and additional balance updates and fixes to the existing gameplay.\n\n**Core**\n\n* Fixed: Removed fake cabinets from placeholder. If it looks like a cabinet it should be lootable.\n* Fixed: Animals (such as bears) no longer spawn wounded.\n* Fixed: Proper icons used for deployable turrets.\n* Fixed: Nailgun producing a lot of additional heat for no reason.\n* Changed: Puke applies a healing effect on zombies, this mostly counters the damage the blast deals to them, but may heal some more.\n* Changed: Removed Pigs. Mainly because their model no longer has working collision and thus they cannot be killed.\n* Changed: Climber and Bomber zombies that have no unique voice (Arnold, Ryan, Crispy) will now use the spider sounds if male and screamer sounds if female.\n* Changed: Limepowder stacks to 1000.\n* Changed: Recipe for farmplots no longer uses clay, but uses nails and a bit more nitrate. The discount is applied each level of perk now, up to 60%. This does not show in the perk description (since those are going to change soon).\n* Changed: Scouts now come in slightly larger groups when time passes than before.\n* Changed: Scrap arrows/bolts are no longer sold by traders.\n* Added: A new type of Vulture called Spitvulture, these will always puke but are slower and have more hp. The normal vultures no longer puke and see further away.\n* Balance: Puke corrosive effect rebalance, direct hits have 5% chance to cause ragdoll (down from 50%) and when it happen it adds no stacks from the direct hit.\n* Balance: Puke is less accurate for all sources, direct damage and explosive damage also have been reduced.\n* Balance: Rebalanced the spawns of Wandering Hordes. Removed exploding zombies and increased counts and reduced delays between waves.\n* Balance: Increased the overall danger of Sleeper zombies. Removed exploding (except Arnold) from the lists but increased the overall power level of sleepers.\n* Balance: Tweaked the animal spawns in biomes, removed super rare spawns from some that made little sense.\n* Balance: Mines have been made a bit more dangerous. The base timer is lower now, so difficulty and perk have a lot more influence on the final timer.\n* Balance: Tweaked nests and their loot. There will always be at least 1 feather in a nest now (in addition to other loot) and the number of fresh eggs has gone up.\n* Balance: Redone craft times of arrows/bolts to make more sense in the stage of the game you use them. Same goes for the arrow components.\n* Balance: Reduced the passive heat generation of actions by 20%.\n\n**CoreUI**\n\n* Changed: Redesigned the HUD elements, mostly using a shadow effect to improve readability of texts and make it look neat.\n* Changed: Compass, time and other info now in one block, including the mod version number.\n* Changed: Bars on the left are now 2 rows of 2 with buffs on top stacking horizontally. This gives much more room for buffs and easier to see whats active.\n* Changed: Removed delay of pickup/xp and reworked it to be the same as the buffs.\n* Changed: XP bar is now on the left together with ammo indicator. The UI will work with either toolbar.\n* Changed: Increased chat size and text delay time. Chat text also has more space on the screen.\n* Changed: Reworked the player bars on top left, can now display up to 10 players.\n* Changed: Cleaned up the quest display header.\n* Changed: Twitch menu moved to fit the sidebar. Using the classic toolbar will move it back.\n\n**Horde Mode**\n\n* Balance: Rebalanced the vendor stocks, mainly on the number of raw resources being sold and where. Amounts have increased and distribution changed.\n* Balance: Vendors will sell a lot more readymade blocks the first 5 levels of the player, after that the machine will stock between 0-2 rolls of blocks, so they become much rarer. Readymade blocks are only there to help getting started. Building material stocks are increased.\n* Balance: Cash rewards from zombies are now tied to gamestage so the chance to get more cash will go up as you progress.\n\nThis shows all the elements of the HUD when activated, including the Twitch window and 10 dummy players. Shows both toolbars, generally there will be only the one on the right, unless you enable the Classic Toolbar.\n\n## Installation\n\n### Manuel Installation\n\n* A. Navigate to the game’s base folder:(\\~\\\\Steam\\\\steamapps\\\\common\\\\7 Days to Die).\n* B. Extract the contents of the zip file(s) directly into the game’s base folder.\n* C. Make sure the entire contents of each zip you install goes into the base folder.\n* D. Start the game, if you done it correctly a you will see the Gnamod logo in the main menu.\n\n### Mod Launcher Installation\n\n* A. Download the [Mod Launcher](https://community.7daystodie.com/topic/4068-the-7d2d-mod-launcher-a-mod-launcher-for-7-days-to-die/) from Sphereii.\n* B. Install the Mod Launcher following the instructions.\n* C. Find the tab for Gnamod, open it, select a version and use Install Game Copy.\n* D. Use Pre-Sync to download the mod and then Play Mod to start.\n\nWant more Gnamod, find other players or know what is cooking: Join the [Discord Channel](https://discord.gg/kp9xMHG)!\n\n**[Download](https://drive.google.com/drive/folders/1G6VagNuwtrv34z2C2ZT_sx8UfWm_TmqT?usp=sharing)** Latest Version  \n**[Download](https://drive.google.com/open?id=1kn5WR9jp0nghTlOTvabSHb3MVV1-fcwo)** Older Versions\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/13558-gnamod/).\n\n**Credits:** [Haidrgna](https://7daystodiemods.com/tag/haidrgna/)",
  "modDownloadURLs": [
    {
      "Info": "Latest Version",
      "URL": "https://drive.google.com/drive/folders/1G6VagNuwtrv34z2C2ZT_sx8UfWm_TmqT?usp=sharing",
      "Version": "v19"
    },
    {
      "Info": "Older Versions",
      "URL": "https://drive.google.com/open?id=1kn5WR9jp0nghTlOTvabSHb3MVV1-fcwo",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/13558-gnamod/",
  "modAuthors": [
    "Haidrgna"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die biomes",
    "7 days to die loot",
    "7 days to die menu",
    "7 days to die perks",
    "7 days to die recipes",
    "7 days to die textures",
    "7 days to die traps",
    "7 days to die weapons",
    "7 days to die zombie textures",
    "7 days to die zombies",
    "Haidrgna"
  ]
}