{
  "modURL": "https://7daystodiemods.com/sorcery-mod/",
  "modCreatedTime": "2021-07-06T17:36:00+00:00",
  "modLastUpdatedTime": "2021-07-27T17:06:40+00:00",
  "modName": "Sorcery Mod",
  "modImages": [],
  "modShortDescription": "Through training and discovery, you'll learn how to deport the undead straight back to hell by casting elemental spells of Fire, Ice and Lightning.",
  "modDescription": "Play 7 Days to Die as a balanced post apocalyptic [zombie](https://7daystodiemods.com/tag/7-days-to-die-zombies/) vanquishing Sorcerer. Through training and discovery, you’ll learn how to deport the undead straight back to hell by casting elemental spells of Fire, Ice and Lightning.\n\n## Features\n\n* Vanilla game 100% untouched, add-only policy!\n* Balanced around vanilla gameplay, you must train to gain and sustain your power!\n* Unique animations, art, effects and sounds for spells and items\n* **New Spells:** Craft, Master and Upgrade 5 Spells per element!\n* **New Enemies:** Touched, Fallen (Champion), Awakened (Boss), Ancient (Raid)\n* **New Attributes:** Sorcery, Fire, Ice, Lightning\n* **New Resource:** Spirit (mana required to perform all Sorcery)\n* **New Dual Skill Tree and Perks:** Arcane, Fire, Ice, Lightning\n* **New Crafting:** [Armor](https://7daystodiemods.com/tag/7-days-to-die-armor-mods/), Weapons, Mods, Spells, [Potions](https://7daystodiemods.com/tag/7-days-to-die-drinks/), Scrolls, Stations, Blocks, Resources\n* **New Armor Sets:** Arcane, Fire, Ice, Lightning\n* **New Masteries:** Alchemy, Runesmithing, Spirit, Essence, Arcane, Fire, Ice, Lightning\n* **Play-style:** Sorcerer (Spellcaster)\n* **Play-style:** Alchemist (Potions, Bombs)\n* **Play-style:** Archer Mage (Spell Arrows)\n* **Play-style:** Gun Mage (Spell [Ammo](https://7daystodiemods.com/tag/7-days-to-die-ammo/))\n* **Play-style:** Melee Mage (Spell Weapons)\n* **Weapon Abilities:** Primary, Secondary, Passive and Charge abilities\n* **Rune Mods:** Harness the power of Runes to augment your weapons, armor and gear!\n* **Alchemy:** Craft Potions, Elixirs and Bombs\n* **Loot:** Item Sets, Armor, [Weapons](https://7daystodiemods.com/tag/7-days-to-die-weapons/), Mods, Spells, Potions, Scrolls and more!\n\n## Compatible Mods\n\nPENDING FOR SORCERY A19 – As compatible mods are reported here, the compatible mod/modlet will be added to the list:\n\n* Medieval: Book II (stay tuned)\n* [Darkness Falls Overhaul](https://7daystodiemods.com/darkness-falls-mod/) (v2.2+)\n* [War of the Walkers Overhaul](https://7daystodiemods.com/war-of-the-walkers-mod/) (v6+)\n* [Ravenhearst Overhaul](https://7daystodiemods.com/ravenhearst-mod/) (v5.5+)\n* [HDHQ Overhaul](https://7daystodiemods.com/hdhq-overhaul-mod/) \\+ Modlets\\* (compatibility patch\\*): This is a drag-n-drop Patch Modlet that renders Sorcery fully compatible with HDHQ. Simply drop the unzipped modlet folder into your Mods folder, along with Sorcery and the HDHQ Modlets: [Download](https://www.dropbox.com/s/i0s9jn7dreqdng9/Sorcery_Compatibility_Patch-HDHQ.zip?dl=1) HDHQ Patch Modlet\n* [60/96 Slot Backpack](https://7daystodiemods.com/bigger-backpack-mod-60-96-slot-with-without-food-water-bar-on-hud/)\n\n## Terms of Use and Disclaimer\n\nYou agree to the full Terms of Use and Disclaimer herein by downloading and using the Sorcery Mod.\n\n### Terms of Use\n\nAll digital assets and ideas contained herein, and made possible by the “Sorcery Mod”, is the sole digital proprietary property of mod Author Devrix. Ownership and equal rights are hereby, irrefutably and solely, extended and granted to The Fun Pimps legal entity in good faith.\n\n#### Usage\n\nThe Sorcery Mod may be downloaded and used by players of the 7 Days to Die community, with no required royalties. Other than the XML Code itself, digital assets and works of the Sorcery Mod may not be used outside of the Sorcery Mod. By downloading and using the Sorcery Mod, users of the mod understand and accept full and sole responsibility and liability of using the mod. Author, nor The Fun Pimps, shall be held responsible or liable for any possible conflict(s) as a direct or indirect result of using this mod.\n\n#### Redistribution\n\nThe XML code of the Sorcery Mod may solely be redistributed within the 7 Days to Die community. Conditions of redistribution require this notice to remain in full, unmodified, and a direct link, with credit stated, to the original Mod and Author. You may not redistribute the digital Assets or works, aside from XML Code, of the Sorcery Mod. The Sorcery Mod itself should not be redistributed outside of its original distribution channels.\n\n#### Credit\n\nThis mod is made possible through the framework provided by The Fun Pimps. It is their hard work and ongoing dedication to building and improving an awesome game that fuels the passion and drives the creation of this mod. Supporters of the Sorcery Mod make ongoing development possible. Without their support, it is not possible to put in the enormous amount of time required to create the plethora of unique assets that make Sorcery.\n\n#### Modification\n\nThe Terms of Use and Disclaimer herein are subject to ongoing changes and modifications.\n\n### Disclaimer\n\nThe Sorcery Mod is, and will always be, 100% FREE. When you choose to Support Development, you are supporting the unique individual work Devrix personally do outside of the game, as a content creator: The creation of unique VFX, SFX, Art, Time creating content and the services/interaction he provide here, Discord and other places. You are not supporting “derivative work of 7 Days to Die” (AKA modding code/changing skins/etc). That is against TFP policy.\n\nDevrix reserve the right, as a content creator, to choose whom he wish to have test his several hundred hour creations. With that said, he respect TFP and fully intend on complying with their wishes, as always before. Sorcery will never remain in a “private testing state” for more than 2-3 weeks. After this private testing window, Sorcery will release publicly in full, 100% FREE.\n\nNon-supporters are able to obtain any “Supporter Exclusives” 100% FREE. If a non-supporter wishes to receive these benefits and do wish to support Devrix’s efforts, they may speak directly with him and they will be given a “key”. Finally, as most of you already know, he cannot continue development of Sorcery without Support. If support drops below a threshold, development halts. Sadly, he’s not rich and is only able to allot the time he can due to the generous support given by their Supporters.\n\n## Changelog\n\n**Sorcery Class Runes (v0.944) Now Live!**\n\n* Added: Spell Knight (Class Runes)\n* Added: Spell Gunner (Class Runes)\n* Added: Spell Archer (Class Runes)\n* Added: Spell Trapper (Class Runes)\n* Added: Enchanter (Class Runes)\n* Added: Ritualist (Class Runes)\n* Added: Scholar (Class Runes)\n* Added: Silence Rune (stops Fallen + Ally Healing)\n* Added: New Mastery (Scholar)\n* Added: Fire Spellcast FX (player arm)\n* Added: Alchemy Mastery 5/5 now Boosts Ally Potion Potency\n* Added: Rune Mastery 5/5 now Boosts Ally Rune Effectiveness\n* Added: Lightning FX+Spells (Shock, Electrocute)\n* Changed: Improved Spell Traps\n* Changed: Rune Mastery now unlocks Runes and Transmutations in this order – 1: Common, 2: Transmutations (convert), 3: Rare (Silver), 4: Legendary (Gold), 5: Transcendent (Orange)\n* Changed: Class Runes Drop Rate increased even more!\n* Changes & Fixes: Visit the [Discord #Changelog](http://discord.sorcerymod.com/)\n\nNew game is NOT required for existing v0.94x games.\n\n## Installation\n\n1. Download: Sorcery-master.zip (latest version)\n2. Unzip: Sorcery-master.zip\n3. Drag-n-Drop: The Sorcery folder only, found within the unzipped Sorcery-master folder, directly into your Mods folder (\\\\7 Days To Die\\\\Mods). Create the Mods folder here if it doesn’t already exist.\n4. Verify Mod Path: (\\\\7 Days To Die\\\\Mods\\\\Sorcery) + (\\\\7 Days To Die\\\\Mods\\\\Deep Pockets)\n5. Deport The Undead back to Hell: You’re ready to play as a post-apocalyptic harbinger of the elements… may your training commence!\n\n### Play With Darkness Falls\n\nFollow the instructions below (spoiler) to play Sorcery + Darkness Falls together:\n\n_**Install Darkness Falls first! (latest version)**_\n\n1. Download Darkness Falls\n2. Download Sorcery\n3. Download Compatibility Patch\n4. Unzip: Sorcery-master.zip AND SorceryCompatibilityDF.zip\n5. Drag-n-Drop: The single folder (Sorcery), found within the unzipped (Sorcery-master\\\\Mods) folder, directly into the Mods folder (\\\\Darkness\\_Falls\\_Directory\\\\Mods). Create the Mods folder here if it doesn’t already exist.\n6. Drag-n-Drop: The folder (SorceryCompatibilityDF) directly into the Mods folder (\\\\Darkness\\_Falls\\_Directory\\\\Mods) of your Darkness Falls root directory\n7. Verify Mod Path: (\\\\Darkness\\_Falls\\_Directory\\\\Mods\\\\Sorcery) + (\\\\Darkness\\_Falls\\_Directory\\\\Mods\\\\SorceryCompatibilityDF)\n8. Deport The Undead back to Hell: You’re ready to play as a post-apocalyptic harbinger of the elements… may your training commence!\n\n#### Sorcery+Darkness Falls Support\n\nDo NOT bother Khaine about Sorcery+DF compatibility issues or ask for him to make changes between the two. If you’re having a problem, or want to request a feature, there are dedicated channels on the Sorcery Discord. Devrix alone update and ensure compatibility between the two.\n\n## Feedback, Ideas, Bug Reporting\n\nConstructive feedback is welcome and encouraged. Specifically, it’s very helpful to hear from those wanting and willing to play a cheat-free normal playthrough. If you cheat everything in, you aren’t getting the experience or progression intended… nor will you properly understand the perks, skills and functions unless you learn and grow into them while playing.\n\nAlthough there’s A LOT more planned for Sorcery, further ideas and suggestions are always welcome in the [Sorcery Discord](http://discord.sorcerymod.com/)!\n\n**[Download](http://download.sorcerymod.com/)** Sorcery  \n**[Download](http://df-download.sorcerymod.com/)** Darkness Falls Compatibility Patch  \nAlso available on the mod launcher!\n\nEnjoying Sorcery? You can support the development of Sorcery Mod using this [donate link](https://www.patreon.com/sorcerymod).\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/11792-sorcery/).\n\n**Credits:** [Devrix](https://7daystodiemods.com/tag/devrix/)",
  "modDownloadURLs": [
    {
      "Info": "Medieval: Book II (stay tuned)Darkness Falls Overhaul (v2.2+)War of the Walkers Overhaul (v6+)Ravenhearst Overhaul (v5.5+)HDHQ Overhaul + Modlets* (compatibility patch*): This is a drag-n-drop Patch Modlet that renders Sorcery fully compatible with HDHQ. Simply drop the unzipped modlet folder into your Mods folder, along with Sorcery and the HDHQ Modlets: HDHQ Patch Modlet60/96 Slot BackpackDownload Sorcery",
      "URL": "http://download.sorcerymod.com/",
      "Version": "v19"
    },
    {
      "Info": "Darkness Falls Compatibility Patch",
      "URL": "http://df-download.sorcerymod.com/",
      "Version": "v19"
    },
    {
      "Info": "Also available on the mod launcher!",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/11792-sorcery/",
  "modAuthors": [
    "Devrix"
  ],
  "modTags": [
    "7 days to die ammo",
    "7 days to die armor mods",
    "7 days to die drinks",
    "7 days to die weapons",
    "7 days to die zombies",
    "Devrix"
  ]
}