{
  "modURL": "https://7daystodiemods.com/admin-skill-points/",
  "modCreatedTime": "2021-07-30T17:07:00+00:00",
  "modLastUpdatedTime": "2021-07-30T17:14:15+00:00",
  "modName": "Admin Skill Points",
  "modImages": [],
  "modShortDescription": "This mod makes the game less annoying by letting players fully flesh out their attributes and perks, as they see fit.",
  "modDescription": "This mod makes the game less annoying by letting players fully flesh out their attributes and perks, as they see fit.\n\nIt adds new quest items to the game that let the player decide how many additional [skill points](https://7daystodiemods.com/tag/7-days-to-die-skill-points/) to instantly give themselves. By default, the items are only available in creative mode, which you can activate by entering CM from the command console (F1).\n\n## Compatibility\n\nThe latest version of this mod has been tested on the vanilla/base install of 7 Days To Die for PC/MAC, version(s): **Alpha 19.6 b8 Stable**\n\nIt may or may not work with earlier versions of 7DTD, may or may not work with experimental versions of 7DTD, may or may not work with other mods or modlets or customizations, and may or may not work with your particular server configuration.\n\nAlso, console players are out of luck with this one. Sorry!\n\nYour mileage may vary. Caveat emptor.\n\n## Changelog\n\nThe latest version of this mod is fully compatible with and has successfully passed testing for the latest STABLE version of 7DTD, Alpha 19.6 (b8) Stable.\n\nUpdated the extended version number within the mod (which is visible in the console output as the mod loads), to help users know at a glance which version(s) they have installed.\n\n## Using This Mod\n\n1. After installing this mod, either start a new game or continue an existing one.\n2. Open the command console (F1).\n3. Enter CM to turn creativemenu on.\n4. Close the command console (ESC).\n5. Enter the CREATIVE menu using whatever key binding you have it set to (often the U key).\n6. Single click on the DEV BLOCKS icon.\n7. In the search field to the right of the magnifying lens, type ADMIN (not case sensitive). You’ll notice eight (8) new quest challenge notes… ADMIN POINTS 1, 10, 25, 50, 100, 250, and 279.\n8. Give yourself any of these new items.\n9. Read the item, like any other quest note.\n10. Enjoy!\n\n## Troubleshooting/Errors\n\nIf you are having problems with this mod, please try the following self-troubleshooting steps:\n\n* Make sure 7DTD is not running.\n* Move all of your existing mod folders out of your Mods folder, say to your Desktop (TEMPORARILY).\n* Restart the game, and see if you get the error you posted.\n* If so, your game/save may be pooched, and you’ll want to delete it and start a new game/save. Restart the game, and see if you get the error you posted.\n* If so, your copy of 7DTD may be pooched, and you’ll want to re-install. Restart the game, and see if you get the error you posted.\n* If not, try ONLY moving his mod folder(s) back into your Mods folder.\n* Restart the game, and see if you get the error you posted.\n* If so, THEN his mod(s) may be causing your error. If that’s the case, please report back here with more details (which mods you have installed, what game version you’re running, PC/MAC/Linux/console, etc), and I’ll try to help you.\n* If not, someone else’s product(s) may be causing your error, and you’ll want to pursue the issue further with them.\n\n## Installation\n\n1. Download the zip file to your computer.\n2. Extract the rev678\\_admin\\_skill\\_points folder from the zip file.\n3. Open your 7 Days To Die game installation folder. The easiest way to do this is to find your 7 Days To Die game listed in your Steam LIBRARY, right-click on it to open the pop-up menu, select Properties, single-click on the LOCAL FILES tab, and then click on BROWSE LOCAL FILES.\n4. Look in your 7 Days To Die game folder for a Mods folder. If there is NOT already a Mods folder, create one by right-clicking on any empty space in the folder window and selecting New Folder.\n5. Open the Mods folder.\n6. If you already HAVE an old/existing rev678\\_admin\\_skill\\_points folder, remove it from the 7 Days To Die game folder’s Mods folder.  \nFAILURE TO DO SO MAY CAUSE YOU UNEXPECTED ISSUES!\n7. Copy or move the rev678\\_admin\\_skill\\_points folder into the Mods folder.\n\n**Uninstall:** To uninstall this mod, simply remove the rev678\\_admin\\_skill\\_points folder from the Mods folder.\n\n**[Download](https://drive.google.com/file/d/1EFs1YANyCBEm2lRcsF1_6JIidwDUunQW/view?usp=sharing)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/9895-rev67-8s-admin-skill-points/).\n\n**Credits:** [Rev678](https://7daystodiemods.com/tag/rev678/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/1EFs1YANyCBEm2lRcsF1_6JIidwDUunQW/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/9895-rev67-8s-admin-skill-points/",
  "modAuthors": [
    "Rev678"
  ],
  "modTags": [
    "7 days to die skill points",
    "Rev678"
  ]
}