{
  "modURL": "https://7daystodiemods.com/reality-check-removing-some-zombies-animals/",
  "modCreatedTime": "2021-07-30T17:09:00+00:00",
  "modLastUpdatedTime": "2021-07-30T17:14:17+00:00",
  "modName": "Reality Check (Removing Some Zombies & Animals)",
  "modImages": [],
  "modShortDescription": "This package makes the game much better by removing cops, dogs, ferals, screamers, snakes, spiders, vultures, wights, radiated animals/zombies and more.",
  "modDescription": "This mod package makes the game less annoying for zombie purists by removing bears, cops, coyotes, demolitions, dogs, ferals, football players, mountain lions, screamers, snakes, spiders, vultures, wights, wolves, and even radiated animals and [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/). Giving the individual player full control to decide for themselves which of those critters they want removed from the game.\n\nYou can still manually spawn any of the other [animals](https://7daystodiemods.com/tag/7-days-to-die-animals/) or zombies from the base/vanilla game using the entity spawner (F6), but this should keep them from spawning in-game otherwise.\n\nUnless you do some of the quests which may spawn specific animals or zombies other than the substitutions this mod makes otherwise.\n\n## Included Mods\n\nYou may safely install any combination of these mods, or even all of them, without worrying about incompatibilities.\n\n### No Bears Standard\n\nReplace standard bears with zombieMoe.\n\n### No Bears Zombie\n\nReplace zombie bears with zombieMoe.\n\n### No Cops Zombies\n\nReplace cops with zombieMoe.\n\n### No Coyotes\n\nReplace coyotes with zombieMoe.\n\n### No Demolitions\n\nReplace demolitions with zombieMoe.\n\n### Remove Dogs\n\nReplace zombie dogs with zombieMoe.\n\n### No Ferals\n\nReplace feral zombies with zombieMoe.\n\n### No Football Players\n\nReplace football players with zombieMoe. The zombie football player will still run at players, even if zombie speed is set to walk. Bench this guy permanently, if you want.\n\n### No Mountain Lions\n\nReplace mountain lions with zombieMoe.\n\n### No Radiated Zombies\n\nReplace radiated animals and zombies with zombieMoe.\n\n### No Screamers\n\nReplace screamers with zombieMoe.\n\n### No Snakes\n\nReplace snakes with zombieMoe.\n\n### No Spider Zombies\n\nReplace spiders with zombieMoe.\n\n### No Vultures\n\nReplace all vultures with zombieMoe.\n\n### No Vultures Standard\n\nReplace standard vultures with zombieMoe.\n\n### No Vultures Radiated\n\nReplace radiated vultures with zombieMoe.\n\n### No Wights\n\nReplace all wights with zombieMoe.\n\n### No Wights Feral\n\nReplace feral wights with zombieMoe.\n\n### No Wights Radiated\n\nReplace radiated wights with zombieMoe.\n\n### No Wolves Standard\n\nReplace standard wolves with zombieMoe.\n\n### No Wolves Dire\n\nReplace dire wolves with zombieMoe.\n\n**Why zombieMoe:** Because that particular entity doesn’t have any restrictions on which biomes or biome types it can spawn into.\n\n## Compatibility\n\nThe latest versions of these modlets have been tested on the vanilla/base install of 7 Days To Die for PC/MAC, version(s): **Alpha 19.6 b8 Stable**\n\nThey may or may not work with earlier versions of 7DTD, may or may not work with experimental versions of 7DTD, may or may not work with other mods or modlets or customizations, and may or may not work with your particular server configuration.\n\nAlso, console players are out of luck with this one. Sorry!\n\nYour mileage may vary. Caveat emptor.\n\n## Known Incompatibilities\n\n1. These modlets DO NOT work properly with the (RETIRED) REV6:7-8’s CRISPY CRITTERS modlet. Again, decide which you want more, and stick to that path only.\n2. These modlets DO NOT work properly with either of the (RETIRED) REV6:7-8’s THE GREY modlets. Again, decide which you want more, and stick to that path only.\n3. These modlets DO NOT work properly with any other mods, modlets, or customizations that add, change, remove, or replace NPCs from the 7DTD game.\n\nConsider yourself warned.\n\n## Changelog\n\nThe latest versions of these modlets are fully compatible with and have successfully passed testing for the latest STABLE version of 7DTD, Alpha 19.6 (b8) Stable.\n\nUpdated the extended version numbers within the modlets (which are visible in the console output as the modlets load), to help users know at a glance which version(s) they have installed.\n\n## Best Practices/Troubleshooting/Errors\n\n1. rev678 strongly advise you to start a NEW game/save AFTER installing but BEFORE running these modlets. Failure to do so will likely result in an “Invalid Cast Exception” error. If you don’t start a NEW game/save AFTER installing but BEFORE running these modlets, and get errors, he’s going to tell you to start a NEW game/save.\n2. Sometimes an “Invalid Cast Exception” error can be corrected by “cleaning” your player profile (either using the cleaning tool in the 7DTD Launcher, or change your player profile from the in-game menus). Again though, if you don’t start a NEW game/save AFTER installing but BEFORE running these modlets, and get errors, he’s going to tell you to start a NEW game/save.\n3. If you DID start a NEW game/save, and still are having problems with these modlets, please try the following self-troubleshooting steps:\n* Make sure 7DTD is not running.\n* Move all of your existing modlet folders out of your Mods folder, say to your Desktop (TEMPORARILY).\n* Restart the game, and see if you get the error you posted.\n* If so, your game/save may be pooched, and you’ll want to delete it and start a new game/save. Restart the game, and see if you get the error you posted.\n* If so, your copy of 7DTD may be pooched, and you’ll want to re-install. Restart the game, and see if you get the error you posted.\n* If not, try ONLY moving his modlet folder(s) back into your Mods folder.\n* Restart the game, and see if you get the error you posted.\n* If so, THEN his modlet(s) may be causing your error. If that’s the case, please report back with more details (which modlets you have installed, what game version you’re running, PC/MAC/Linux/console, etc), and he will try to help you.\n* If not, someone else’s product(s) may be causing your error, and you’ll want to pursue the issue further with them.\n\n## Installation\n\n1. Download the zip file to your computer.\n2. Extract the Mods folder from the zip file.\n3. Open the extracted Mods folder.\n4. Open your 7 Days To Die game installation folder. The easiest way to do this is to find your 7 Days To Die game listed in your Steam Library, right-click on it to open the pop-up menu, select Properties, single-click on the local files tab, and then click on browse local files.\n5. Look in your 7 Days To Die game folder for a Mods folder. If there is not already a Mods folder, create one by right-clicking on any empty space in the folder window and selecting New Folder.\n6. Open the 7 Days To Die game folder’s Mods folder.\n7. If you already have any old/existing rev678\\_realitycheck\\_ folders, remove them from the 7 Days To Die game folder’s Mods folder. Failure to do so may cause you unexpected issues!\n8. Copy or move any or all of the rev678\\_realitycheck\\_ folders from the extracted Mods folder into the 7 Days To Die game folder’s Mods folder.\n9. Start a NEW GAME, or you’re likely to have technical issues.\n\n**Uninstall:** To uninstall any or all of these mods, simply remove the corresponding rev678\\_realitycheck\\_ folder or folders from the 7 Days To Die game folder’s Mods folder.\n\n**[Download](https://drive.google.com/file/d/1N7U_z1_S-j-9cCl1B5e7rAu5grpPEHaC/view?usp=sharing)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/9832-rev67-8s-reality-check/).\n\n**Credits:** [Rev678](https://7daystodiemods.com/tag/rev678/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/1N7U_z1_S-j-9cCl1B5e7rAu5grpPEHaC/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/9832-rev67-8s-reality-check/",
  "modAuthors": [
    "Rev678"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die zombies",
    "Rev678"
  ]
}