{
  "modURL": "https://7daystodiemods.com/enzombies-more-zombie-variations/",
  "modCreatedTime": "2021-07-30T17:11:00+00:00",
  "modLastUpdatedTime": "2021-08-09T19:48:42+00:00",
  "modName": "enZombies - More Zombie Variations",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/07/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-1a.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/07/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-2b.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/07/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-3a.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/07/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-4d.jpg"
  ],
  "modShortDescription": "ErrorNull Zombies (enZombies)! Stronger and boss-level zombies are on the works. Each enZombie also has their own feral, radiated, and crawler versions.",
  "modDescription": "**ErrorNull Zombies (enZombies):** ErrorNull created more normal zombies to add more variety to the game, using the same archetype zombie creation method showcased by the Snukfin’s Server Side Z(S)ombies mod and Snufkin’s Custom Server Side Zombies – PLUS mod. Likewise, if this mod is used on a server, players who connect to the server don’t need to download anything on their side. For now, enZombies are meant to be your average walkers and crawlers to complement the existing vanilla zombies. Stronger and boss-level zombies are on the works. Each enZombie also has their own feral, radiated, and crawler versions.\n\nCertain enZombies will spawn out in the terrain based on the [biomes](https://7daystodiemods.com/tag/7-days-to-die-biomes/) – alongside the vanilla zombies. So you will find foresty zombies in the forest, deserty zombies in the desert, snowy zombies in the snow, and so forth… with each zombie group sporting a color theme to match their biome. enZombies also spawn as sleepers inside the POIs, though unfortunately there’s no easy way to spawn them as sleepers based on a biome theme. So you will simply see the full range of enZombies appear inside the POIs. enZombies also appear in the challenge quests.\n\nThe challenge quests are an underutilized feature in the vanilla game. New challenge quests have also been added to showcase new zombies. All new quests are simply found as items within the usual loot containers where vanilla [quests](https://7daystodiemods.com/tag/7-days-to-die-quests/) are found. Many more quests are planned.\n\n* Goblin Raid\n* Forest Goblin Raid\n* Desert Goblin Raid\n* Snow Goblin Raid\n* Red Goblin Raid\n* Wasteland Goblin Raid\n* Business Meeting Gone Wrong\n\n## Compatibility\n\nHe removed and redid most of the vanilla zombie groups in entitygroups.xml, created a few of his own, and redid a number of the main spawners in gamestages.xml. For this reason, he doesn’t expect this mod to work well with any mods that also make changes to these two XML files. The only mods he does officially support are in the Add-Ons section below. If you are getting errors or strange glitches while using non-supported mods with enZombies, he’ll be glad to take a glance when he get the chance, but making sure other mods work with enZombies is not his current focus. If he see enough demand, he might spend the time to modify a non-supported mod to work with enZombies and thus will be included as an official Add-On mod below.\n\n## Usage\n\nYou may use his mod as it is presented, or you are also welcome to disregard his spawning customization and just pull his zombies (from archetypes.xml and entityclasses.xml) and merge them into your own mod. But, he’d appreciate if you credit him in that case like mentioning his mod or the link on your website, discord or forum post. He love making these custom [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) and plan to continue for a long while, but it does take lots of time and effort.\n\n## Add-Ons\n\nThese are optional mods created for enZombies that are officially supported. The main enZombies mod must still be installed in order for these Add-Ons to work. Download the zip file for the add-on you want and extract the contents to your 7 Days to Die “Mods” folder.\n\n### No Nudes Mod\n\nThere are a number of female enZombies that show lots of skin. If this is more than you perfer, this mod will cover them up by adding a bikini top for their chest, and the default underwear shorts for their bottoms. Download the zip file and extract the contents to your 7 Days to Die “Mods” folder.\n\n### Snufkin Zombies Plus\n\nThis mod adds all Snufkin community zombies alongside enZombies. The Snufkin zombies will spawn outside in the various biomes, within the screamer hordes, the wandering hordes, and the blood moon horde night… along with the enZombies. The Snufkin zombies do not spawn inside POI’s like as sleepers, but he has included code within ENTITYGROUPS.XML where you can enable it.\n\n## Known Issues\n\nThere are some interesting bugs when working with UMA zombies and molding them from the archetypes.xml. It’s not unique to enZombies and are present in mods like the Snufkin zombies as well. In his view though, the relative ease in creating and modifying these zombies far outweigh the quirks:\n\n* There is a NullReferenceException error that occurs within certain POI’s. This is happens with any archetype style zombies – like the Snufkin ones too. He has reported this and the staff has stated “…the deeper issue is known with the parent issue and will be worked on.” [Bug report link](https://community.7daystodie.com/bug-test-1/not-a-bug/red-console-warning-for-cntcar03sedandamage1v07-in-house_moder_01-poi-r2203/). Currently, the POI’s for House\\_Modern\\_01 and house\\_old\\_pyramid\\_02 experience this error. Please let him know if you find the same within any other POI’s.\n* UMA zombies do not collide with player vehicles. So your vehicles will simply drive right through them and they will walk right through stationary player vehicles as well. This does not impact the POI vehicles.\n* UMA zombies when struck down are not as heavily pulled down by gravity as the vanilla ones. A strong weapon or explosion can send them flying amazing distances!\n* UMA zombies don’t catch fire from torch attacks. However, they do burn and suffer damage from molotov cocktails, flaming arrows/bolts. The flame effects just don’t visually show on their bodies.\n\n## Credits\n\nThanks to Snufkin for starting it all with his “Snukfin’s Server Side Z(S)ombies” mod, and thanks to Arramus for keeping it going with the “Snufkin’s Custom Server Side Zombies – PLUS” mod. ErrorNull studied these mods for weeks to figure out how it worked and gave him inspiration to contribute as well.\n\n## Mentioned Mods\n\n* [Snukfin’s Server Side Z(S)ombies](https://7daystodiemods.com/server-side-zombies/)\n* [Snufkin’s Custom Server Side Zombies – PLUS](https://7daystodiemods.com/snufkins-custom-server-side-zombies-plus/)\n\n## Changelog\n\n**Version 1.7**\n\n* Added three desert goblins\n* Added new desert goblin raid challenge quest\n* Added two business women and one more businessman\n* Added new businessman raid challenge quest\n* Added one more utility man zombie\n* Updated enWolf, enDirewolf and enCoyote not run away and also be harvestable\n* Updated wandering horde spawns to include groups of crawlers\n\n## Download and Install\n\nDownload the zip file that’s linked below. Unzip or extract the contents of zip file into the 7 Days to Die “Mods” folder.\n\n**[Download](https://drive.google.com/file/d/1nv5dP5xSaGrUef4LaVENL2BJf2yBJ8gF/view?usp=sharing)** enZombies  \n**[Download](https://drive.google.com/file/d/180DShXSoVII_QuLXjt-ZTQOtBO7oYii2/view?usp=sharing)** No Nudes Mod Addon  \n**[Download](https://drive.google.com/file/d/1qV0bHESba8Ld5fTZFhT1d4jymPqT-sbR/view?usp=sharing)** Snufkin Zombies Plus Addon\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/24594-enzombies-a-spawn-of-snufkins-server-side-zombies/).\n\n**Credits:** ErrorNull, Snufkin, Arramus",
  "modDownloadURLs": [
    {
      "Info": "enZombies",
      "URL": "https://drive.google.com/file/d/1nv5dP5xSaGrUef4LaVENL2BJf2yBJ8gF/view?usp=sharing",
      "Version": "v19"
    },
    {
      "Info": "No Nudes Mod Addon",
      "URL": "https://drive.google.com/file/d/180DShXSoVII_QuLXjt-ZTQOtBO7oYii2/view?usp=sharing",
      "Version": "v19"
    },
    {
      "Info": "Snufkin Zombies Plus Addon",
      "URL": "https://drive.google.com/file/d/1qV0bHESba8Ld5fTZFhT1d4jymPqT-sbR/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/24594-enzombies-a-spawn-of-snufkins-server-side-zombies/",
  "modAuthors": [
    "ErrorNull",
    "Snufkin",
    "Arramus"
  ],
  "modTags": [
    "7 days to die biomes",
    "7 days to die quests",
    "7 days to die zombies"
  ]
}