{
  "modURL": "https://7daystodiemods.com/hs-special-things/",
  "modCreatedTime": "2021-08-14T13:17:00+00:00",
  "modLastUpdatedTime": "2021-08-14T13:19:19+00:00",
  "modName": "H's Special Things",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/07/7-days-to-die-hs-special-things-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/07/7-days-to-die-hs-special-things-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/09/7-days-to-die-hs-special-things-additional-screenshot-5.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/07/7-days-to-die-hs-special-things-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/07/7-days-to-die-hs-special-things-additional-screenshot-4.jpg"
  ],
  "modShortDescription": "Adds invulnerable bulletproof glass and stainless steel and more specialized blocks. Adds better versions of admin tools and more.",
  "modDescription": "This mod is server sided, if you prefer multiplayer your clients don’t need to download, mod will be pushed to them automatically when they are trying to connect your server.\n\n**Adds invulnerable bulletproof glass and stainless steel and more specialized blocks**\n\n* Adds new [materials](https://7daystodiemods.com/tag/7-days-to-die-building-materials/); invulnerable glass and invulnerable steel (could used bedrock but i had some poor exp with it earlier)\n* Adds new glass blocks all invulnerable; cube, plate, ramp,\n* Adds new steel blocks all invulnerable; cube, half, plate, ramp, stairs, stairs with railings, pyramid, pillar, pillar cap, bars, ladder, log spike ([trap](https://7daystodiemods.com/tag/7-days-to-die-traps/))\n* Adds new special blocks all invulnerable; garage door 5x3x1, garage door 3x2x2, steel door, vault door, hatch door, drawbridge (all working without electricity)  \n   * All will downgrade to itself in endless loop (nothing happens except visual change in case some damage)  \n   * All can be repaired, with special nailgun or special stone axe and when having main cube (repair only needed for flawless visuals, otherwise unnecessary)  \n   * All can be upgraded to visually equal but regular versions, with special nailgun or special stone axe and when having main cube (in case misplacements or change of mind)\n\n**Adds better versions of admin tools and more**\n\n* Adds special nailgun; ranged upgrade & destroy tool\n* Adds special nails for above special nailgun but it can be used with regular nailgun  \n   * Special nailgun primary action destroys all blocks with one shot (except log spike, it requires 3 shots bcz of matryoshka-like design)  \n   * Special nailgun secondary action upgrades invulnerable blocks to vulnerable top tier blocks like bulletproof glass and stainless steel\n* Adds special stone axe\n* Adds special paint tool\n* Adds special machete\n* Adds special steel knuckles\n* Adds special pistol and smg (modified versions of admin [tools](https://7daystodiemods.com/tag/7-days-to-die-tools/), smg is not digger anymore because we have special nailgun)\n* Adds special 9mm armor piercing [bullets](https://7daystodiemods.com/tag/7-days-to-die-ammo/) for above special guns but it can be used with any 9mm gun\n* Adds special magnum revolver\n* Adds special ak47\n* Adds special hunting rifle\n* Adds special double barrel shotgun\n* Adds special turret  \n   * The turret has very very low hit chance especially from distance, to compensate this it consumes nothing, neither power nor ammo  \n   * Only when works when you are close to it (luckily interfering blocks does not decrease working range) and only one of them can be active at a time  \n   * You can place one behind the door or wall, so it can help defending when you are unable to shoot zombies from your position etc\n* Adds special .44 magnum bullet\n* Adds special 7.62 mm bullet\n* Adds special shotgun slug\n* Adds special buffs; mega jump & super speed\n* Adds special cowboy boots having above special buffs  \n   * When special boots on, jumping drains stamina but running regens it (the flash-like)\n* Adds special dress shoes having only super speed buff (with very little jump buff)\n* Adds special mining helmet; flashlight on it\n* Adds special tank top; gives good resistance\n* Adds special shades; gives perception, makes treasures easier to find\n* Adds special cigar; gives strength, gives bartering bonus\n* All tools and items above are invulnerable and undegradable\n\n**Adds special trader, forge, workbench and bicycle**\n\n* Adds special trader, copy of Jen; you can buy, sell and take jobs but she also has key differences explained below  \n   * Sold items are different, she has tons of apparel, armor, tools, guns, ammo, medicine, seed, raw food, resources, vehicle parts, decorations, missions-quests, books and recipes-schematics  \n   * She is invulnerable like any other trader but in case misplacements, there is a way to remove her, explained in XML files; blocks.xml and entityclasses.xml  \n   * She is craftable but you need quite amount of organic resources. she sells these resources so, after crafting first you can craft the rest easier  \n   * You can easily create your own trading post with this trader and help of invulnerable blocks, if you are admin this is going to help you a lot\n* Adds special forge and workbench  \n   * Functionality is exactly same as regular versions, I plan to add features like faster crafting or crafting more items at once etc.  \n   * For now the real difference is how you craft these two in early game, they only require basic mats (stone, clay, iron, wood) but lots of them of course.  \n   * They are unlocked by default, this means you can have your forge and workbench as soon as you farm enough materials.\n* Adds special [bicycle](https://7daystodiemods.com/tag/7-days-to-die-vehicles/)  \n   * If you don’t want your map’s forest biome to turn into desert, wasteland or burnt forest, then stop using gas and use this bike  \n   * It is fast and durable, it is a mountain bike, climb mountains, jump from them, you can do better than Trials Rising in this game  \n   * It has huge [storage](https://7daystodiemods.com/tag/7-days-to-die-storage/) capacity (90 slot) because it has all extra baskets and bags (not visually but you got the idea)\n\n**Adds special beer includes useful buffs at once**\n\n* Adds water\n* Adds [food](https://7daystodiemods.com/tag/7-days-to-die-food/)\n* Adds stamina regen\n* Adds stun resistance\n* Adds cold resistance\n* Adds heat resistance\n* Adds disease resistance\n* Adds infection resistance\n* Adds experience boost\n* Cures dysentery\n* Cures infection\n* Makes digestion more efficient\n* Stops bleeding  \n   * As a side effect healing with this gives %66 less exp\n* Makes you feel dizzy  \n   * As a side effect dizzines from beer lasts %33 longer  \n   * Now dizziness time doubled but strength of visual effect reduced.\n* Adds speed boost\n* Adds bartering boost\n* Adds brawling boost\n\n**Adds new recipes to make every item above craftable**\n\n* Craft two main resources at forge (these are required to craft others)\n* Craft special beer at campfire or chemistry station\n* Craft all other blocks, tools, [weapons](https://7daystodiemods.com/tag/7-days-to-die-weapons/), ammo and apparel at workstation\n* All new recipes from this mod unlocked by default (but they can be changed easily to make learnable)\n* Crafting is not mandatory, all can be retrieved from creative menu as before\n\nOverwrites nothing, everything added as new. That’s right!\n\n**How to find in game**\n\n* Creative menu\n* Crafting\n\n**What other**\n\n* Plans for future; nothing yet (already made tons of changes without planning them actually)\n* I have a question; just ask\n* I want this and that; just ask\n* I like this mod; show your gratitude with comments and endorsements\n* Whats this version number; game version plus mod version\n* Place log spike in a ditch around your home and watch zombies dying in it, use drawbridge to pass thru the ditch yourself, reinforce ground and walls of your ditch with invulnerable steel block for ultimate protection against anything.\n\n## Changelog\n\nNote that, updating mod can cause existing items to change something else, it looks like related to game engine because i never change existing IDs. anyway it is not a big deal but you can find yourself wearing glass shards instead of shoes etc., so just check your inventory and fix it if you have such unwanted changes.\n\n**v7.2.5-A19**\n\n* Added special handgun desert vulture\n* Added special torch\n* Added special food hunter stew\n* Added special food farmer stew\n* Torch power attack effects implemented\n* Fixed knuckles power attack harvesting options\n* Knuckles block damage and range increased\n* Changed craft times (to bring some immersion)\n* Changed the ammo types special weapons can use (now you can use regular ammo with special weapons)\n* Exhanged swing sound of machete heavy and light attack as well as knuckles\n* Added elemental (explosion) resistance to helmet, tanktop, boots and shoes\n* Improved some passive and triggered effects (minor edit of some buffs like adding radiation resistance to special apparel)\n* Removed removeallnegativebuffs effect from special foods, instead added extra health bonus and matched its duration with stamina bonus\n* Changed Invulnerable blocks upgrade items (to make them vulnerable) to forged invulnerable materials (previously those were invulnerable blocks themselves)\n* Changed Invulnerable blocks repair items to forged invulnerable materials (previously those were invulnerable blocks themselves)\n* Other minor fixes\n\n**v7.0.0-A19**\n\n* Added special bicycle\n* Added special turret\n* Fixed wrong icons for special ammo bundles, now bundles show corresponding ammo’s icon.\n* Other minor improvements.\n\n**v6.0.0-A19**\n\n* Fixed special forge and special workbench (XUi was missing).\n* Added missing invulnerable steel door recipe.\n* Added special steel knuckles.\n* Added special rocket shoes and changed special rocket boots.\n* Also there are other minor changes;  \n   * Special mining helmet’s light changed,  \n   * Bartering bonus of special beer adjusted,  \n   * Special smg’s recipe changed,  \n   * Standardised code/text in items.xml,  \n   * Fixed special machete stacking issue,  \n   * Improved special shades (added attribute bonuses and loot game stage bonus),  \n   * Improved special cigar (added attribute bonuses, improved barter sell bonus),  \n   * Removed negative earth damage multiplier of special stone axe (for faster digging at early game).\n\n**v5.0.0-A19**\n\n* Fixed recipe of special trader.\n* Fixed/added recipe for special machete.\n* Improved text/code of special drink beer, created new buff for it.\n* Added special forge and workbench.\n* Added invulnerable steel door (simplistic alternative to vault door).\n\n**v4.0.0-A19**\n\n* Fixed invisible icons of invulnerable steel bars.\n* Fixed wrong model of .44 Magnum handgun.\n* Added Special Machete (to farm animal fat, leather etc).\n* Added Special Trader (Copy of Jen with different items; you can buy, sell and take jobs like any other trader, you can place her anywhere and also place as much as you want).\n\n**v3.0.1-A19**\n\nBugfix; CustomIcon parameters changed to fix invisible icons in A19 version.\n\n**v3.0.0-A19**\n\nGun parts’ names in recipes changed for A19 compatibility.\n\n**v3.0.0**\n\n* All items and blocks can be craftable now\n* Added more tools (Special Stone Axe, Special Paint Tool)\n* Added more apparel (All special; Mining Helmet, Tank Top, Shades/Sunglasses, Cigar)\n* Added more weapons (All special; Magnum Revolver, AK-47, Hunting Rifle, Double Barrel Shotgun)\n* Added more ammo (All special bullets; 44Magnum AP, 7.62 AP, Shotgun Slug AP)\n* Removed unlimited ammo (because reloading animations too good to cancel, especially hunting rifle)\n\n**v2.2.1**\n\n* Changed materials’ stats for better structural integrity.\n* Added two new blocks; invulnerable steel pillar 50 and invulnerable glass pillar 50 (look images for good usage example)\n* Changed interactable doors, hatches, gates, [bridges](https://7daystodiemods.com/tag/7-days-to-die-bridges/) stats to make remote control better, now they can be opened or closed from distance. (look images for good usage example)\n* Changed nailgun’s block damage and repair speed. (invulnerable > vulnerable upgrade mechanic now gradual and slower to prevent accidental upgrades).\n* Changed blocks behavior after fall; earlier they were trying to stick but it wasnt working well especially if fall onto player placed blocks they were breaking them (yes even invulnerable block could be shattered when another invulnerable block fall onto) now there is no such risk, blocks will just vanish when fall off, this is to prevent catastrophic events e.g. after just ceiling collapsed etc.\n\n**[Download](https://drive.google.com/file/d/1rgT0fcTzsnGYuQf-9mjlK8lmiU5cpM-B/)** for A19  \n**[Download](https://drive.google.com/file/d/15da-TgXyCkJ3c4UoeVPUNtiwFdmPKAZV)** for A18\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/21754-hs-special-things-invulnerable-blocks-special-items-special-trader-and-more/).\n\n**Credits:** Hsngrms",
  "modDownloadURLs": [
    {
      "Info": "for A19",
      "URL": "https://drive.google.com/file/d/1rgT0fcTzsnGYuQf-9mjlK8lmiU5cpM-B/",
      "Version": "v19"
    },
    {
      "Info": "for A18",
      "URL": "https://drive.google.com/file/d/15da-TgXyCkJ3c4UoeVPUNtiwFdmPKAZV",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/21754-hs-special-things-invulnerable-blocks-special-items-special-trader-and-more/",
  "modAuthors": [
    "Hsngrms"
  ],
  "modTags": [
    "7 days to die ammo",
    "7 days to die bicycle",
    "7 days to die bike",
    "7 days to die bridges",
    "7 days to die building materials",
    "7 days to die doors",
    "7 days to die drinks",
    "7 days to die food",
    "7 days to die storage",
    "7 days to die tools",
    "7 days to die traps",
    "7 days to die vehicles",
    "7 days to die weapons"
  ]
}