{
  "modURL": "https://7daystodiemods.com/ravenhearst-mod/",
  "modCreatedTime": "2021-08-15T03:44:00+00:00",
  "modLastUpdatedTime": "2021-08-15T03:46:15+00:00",
  "modName": "Ravenhearst Mod",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-ravenhearst-mod-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/04/7-days-to-die-ravenhearst-mod-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-ravenhearst-mod-additional-screenshot.jpg"
  ],
  "modShortDescription": "Welcome to Ravenhearst a place where your nightmares grow and fester and the world around you is trying to kill you at every turn.",
  "modDescription": "Welcome to Ravenhearst a place where your nightmares grow and fester and the world around you is trying to kill you at every turn. Ravenhearst is a full overhaul mod that uses the amazing 7 Days to Die and turns expectations in its head. Every aspect of the vanilla game has been tweaked or tuned to increase challenge and difficulty. Ravenhearst has often been called the mod that is not for everyone. It is best played by those that have a basic understanding of the vanilla 7 Days to Die experience, and for those looking to challenge themselves.\n\nBelow you will learn just a little bit about what they have to offer. Keep in mind that Ravenhearst, just like the actual 7 Days to Die game, is nowhere a near finished experience and it’s development is ongoing, and as such should be played with the open mind that there can be major updates that will cause save breaks and resets to your game. They pride themselves on using team of testers to thoroughly play and beg test so that they can provide you with the most solid gaming experience they can manage to put forth. But also keep in mind as with anything, things can happen. They just try to reduce these “things”.\n\n## This Place Seems Familiar… Yet Not\n\nFor those of you that have pined for modded gameplay on the map that is the heart of 7 Days to Die, Sinder has created our own copy of Navezgane. It’s also a good smaller (6k) pre-made map for those with less powerful systems, or are impatient on a 20 minute world generation.\n\n## Features\n\n* Freshly laid out towns, cites and hubs, bringing new life to old scenes.\n* Adds over 200 unique prefabs to the map.\n* 19 additional T5 pois… hazmat still required!\n* Additional Wasteland city, not for the faint of heart!\n\n## All the Worlds a Stage\n\nThe ENTIRE game is now gamestaged. Until gamestage 5, you will see slightly weaker versions of zombies in the world, helping to bridge the gap into Ravenhearst. The incredibly talented wOOkie nOOkie has enabled him the chance to gamestage every aspect of the game. Wilderness Spawns, Wandering Hordes, Biome Spawns, Night Time Spawns ALL of it is now set according to your gamestage so you wont see ferals or cops on Day 2\\. Not until you reach over a certain gamestage. Night Terrors do not spawn pre Gamestage 50\\. Gamestage tiers are as follows:\n\n* GS1 – Normal Zeds\n* GS50 – Tier 2\n* GS100 – Tier 3\n\nThis ensures you do not get overwhelmed and also that the challenge increases as your level increases.\n\n## The Night Bleeds\n\nThe nights in Ravenhearst are full of disgusting creatures and terrifying sounds. Night Walkers are [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) who seek blood and are faster than a normal zombie. But fear not they disappear by morning… until you grow stronger. As your gamestage increases so do the chance that they will remain in the world!\n\n## Wookies Suite of DLL Harmony Tweaks\n\nIt goes without saying that wOOkie nOOkie has been a major driving force behind Ravenhearst. He has designed a host of dll tweaks to game mechanics to increase difficulty and functionality. By enabling Harmony usage at the very start of 5.1 development he opened up doors for us never thought of before. Here is a sampling of what he has done:\n\n### Anti Nerd Poling\n\nNo longer can you jump and place frames. You have to plan out your builds with ladders and other blocks now. More realistic and challenges people to come up with new ways of overcoming challenges.\n\n### Recipe Ingredient Limit Removal\n\nRecipes can now have dozens of ingredients so we are no longer restricted to 5\\. If a recipe has [more](https://7daystodiemods.com/tag/7-days-to-die-more-slots/) than 5 there will be an arrow below the description you can click. It will scroll through the pages of ingredients.\n\n### Blood Moon Vehicle Disabled\n\nTheir mod introduces challenges they expect players to face. Vehicles will become disabled on Horde Night. Bicycles will still work. Think of red moon and horde night like an EMP bomb, electricity is whacked during it.\n\n### Combine\n\nThe workbench now has Combine returned. You can now store your damaged [tools](https://7daystodiemods.com/tag/7-days-to-die-tools/) and weapons and reuse them to repair similar items later on with minimal quality loss. The combiner will not combine for a QL higher than your highest weapon though. No need to worry about your mods either, a message will pop up alerting you if you have a mod installed so it will not destroy it.\n\n### Skill Points Bonus\n\nYou will now gain 2 Skill Points every 10 levels as a boost to your perks. You can use these points just like any other and they are automatically added. So every 10 levels you have something to look forward to!\n\n### Gamma Limiter\n\nThis may cause some controversy but they have set a limit on Gamma to 75\\. The reason for this is they have noticed players jacking their gamma up so they can see in house and at night. Some of these pois were designed with shadowy dark corners in mind. A little gamma bump is ok but bumping to 100 defeats the work put in by our POI makers. This is till open to some editing and tuning.\n\n### Trader XP Removal\n\nYou will no longer level your Player by selling items. This is a gameplay decision made by him. He want actions to count for your level not selling to [traders](https://7daystodiemods.com/tag/7-days-to-die-trader/). Other aspects of traders are the same… for now.\n\n### Shared XP Limiter\n\nWhen shared party XP first released they all assumed that it would be for questing and groups who work together. Recently it is accounting for people who do not level their weapons or skills but gain levels from party [XP](https://7daystodiemods.com/tag/7-days-to-die-experience/). This has led to complaints of tough zombies and unfair gamestages. They have hardcoded the xp sharing to 200M. The reason is gamestage related. Too many undergeared, under powered players who dont go questing with their partners are getting killed by zombies at the gamestage when their skills are not ready.\n\n### Modified Descriptions\n\nNow the station something is crafted in and the tool you need are automatically displayed at the end of every description. Descriptions will also display the number of slots an item has.\n\n### Airdrop Spawning\n\nZombies will now spawn dependent on gamestage at airdrops. You will have to fight your way to the airdrop.\n\n### Quest Increases\n\nYou can now see more quests in the trader window and he will offer quests below the tier you are on as well.\n\n### Loot Window Searching\n\nNow you can search your storage inventories with the addition of a search box.\n\n### Quest Crafting Warning\n\nA message will display if you leave a table while crafting an item needed to complete a quest.\n\n### Reverse Rotation\n\nQoL addition that allows you to reverse a rotation on blocks placed using LeftShift and LeftMouseClick.\n\n### Stash Backpack\n\nThe original stash [backpack](https://7daystodiemods.com/tag/7-days-to-die-backpack/) you know and love designed by wookie.\n\n### Vehicle Pickup Disable\n\nRealistic weights on vehicles. You can no longer pick up and store your heavy [vehicles](https://7daystodiemods.com/tag/7-days-to-die-vehicles/). Bicycles can be picked up. Be careful while driving and prepare to dig a vehicle out if it is stuck.\n\n### All New Game Options\n\nYou can set quest fetches to show indicators on the map, enable headshots only mode, control the size and frequency of wandering hordes, increase range zombies can see you at and enable or disable rage. These settings work on servers as well and a rh\\_gameoptions file is included in the Extra Files folder.\n\n#### POI Zombie Multiplier\n\nZombies will now spawn around groups of pois, making cities dangerous. You can control the multiplier in settings.\n\n#### New Video Options\n\nField of view setting, show crosshairs, change the color of crosshairs or completely disable activation texts for a true clear hud.\n\n#### UI selection\n\nRH comes packaged with several popular UI. You can choose the UI you wish to use under Video Options and restart your game. You can change your ui at any time.\n\n## Other Code Monkeys\n\nRavenhearst also includes other coding changes that will impact gameplay.\n\n* Redbeard Ingredients will now allow you to click an ingredient in the recipe list to link you to how to make that ingredient. He has also created a fantastic transparent paper doll that pops up to let you know you have armor that needs to be repaired (below 50%).\n* Bar0th Keep Blood Moon will no longer kill off your Horde on BM when you die.\n* Sphereiicore is also used as is his Take and Replace, random zombie walks and disable trader protection. Thats right, traders are always open but no longer are invulnerable!\n\n## Living Off The Land\n\nFarming has received an overhaul. Farm plots are now an end game goal and allow you to grow underground. Water is required for the plots to grow. The Farm Table is where you can craft seeds from crops or from seed packs you find out in the world.\n\nThey have added back in Fertilizer, the Composter and yes Turds. Fertilizer made from the compost can be used on existing crops to increase yield. When destroyed, the crop returns to an unfertilized state, to be fertilized again.\n\nGround [farming](https://7daystodiemods.com/tag/7-days-to-die-farming/) with a hoe has been brought back! Water will now deplete as your crops grow. You can work towards an irrigation pipe system. Irrigation will prevent water from being depleted.\n\nMultiple new crops have been added like wheat, tomatoes, lettuce and more and these crops have been integrated into recipes new and old.\n\n## Infection Matters\n\nWhen you are infected it will now kill you within 3 days. You MUST find a cure for your infection. It will persist through death. If you do not find a cure it will kill you. Chewing glass no longer represents a cure. Beehives can be made once the schematic is found. Tree stumps in the world have a chance to drop honey combs which can be crafted into honey to lower infections. This zombie apocalypse is very real and very dangerous.\n\n## Too Much Too Soon\n\nLoot has undergone a complete rebalance (and may again in future versions) so that you are not swimming in loot early game. Scavenging and exploring now matters as you hunt for the best weapons and tools. Loot lists have been readjusted so they make more sense to what you would find in them.\n\n## From My Cold Dead Hands\n\nIn the ongoing quest to preserve what they love about 7 Days, they have readded some pulled game mechanics. Parts for guns are as they were with each firearm having specific parts you need to find to assemble a weapon like frames, handles and cylinders. More returns to former mechanics loved by many is ongoing for future updates.\n\n## Progression That Means Progressing\n\nLevelling has been slowed down quite a bit to give the old way of doing things more prominence. You need to get out there and work those quests and use those weapons. All main attributes are now Player Level dependent. Perks have been rebalanced so as not to give the appearance of a character becoming Superman by Perk 5 of everything.\n\nProgression becomes way more exciting with the addition of unlockable recipes for every Action Skill. Every 20 levels of a skill will offer an unlock of a tool and weapon to that specific skill. So as you level and increase your Action Skills you will learn more recipes from the skill you are perfecting.\n\n## Actions Speak Louder Than Perks\n\nAction Skills have returned. Along with Quality you will receive a slight bonus in stats every time you level an Action Skill. This is Learn by Doing. Use axes and picks to level Construction, Bows to level Archery, Blades to level…. well Blades. You can keep track of your Action Skills progress on the skills screen.\n\n## Quality Control\n\nQuality has been returned to 7 Days to Die thanks to @wOOkie nOOkie and his coding genius. Each tool and weapon now has a quality level. 1-1000.\n\nEach 20th level is considered next tier and every single item has had stats attached to them so that finding new weapons and tools is no longer a boring process. Loot is exciting again! Find level 72 pickaxe, but know there are better out there. This will promote leveling as well as scavenging.\n\nBut beware. You will need to increase your main Construction Skill because every repair will cost you 100 Quality Points. Every 20 levels of Construction Skill will drop that by 20 points. So Construction Level 20 will drop the penalty to 80 QP. Const Level 40 will drop it to 60 QP Loss and so on. Save old or found tools to reduce this quality hit early on using the combine feature in the workbench mentioned above.\n\n## Better Watch That Weapon Boy\n\nAlong with Quality returning they have Degradation returning as well! Thanks to @wOOkie nOOkie your weapon and tool will now degrade by 100 Quality Levels each time you repair it at the start.\n\nOn top of this they have taken care of any mods that are in your item or [weapon](https://7daystodiemods.com/tag/7-days-to-die-weapons/). If when repairing a weapon the quality reduction results in a lose of a mod slot any mod in that lost slot will be placed in the players inventory. Be careful to have a spare slot though as a full bag and inventory will result in the mod falling on the floor!\n\nSo how do you salvage this? By leveling Construction Tools. Each 20th level of Construction Tools after level 20 reduces that number by 20\\. So level 21 in Const Tools you will lose 80 Durability and so on. A true progression system.\n\n## The Home You Have Always Dreamed Of\n\nRavenhearst likes to pride itself on being a builders dream mod. They have added dozens of new deco items for you to craft and decorate with, a number of new player storage options, movie posters you can collect, art you can collect, tvs, holiday items, playable radios and record players, streamer logos and flags as well as made previously unavailable vanilla deco items accessible for crafting in their Decor Table. They are constantly adding new items as well.\n\nApart from over 50 new deco blocks he has also created several new block placeholders for poi makers. From new corpses to arcade and slot machines to miscellaneous trash decos like bullets and blood and liquor bottles and posters and potted plants, new mail box and trash can placeholders, now POI builders who wish to make RH specific pois can design them with variety in mind.\n\n## Film Buff\n\nYou will find many collectible posters in the world, ranging from movies to TV shows to art pieces. The selection is ever changing ad growing and fit perfectly in the basement of your shelter!\n\n## Backpacks\n\nThe backpack [perk](https://7daystodiemods.com/tag/7-days-to-die-perks/) is now gone. In its place are backpacks that you can find in the world that unlocks three slots at a time to your inventory. These can be found in dressers, semis and other clothing related loot spots.\n\n## The Journal\n\nThey have introduced a quest based player journal that will take you on a questline all while teaching you the basic added mechanics of Ravenhearst. If you complete all the chapters of this journal you will receive exclusive recipes to craft some pretty cool items. The journal is not meant to be rushed through, rather it is meant to compliment your journey so do not worry too much about finishing it immediately.\n\n## Starvation\n\nFood and [water](https://7daystodiemods.com/tag/7-days-to-die-drinks/) have undergone a major rework. Food values have been rebalanced, new food added, animals rebalanced for their meat yields and now they give red or white meat. Water is also now contaminated and you will need to build a water filtration unit to decontaminate it before you can drink it safely.\n\n## POI Wonderland\n\nTheir dev Sinder has put in overtime to update and redesign all of your favorite pois from Compo Pack, including adding quite a few new pois from some of the best poi makers in the community.\n\nEven older pre 17 pois have been carried over and shown love to fit in the modern world. Aside from those pois, they have included RH-community made pois from the likes of Evilraco0n, jarobus, Zyncosa, KnightRath, FallenDice, Yakov, Cjens and Sinder herself. Along with all new sleepers and loot spots as well as new paint and decos, there are new farms and crop patches as well as several new pois based on famous locations such as The Evil Dead, The Haunting of Hill House and more. The world is fuller than ever!\n\n## You Have Some Red on Ya\n\nZombies come in many forms. They have added additional looks to zombies. Higher tiered zombies will sound different so you can tell them apart. There are boss creatures spread around the world in special locations like Robleto and Snufkins The Mummy and the Scarecrow. Night Terrors make their return as well, with favorites such as The Butcher, The Prisoner and the Mechanic haunting the nights and preparing to drink your blood.\n\n## Complex Crafting\n\nRavenhearst has always been about more realistic crafting and this version is no exception. At start you are given a Personal Workbench. This is your hub for all things crafting. The backpack has very limited recipes, just the absolute basics. You will need to carry this table with you. It can be picked up easily by destroying it.\n\nThey have added workbenches and stations such as the Farm Table, the Armor Bench, The Ammunition Table, The Water Filtration Unit, Survival Campfire, Mechanic Bench, Research Table and the Decor Table, all with its own uses and recipes. This will help you find what you are looking for better and also spice up that basement work area.\n\nAlong with the stations, there are complex recipes such as tool heads for crafting tools, molds for forge crafting and vehicle parts. Vanilla recipes have all been changed to reflect new materials such as screws, tarps, twine and recipes like concrete and cobblestone have been made more complex.\n\n## Vehicular Homicide\n\nThey have reworked how vehicles are made completely. You will need to find engine parts and more from harvesting vehicles with the crowbar. There is now an Mechanic Bench and those are used to construct parts. You will have to build chassis from scratch using parts like car seats, alternators, sparkplugs and more.\n\nThey have also added over a dozen new vehicles for you to collect such as community favorites from bdubyah like the Box Truck and Jeep as well as Snufkins extremely popular server vehicles! All of these vehicles have their own unique assemblies and parts and are locked behind schematics you must find in the world.\n\n## Barnes and Noble? Where!\n\nAll schematics now scrap into Knowledge Points, which can be used with Ink found in the world in the Research Desk to craft any missing recipes and perk [books](https://7daystodiemods.com/tag/7-days-to-die-books/).\n\nThere is also a set of limited edition novels you can find in the world made by sinder that scraps into some paper for you to use. True collectors may find value in finding all of the novels left in the world. Some book stores or Research Facilities may have remnants of working Research Desks so make sure to search all of them.\n\n## Legacy Distant Terrain Integrated\n\nTheir mod utilizes Sphereii’s Legacy Distant Terrain, which disables the A18 way of generating distance in terrain in favor of the much less resource heavy A17 way. This will give us a dramatic increase in performance across the board.\n\n## Radiation\n\nYou will notice green smoke filled areas on your journey. This represents a Tier 5 POI that is radiated.\n\nThere is no way to explore these without a hazmat suit, which can then be upgraded to an armored hazmat suit. Inside you will find military crates and chests that house end game weapons, tools, schematics and resources that can not be found in normal areas. Do not tackle these pois too early though. They are extremely dangerous.\n\n## The Bandits Are Coming\n\nThe world is now a little more dangerous as bandits will now roam freely. You will also be able to find some Survivors that you can hire for some extra protection.\n\nRavenhearst has always been a labor of love for JaxTeller718, but it also has been a labor of love for many others as well, without whom this mod would not be possible.\n\n## KingGen Maps\n\nThey are proud to support KingGen Maps! Below is their poi file including all vanilla pois for use with [KingGen](https://7daystodiemods.com/kinggen/). Please download the appropriate verion.\n\n[KingGen Ravenhearst POI List Version 7.6.1.1](http://jax.gamepatchercreator.com/Downloads/RHKingGenPOI_v7611.txt)\n\n## Ravenhearst Launcher\n\nRavenhearst now has its own launcher that you can use to start the game, visit links, stay up to date on news and download patches without having to redownload the entire mod. Here is how to use it.\n\n1. Clear 7 days data and steam folder\n2. Switch to 19.6 stable in the beta properties of 7 days or make sure you are on latest stable and download.\n3. Make a special 7 days folder somewhere. It can be named anything. Devs find it useful to name it RH and date it or version number it. Example RH\\_7\\_6\\_1 or something similar.\n4. Copy vanilla 7 days from the steam folder into the folder you created and named.\n5. [Download the launcher](https://gitlab.com/jaxteller718/rhlauncher/-/archive/main/rhlauncher-main.zip) and when it asks during install where to install it, choose the 7 days folder you made. Read the next step before starting the launcher.\n6. If you do not want to dl the entire mod from the launcher [download the git version](https://gitlab.com/jaxteller718/rh_76_client/-/archive/main/rh_76_client-main.zip) and copy it into your new folder\n7. Double click the RHLauncher.exe icon to start it.\n8. If you did not download the git it will ask you to download the mod. Do so.\n9. If you DID download the git first it will ask you to update so it can sync you to the patch server. Do so. First time sync can take a while.\n10. That’s it. Start the mod through the launcher. In the future when a patch becomes available it will ask you if you want to update. You can choose to update or cancel to skip and stay on the version you are on.\n\n## Development Team\n\n* Sinder – POI Design and Redesign/QA/Art/Documentation\n* WookieNookie – Coding/Programming/Harmony Implementation\n* shortypants1976 – Balance and Design/Test/Coffee Fueler\n* VvRaynevV- Balance/Test/XML\n* Fox-143 – Balance/Test\n\n## Testing Team\n\n* godjen99\n* romper\n* DandelionGames\n* Yakov\n* Constip\n* rembomy\n* Ryper\n* BigAl\n\n## Dev Hall of Fame\n\n* dancapo\n* FallenDice\n* 2ndRecon\n* Bradmin\n* Makabriel\n* KnightRath\n* Robear\n* Shades\n\n## Discord and Support\n\nJaxTeller718 is not sure all of you are aware of the health struggles he has been going through for the past year. He has kept it off the forums. If you wish to read about what him and his wife shorty have gone through there is a detailed diary on their Discord in the jax and shorty updates channel. 7.6 was a labor of love for him and was released despite the difficulties of maintaining a work flow. He is extremely proud of his work, and his teams work on this one. With 7.6 he will no longer be able to provide daily fixes and work on the mod. This is not to say he wont be updating or working on it but due to deteriorating health he simply can not be as present as he has been. He hope you understand. RH is not done, just slower for the time being until he can get his life back on track.\n\nThey look to forward to hearing what you think, and to helping them to shape the best experience possible for you. His time on forums is very limited and the majority of his development team has moved to Discord only. If you would like your questions answered quickly please join their [Discord](https://discord.gg/YBHD9f3). They have an amazing community of fellow RH veterans and new players alike that are always willing to help out and offer tips and advice, as well as himself and his team checking in daily.\n\n## Changelog\n\n**Ravenhearst 7.6.1.1 for Alpha 19.6 b8 Stable Has Released**\n\nNo wipes Needed.\n\n**Patch 7.6.1.1 for A19.6 b8 Stable**\n\n* Addition: Our own Ravenhearst Launcher which will handle patches, updates and installs.\n* Addition: Valmars Foods Modlet\n* Addition: Food Spoilage (See Read Me For Full Details)\n* Addition: Better Ramps for Vehicles\n* Addition: Mining Machine by StallionsDen\n* Addition: Fertilized Seeds. Right click planted seeds with fertilizer in hand to upgrade to Fertilized Seed. They will yield more crops and also when punched will downgrade to a normal version of the seed you can fertilize again.\n* Addition: RH 5 Foods\n* Addition: New Loading Screen Tips\n* Addition: New Journal Quests Explaining RH Mechanics\n* Addition: Appliance Table\n* Addition: Food Prep Table\n* Addition: Oil Refinery\n* Addition: 3 new trader quests\n* Addition: Military Backpack crafted from 10 backpacks that unlock last row of slots after you have unlocked the default RH amount.\n* Addition: Lathe\n* Addition: Advanced Turrets Modlet adds 3 new turrets\n* Addition: Jax Mastery Modlet that extends perks in all areas. These are unlocked after Level 10 of Skills and Level 100 of Action Skills.\n* Addition: Toads Vehicle Mods found in loot and trader\n* Addition: Ravenhearst Food and Resources to trader\n* Addition: High Powered Engine crafted only for late stage vehicles\n* Addition: Honey and Shiv steps to open quest\n* Addition: Additional Motorcycles in T5\n* Addition: Better Book Icons\n* Addition: Bandages are now dirty and need sanitized\n* Addition: King Gen Maps\n* Addition: New Trader Jobs\n* Addition: Invisible Armor Dye Modlet\n* Addition: New Phone Quest\n* Addition: NPC and Traders\n* Addition: Over 10 New Bdubya Vehicles\n* Addition: Lathes added to a very few late game pois\n* Addition: Armor UI Added by Redbeardt. Will now show a display on screen when armor is going to break.\n* Addition: Twitch Modlets to kill Fox with\n* Addition: Hazmat Gears now show armor values\n* Addition: 4 Potted Plants\n* Addition: Electrician Table for electrical devices such as new lights and signs and speakers.\n* Addition: Ammunition Table added to select POIs\n* Addition: Actual Ore Added to World for all of our ores\n* Addition: Containers to slow down the spoilage process\n* Balance: Buffs for sprains are changed to 5 minutes and the broken, concussion, and laceration are changed to 30 minutes\n* Balance: Created Tier 0 Zombies with less health than vanilla. Tier 0 will last until gamestage 5 and will be reduced spawns. This will provide a relief on Day 1 spawns and hopefully make for a smoother opening transition to our zombies post GS5\n* Balance: Readjusted All Vehicle Healths\n* Balance: Adjusted Tool Craft Timers\n* Balance: Extended Phone Quest Respawn Times\n* Balance: Reduced amount of meat steel knuckles harvest\n* Balance: Turret Overhaul. Less damage, less distance and perk reductions\n* Balance: Reduced Craft time on PWB\n* Balance: Slot Balances on all storages\n* Change: Table Saw now unlocked via quest\n* Change: Table Saw Now Requires Fuel\n* Change: Thumper Event completely reworked by VvRaynevV\n* Change: New Fishing System\n* Change: Opening Quest Rearranged\n* Change: Farming Journal Updated\n* Change: Sugar now made from Honeycomb\n* Change: Storage can no longer be picked up\n* Change: Expanded Loading Screen Tips by foxcheckman\n* Change: Weapon class quests now give a completed certificate to use in the Journal Completion Recipe\n* Change: Oil Refinery and Mining Machine Now Journal Completion Rewards\n* Change: Ammo Ingredients now given as reward for completing gun quests\n* Change: Added RH weapons to class quest lines\n* Change: Lessened Fog\n* Change: Lightened Moon Light\n* Change: Lightened Nights\n* Change: Removed weapon quests from starting quest and added read class paper step\n* Change: Integrated Parkour into Athletics\n* Change: Bone Fragments added to birds nest destroy\n* Change: New Potted Plants to random plant spawner in houses\n* Change: Riles UI Now Default. You can still change to other uis via menu\n* Fix: Discrepencies in journal and tips for Irrigation\n* Fix: Reach on Behemoth Lessened\n* Fix: Removed Bad POI Name\n* Fix: Pallets Breaking Back to Iron pallets\n* Fix: Improper Class Quest orders\n* Fix: Tree Sap Scrapping\n* Fix: Redbeardts Linux Fixes for Active Ingredients\n* Fix: Fall Damage\n* Moved: Boating Modlet\n* Moved: Vehicle Paint Job\n* Moved: CCTV\n* Moved: Unnecessary But Beautiful\n* Removed: Skins for Tiered Zombies (Performance Heavy)\n* Removed: Telric Pois\n* Removed: Duster\n* Removed: Maybell’s Ranch and Horses\n* Removed: Fpshud due to not being updated\n* Code Changes (The following are code changes done by W00kieN00kie)\n* Addition: Reset Progression now doesnt reset the Action Skills and Pack Mule levels when using the Forgetting Elixir. The Action Skill Crafting are still reset though as they are just skill points and hence can be relearned with points.\n* 2 Ravenhearst 6k pregenned Maps and 2 8k Ravenhearst pregenned maps made by himself\n* RH Navezgane\n* Removed: Maybell’s Ranch\n* Added: 17 Additional Pois\n* Newly Added Pois (All of the following pois here have been checked, deco added, adjusted footprints, sleepers sweep, loot overhaul etc by Sinder and are new to Ravenhearst)\n* POI: Added rh\\_medieval\\_Alchemist(by\\_VitaminE)\n* POI: Added rh\\_House\\_Burrowsby\\_Nauti\\_Angel)\n* POI: Added rh\\_govt\\_CDC\\_Mission(by\\_TheFootpad)\n* POI: Added rh\\_mili\\_Quarantine\\_Bunker(by\\_NLBEagle)\n* POI: Added rh\\_mili\\_flight\\_tower(by\\_NLBEagle)\n* POI: Added rh\\_mili\\_FuelStation(by\\_NLBEagle)\n* POI: Added rh\\_HBW\\_MetroStation(by\\_Hydro)\n* POI: Added rh\\_school\\_MidwichElementary(by\\_Dragoness)\n* POI: Added rh\\_mili\\_Quarantine\\_Post(by\\_NLBEagle)\n* POI: Added rh\\_industry\\_PowerPlant\\_Kam(redoBy\\_sinder)\n* POI: Added rh\\_attr\\_SkiResort\\_Bar(by\\_NLBEagle)\n* POI: Added rh\\_food\\_Small\\_Cafe(by\\_Bostonlondon)\n* POI: Added rh\\_govt\\_Pentagon(by\\_Nauti\\_Angel)\n* POI: Added rh\\_mansion\\_serial\\_killer(by\\_FLESHUS)\n* POI: Added rh\\_medieval\\_house\\_pigeon(by\\_VitaminE)\n* POI: Added rh\\_medieval\\_business\\_Bakery(by\\_VitaminE)\n* POI: Added rh\\_medieval\\_Tower(by\\_VitaminE)\n* POI: Added rh\\_transit\\_BusStation(by\\_Dragoness)\n* POI: Added rh\\_warehouse(by\\_NLBEagle)\n* POI: Added rh\\_food\\_KFZ\\_001(by\\_Evilracc0on)\n* POI: Added rh\\_food\\_KFZ\\_002(by\\_Evilracc0on)\n* POI: Added rh\\_settlement\\_TWD\\_Woodbury(by\\_SurvivorAndy)\n* POI: Added rh\\_trailer\\_001(by\\_Evilracc0on)\n* POI: Added rh\\_trailer\\_002(by\\_Evilracc0on)\n* POI: Added rh\\_trailer\\_003(by\\_Evilracc0on)\n* POI: Added rh\\_trailer\\_park(by\\_Evilracc0on)\n* POI: Added rh\\_business\\_strip\\_old\\_10(by\\_Deverezieaux)\n* POI: Added rh\\_food\\_KFZ\\_003(by\\_Evilracc0on)\n* POI: Added rh\\_Hill\\_House(by\\_Captain\\_and\\_Mental)\n* POI: Added rh\\_House\\_At\\_The\\_Lake(by\\_Rukminesh)\n* POI: Added rh\\_house\\_duplex\\_old\\_01\\_Blue(by\\_Deverezieaux)\n* POI: Added rh\\_house\\_duplex\\_old\\_03\\_brown(by\\_Deverezieaux)\n* POI: Added rh\\_house\\_duplex\\_old\\_05\\_burned(by\\_Deverezieaux)\n* POI: Added rh\\_house\\_LB\\_003(by\\_EvilRacc0on)\n* POI: Added rh\\_industry\\_Oil\\_Well(by\\_Rukminesh)\n* POI: Added rh\\_mansion\\_House\\_OfThe\\_Forest(by\\_Rukminesh)\n* POI: Added rh\\_store\\_general(by\\_mexico664)\n* POI: Added rh\\_house\\_DaveHome2(by\\_DMC)\n* POI: Added rh\\_Eden\\_Center\\_Mall(by\\_DOD)\n* POI: Added rh\\_medieval\\_Jarls\\_Estate(by\\_Eihwaz)\n* POI: Added rh\\_superstore\\_Tesko\\_Supermarket(by\\_SurvivorAndy)\n* POI: Added rh\\_Army\\_Camp\\_Heli\\_Base\\_01A(by\\_NLBEagle\\_KrunchEdit)\n* POI: Added rh\\_Asia\\_Pagoda\\_sm\\_01(by\\_magoli\\_KrunchEdit)\n* POI: Added rh\\_apts\\_Styles\\_Apartment\\_Complex(by\\_JSDoctor\\_KrunchEdit)\n* POI: Added rh\\_Army\\_Garage(by\\_NLBEagle\\_KrunchEdit)\n* POI: Added rh\\_Army\\_Camp\\_HQ\\_01A(by\\_NLBEagle\\_KrunchEdit)\n* POI: Added rh\\_business\\_Corner\\_Diner(by\\_NLBEagle\\_KrunchEdit)\n* POI: Added rh\\_business\\_Corner\\_Gunstore(by\\_NLBEagle\\_KrunchEdit)\n* POI: Added rh\\_business\\_Corner\\_Pizza(by\\_NLBEagle\\_KrunchEdit)\n* POI: Added rh\\_store\\_Bite\\_Aid\\_Pharmacy\\_01(by\\_zztong)\n* POI: Added rh\\_school\\_beauty\\_01(by\\_Deverezieaux)\n* POI: Added rh\\_skyscraper\\_government\\_01(by\\_Deverezieaux)\n* POI: Added rh\\_Bar\\_Pool\\_Hall\\_01(by\\_zztong)\n* POI: Added rh\\_house\\_Brownstones\\_01(by\\_zztong)\n* POI: Added rh\\_house\\_Cabin\\_Fort\\_01(by\\_zztong)\n* POI: Added rh\\_attr\\_Drive\\_In\\_Movie\\_Theater\\_01(by\\_zztong)\n* POI: Added rh\\_food\\_store\\_Drive\\_Thru\\_01(by\\_zztong)\n* POI: Added rh\\_medical\\_EMS\\_01(by\\_zztong)\n* POI: Added rh\\_attr\\_wild\\_Famers\\_Market\\_01(by\\_zztong)\n* POI: Added rh\\_House\\_01(by\\_zztong)\n* POI: Added rh\\_House\\_02(by\\_zztong)\n* POI: Added rh\\_business\\_KZMB\\_Radio(by\\_zztong)\n* POI: Added rh\\_business\\_Law\\_Offices\\_01(by\\_zztong)\n* POI: Added rh\\_business\\_Propane\\_01(by\\_zztong)\n* POI: Added rh\\_Trailer\\_Park\\_01(by\\_zztong)\n* POI: Added rh\\_industry\\_Lumber\\_Yard\\_01(by\\_zztong)\n* POI: Added rh\\_industry\\_Masonry\\_Yard\\_01(by\\_zztong)\n* POI: Added rh\\_business\\_Office\\_Bldg\\_01(by\\_zztong)\n* POI: Added rh\\_Church\\_L4D\\_DT(by\\_CraterCreator)\n* POI: Added rh\\_house\\_cabin\\_L4D\\_DT(by\\_CraterCreator)\n* POI: Added rh\\_wild\\_industry\\_Tower\\_L4D\\_DT(by\\_CraterCreator)\n* POI: Added rh\\_industry\\_outpost\\_rust(by\\_cjens)\n* POI: Added rh\\_medical\\_Doc\\_Jen\\_Clinic(by\\_Evilracc0on)\n* POI: Added rh\\_house\\_abandoned\\_11(by\\_Deverezieaux)\n* POI: Added rh\\_house\\_03(by\\_zztong)\n* POI: Added rh\\_food\\_Restaurant\\_01(by\\_zztong)\n* POI: Added rh\\_z57\\_Army\\_04\\_Silo(by\\_Zyncosa)\n* POI: Added rh\\_z53\\_House\\_14(by\\_Zyncosa)\n* POI: Added rh\\_house(by\\_Yakov)\n* POI Fixes by Sinder\n* POI: Military Tunnels – Removed garbage deco causing truck to float. reworked sleeper volumes to not dupe spawns.unused sleeper blocks now covered by volumes. added some sleepers to compensate loss of dupe spawns. changed some volumes to attack. small loot additions.\n* POI: Junkyard – Fixed glitchy sleeper, shuffled deco and loot.\n* POI: Little League Baseball Shelter – Removed modded cars. Increased zombies a touch.\n* POI: Vet Clinic – Removed modded cars, redid sleepers a bit\n* POI: Museum of Fear – Removed old blue car from exhibit, replaced with broken glass, 1 tire, and a motor.\n* POI: Bowling Center Mesh Redone\n* POI: No Hope Mall – Removed 2 “Ravenhearst car spawners”\n* POI: Walcart- Removed offending fetch container, but moved all other fetches to new locations. upped sleepers a bit.\n* POI: Pre-trader – Removed trader quest, linked some of the volumes so spawning might be better. fixed two volumes from over-calling sleeper amounts.\n* POI: Walking Dead Prison – Removed some trees from border to better see prison and rad smoke. added 4 more smoke locations to perimeter so more obvious.\n* POI: Trailer Park – Fixed air slice on side of poi\n* POI: Removed 2 Passive volumes from Midwich\n* POI: Removed missing rugs from Museum\n* POI: Moved Stuck Sleeper in Army Pois\n* POI: All tier 5 pois reviewed to fix volumes from over-calling sleeper amounts\n* POI: Added proper “showquestclear” counts to all tier 5 pois. Will work on adding these to all pois over time.\n\n## Important\n\n**WARNING:** This is an overhaul mod and as such is not intended to work well with modlets. If you use a modlet you do so at your own risk. There is a possibility your game may break or even your save. They can not troubleshoot any errors related to the use of outside modlets. There are just too many core changes to guarantee any will work well within their mod.\n\n**EAC must be disabled** to play this mod.\n\n**[Download](https://gitlab.com/jaxteller718/rh_76_client/-/archive/main/rh_76_client-main.zip)** Client/SP Files  \n**[Download](https://gitlab.com/jaxteller718/rh_76_server/-/archive/main/rh_76_server-main.zip)** Server Files  \n**[Download](http://jax.gamepatchercreator.com/Downloads/rh_gameoptions.xml)** Custom Options for Servers _(Required for Server Owners. Ravenhearst comes packaged with a custom server options that you need to use in order to use our custom settings. It is placed in the Data/Config folder on your server.)_  \nAlso available on the mod launcher!\n\nIf you appreciate JaxTeller718’s work on Ravenhearst feel free to use this [donate link](https://www.paypal.me/FrankCirabisiJr) to show support. Donations go towards the acquisition of new Unity Assets as well as test servers etc, or even just a small show of appreciation with pizza! Pizza always makes smiles. They also have a Patreon set up for those who wish to offer ongoing support for development. You can check that out [here](https://www.patreon.com/ravenhearstmod).\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/4508-ravenhearst-mod/).\n\n**Credits:** [JaxTeller718](https://7daystodiemods.com/tag/jaxteller718/), Telric, Sirillion, Magoli, Stallionsden, Riles, Scomar, SphereII, Alfacinha, Guppycur, Khelldon, Psousza4(MeanCloud), Genosis, Eihwaz, Bdubyah, DMC, Axebeard, OrbitalBliss, KhaineGB, Hernanxx",
  "modDownloadURLs": [
    {
      "Info": "Clear 7 days data and steam folderSwitch to 19.6 stable in the beta properties of 7 days or make sure you are on latest stable and download.Make a special 7 days folder somewhere. It can be named anything. Devs find it useful to name it RH and date it or version number it. Example RH_7_6_1 or something similar.Copy vanilla 7 days from the steam folder into the folder you created and named.the launcher and when it asks during install where to install it, choose the 7 days folder you made. Read the next step before starting the launcher.If you do not want to dl the entire mod from the launcher download the git version and copy it into your new folderDouble click the RHLauncher.exe icon to start it.If you did not download the git it will ask you to download the mod. Do so.If you DID download the git first it will ask you to update so it can sync you to the patch server. Do so. First time sync can take a while.That’s it. Start the mod through the launcher. In the future when a patch becomes available it will ask you if you want to update. You can choose to update or cancel to skip and stay on the version you are on.Download Client/SP Files",
      "URL": "https://gitlab.com/jaxteller718/rh_76_client/-/archive/main/rh_76_client-main.zip",
      "Version": "v19"
    },
    {
      "Info": "Server Files",
      "URL": "https://gitlab.com/jaxteller718/rh_76_server/-/archive/main/rh_76_server-main.zip",
      "Version": "v19"
    },
    {
      "Info": "Custom Options for Servers (Required for Server Owners. Ravenhearst comes packaged with a custom server options that you need to use in order to use our custom settings. It is placed in the Data/Config folder on your server.)",
      "URL": "http://jax.gamepatchercreator.com/Downloads/rh_gameoptions.xml",
      "Version": "v19"
    },
    {
      "Info": "Also available on the mod launcher!",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/4508-ravenhearst-mod/",
  "modAuthors": [
    "JaxTeller718",
    "Telric",
    "Sirillion",
    "Magoli",
    "Stallionsden",
    "Riles",
    "Scomar",
    "SphereII",
    "Alfacinha",
    "Guppycur",
    "Khelldon",
    "Psousza4(MeanCloud)",
    "Genosis",
    "Eihwaz",
    "Bdubyah",
    "DMC",
    "Axebeard",
    "OrbitalBliss",
    "KhaineGB",
    "Hernanxx"
  ],
  "modTags": [
    "7 days to die airdrop",
    "7 days to die backpack",
    "7 days to die biomes",
    "7 days to die drinks",
    "7 days to die experience",
    "7 days to die farming",
    "7 days to die food",
    "7 days to die loot",
    "7 days to die perks",
    "7 days to die prefab",
    "7 days to die skill points",
    "7 days to die toolbelt",
    "7 days to die tools",
    "7 days to die vehicles",
    "7 days to die weapons",
    "7 days to die zombies",
    "JaxTeller718"
  ]
}