{
  "modURL": "https://7daystodiemods.com/aesirkins-challenge-farming/",
  "modCreatedTime": "2022-06-08T19:48:00+00:00",
  "modLastUpdatedTime": "2022-06-12T01:23:40+00:00",
  "modName": "Aesirkin's Challenge Farming",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-aesirkins-challenge-farming-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-aesirkins-challenge-farming-additional-screenshot-2.jpg"
  ],
  "modShortDescription": "Farming gets boring. We want to make farming more challenging, preferably without just adding repetitive busywork.",
  "modDescription": "## Purpose\n\nSo, what problem are we trying to solve?\n\nFarming gets boring.\n\nIt’s too easy to get large amounts of food with it late game, making it required, but not exciting.\n\nMeanwhile, it’s full of busywork (doing the same thing with no thought) and missing interesting decisions.\n\nWe want to make farming more challenging, preferably without just adding repetitive busywork.\n\n## Description\n\nPlants will now progress through a long growing process, rewarding a large harvest at the end. During this process various events will occur, and as a player you will need to decide whether to act (often using resources), wait it out, or harvest and move on. Acting, and sometimes waiting, will usually increase the growth tier, or health, of that crop; while there are occasional events that can decrease the growth tier if not acted upon.\n\nPlants may be harvested any time after they progress beyond the seedling stage, which will be obvious from their size. The harvest will be commensurate with the growth tier you have raised those plants to.\n\nSome actions you need to take will require special items, available from the new garden workbench. Until you can make these items you’ll be forced to simply wait. This adds a sense of progression to [farming](https://7daystodiemods.com/tag/7-days-to-die-farming/), and gives you something to work towards.\n\n## Details\n\nSpoiler warning! Read this section only if you don’t want to explore and figure it out yourself.\n\n### Growth Events\n\nGerminating – This plant was recently planted. It requires compost to begin growing in earnest. However, if you wait an extremely long time, it will take root without help.\n\nGrowing – This plant is currently growing. After a medium amount of time an event will occur as noted below or, if you’re very lucky, it will grow to the next tier without incident.\n\nWeeds Encroaching – This plant has weeds growing with it; stealing water and nutrients from its roots. It will not continue growing without help. You can use your [hoe](https://7daystodiemods.com/tag/7-days-to-die-tools/) to remove the weeks to allow it to continue at the current tier. Weeds have difficulty encroaching on relatively mature plants.\n\nSoil Compacted – This plant will eventually move to the growth stalling status, but it will take several hours. Use an earthworm to help aerate the soil and grow the plant by two tiers.\n\nGrowth Stalling – This plant will eventually grow to the next tier, but it will take several hours. Use compost to give it a boost so it can grow two tiers immediately.\n\n### Watering\n\nStatistically speaking, when plants become dry they are more likely to recover and grow to the next growth tier than they are to wilt back a growth tier. So waiting out dry plants is viable, but very slow. Don’t worry, you don’t throw a water jar at them; you empty the water and keep the jar.\n\nDry – This plant is drying out. After a medium time it may naturally recover and move to the next tier, but more likely will become very dry. Use a murky water to move it to the next tier of growth.\n\nVery Dry – This plant is getting dangerously dry. After a medium time it is likely to naturally recover back to “Dry”, but may begin to wilt. Use a murky water to move it to the next tier of growth.\n\nWilting – This plant is wilting. After a very long amount of time the plant will lose a tier of growth unless you use a murky water to move it forward instead.\n\n* Probability of natural recovery: Approximately 65%\n* Average time to natural result: Approximately 5-6 hours (varies wildly plant to plant)\n* Natural recovery result: Next growth tier\n* Failure to recover result: Previous growth tier\n\n### Fungus\n\nMild Fungal Infection – This plant has the start of a fungal growth on it. After a medium amount of time it may recover and continue growing, but more likely the fungus will grow worse. Use an antifungal spray to eliminate the infection and move it to the next tier of growth instead.\n\nFungal Infection – The fungal infection has taken hold on this plant and is stopping it’s growth. After a medium amount of time the fungus will likely naturally die back to a mild level, but can become more severe. Use an antifungal spray to eliminate the infection and move it to the next tier of growth instead.\n\nChoked By Fungus – The fungal infection has spread to most of this plant’s greenery! After a very long amount of time the plant will lose a tier of growth unless you use an antifungal spray to eliminate the infection and move it to the next tier of growth instead.\n\n* Probability of natural recovery: Approximately 75%\n* Average time to natural result: Approximately 5 hours (varies wildly from plant to plant)\n* Natural recovery result: Same growth tier\n* Failure to recover result: Previous growth tier\n\n### Special Statuses\n\nThese statuses tend to appear only on more mature plants, and often provide extra items or bonuses.\n\nBees Settling – Bees have built a nest on this plant. Use a collection kit to safely collect some of their honey. After a medium amount of time this status will disappear.\n\nMoldy – Some strange mold has settled on your crop. Harvest now to collect some along with your crop harvest. After a medium amount of time this status will disappear.\n\nChoked by Rafflesia Weeds – This growing plant is being suffocated by a variety of Rafflesia; a plant known to smell like rotting flesh. You can wait for the Rafflesia to bloom and die off, or use a special tool to remove it now while it’s at maximum scent. Removing it will surely attract animal scavengers.\n\nVulture Nesting – A vulture has started a nest in this plant. You can wait until the [vulture](https://7daystodiemods.com/tag/7-days-to-die-animals/) and chicks leave, or you can use a special tool to remove the nest and collect the eggs. Disturbing the nest may attract the mother, though.\n\n## Harvesting\n\nHarvesting while the plant is still in it’s small, seedling form will return only a seed. When the plant grows in size you may harvest and receive some crops back, along with a seed and plant remains.\n\nPlants move through up to 20 tiers of growth. You will receive approximately 1 additional crop during harvesting for each tier of growth beginning with tier 4, which is when the model changes to the larger size. Hovering over the plant will provide text giving a general idea of growth tier (see below), and the color of the text will change with every tier. So you may see two plants in the Fruiting stage, for example, with slightly different colored text (denoting different tiers)\n\n## Growth Stages\n\n* 1-3 Seedling\n* 5-6 Young\n* 7-9 Fruiting\n* 10-13 Healthy\n* 14-16 Mature\n* 17-19 Strong\n* 20 Prize Winning\n\n## Realism\n\nAs much as possible I’ve tried to make events and responses realistic. However, deviations needed made to best accomplish the gameplay goal of the mod. I am aware that some things don’t exactly match what we would expect in real life and welcome thoughts. But please bear in mind that gameplay takes precedence over realism in this context.\n\n## Version\n\n**IMPORTANT!** If you’re using v1.0 please redownload. v1.0 has a severe bug that causes unexpectedly long growth times.\n\nCurrent version is 1.1\n\n## Compatibility\n\nThis mod was written to be compatible with A20\\. It may or may not work with other versions.\n\nThis mod was designed for new games. I do not believe this will work with existing games, but if you try it please post back and let me know!\n\nThis was designed as a server-side, no download mod. This means that if you’re playing a single player game or a P2P game only the host needs to have it. If you’re running a server, only the server needs to have it. Clients do not need to download the mod.\n\n**[Download](https://www.dropbox.com/s/g2zpmv2xhx25roe/zAesirkinFarming.zip?dl=1)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/29023-challenge-farming/).\n\n**Credits:** [Aesirkin](https://7daystodiemods.com/tag/aesirkin/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://www.dropbox.com/s/g2zpmv2xhx25roe/zAesirkinFarming.zip?dl=1",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/29023-challenge-farming/",
  "modAuthors": [
    "Aesirkin"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die clothing",
    "7 days to die farming",
    "7 days to die food",
    "7 days to die tools",
    "Aesirkin"
  ]
}