{
  "modURL": "https://7daystodiemods.com/armor-pack-4-military-vests/",
  "modCreatedTime": "2021-10-27T18:07:48+00:00",
  "modLastUpdatedTime": "2021-10-27T18:12:23+00:00",
  "modName": "Armor Pack 4 - Military Vests",
  "modImages": [],
  "modShortDescription": "You ready to ditch the same old steel armor and have a chance to loot a tough, sexy plate carrier?",
  "modDescription": "I’m sure you’re as frustrated as me with this outdated clothing system and their apparent desire to dumb it down to make our players feel even less like they’re unique and custom to us.\n\nI am releasing these mods to hopefully show TFP that players WANT custom characters and variations of items that they can hobble together with treasures from the wasteland, creating a truly unique character and base.\n\nYou ready to ditch the same old steel [armor](https://7daystodiemods.com/tag/7-days-to-die-armor-mods/) and have a chance to loot a tough, sexy plate carrier?\n\nNote that with all [clothing](https://7daystodiemods.com/tag/7-days-to-die-clothing/)/armor mods, you CANNOT preview this in your character outfit screen. It will look invisible but other players can see it and if you enter third person or sit on a bike, you can see it too.\n\nThis serves to help your crew look badass and get more protection.\n\nAdds a plate carrier with seven loadouts in Ranger Green, Khaki and Coyote Brown.\n\n## Loadouts\n\n* Plain\n* Plain with Battlebelt\n* Light Loadout\n* Rifleman\n* Grenadier\n* Gunner\n* Team Leader\n\nNot craftable, you have to find it through looting like you would in real life.\n\nIf you’re a streamer or someone with a clan and want versions with your logo or graphic on a patch on the plate carriers, email me at smittylovesdogs@gmail.com for details.\n\nALL ASSETS PURCHASED AND LICENSED TO SMITTYLV.\n\nJoin my dedicated server with my private and experimental mods by visiting [my website](https://smittylv.com/). You can also see up-to-date blog posts as I update WIP projects and talk about the modding process as I go through it. You can also donate if you’d like to contribute to more Unity assets being brought into 7DTD.\n\n**[Download](https://drive.google.com/file/d/1bo1vS_5VNPp7MYY29_MiKkyr4dBXE2HF/view?usp=sharing)**\n\n**Credits:** [smittylv](https://7daystodiemods.com/tag/smittylv/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/1bo1vS_5VNPp7MYY29_MiKkyr4dBXE2HF/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modAuthors": [
    "smittylv"
  ],
  "modTags": [
    "7 days to die armor mods",
    "7 days to die clothing",
    "smittylv"
  ]
}