{
  "modURL": "https://7daystodiemods.com/autobots-automated-mining-and-ammunition-bots-revisited/",
  "modCreatedTime": "2021-05-29T11:42:36+00:00",
  "modLastUpdatedTime": "2021-05-29T12:25:10+00:00",
  "modName": "AutoBots - Automated Mining and Ammunition Bots (Revisited)",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/05/7-days-to-die-autobots-automated-mining-and-ammunition-bots-revisited-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/05/7-days-to-die-autobots-automated-mining-and-ammunition-bots-revisited-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/05/7-days-to-die-autobots-automated-mining-and-ammunition-bots-revisited-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/05/7-days-to-die-autobots-automated-mining-and-ammunition-bots-revisited-additional-screenshot-4.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/05/7-days-to-die-autobots-automated-mining-and-ammunition-bots-revisited-additional-screenshot-5.jpg"
  ],
  "modShortDescription": "Here is a download link to an updated and revised version of the Auto Miner and Auto Ammo Maker combined into one mod.",
  "modDescription": "Here is a download link to an updated and revised version of the Auto Miner and Auto Ammo Maker combined into one mod, but still with the two separate ‘automation’ units, called AutoBots (full credit to Snufkin who offered one of the most recent builds for the [Auto Miner](https://7daystodiemods.com/autominer-mod/), but also to the modders down the line who have introduced similar features throughout multiple previous Alpha releases).\n\nPictures follow the outline and description:\n\nThe AutoBot Mod is certainly not made to replace existing Auto Production options as some players really appreciate what is already out there because it provides more time to spend on other activities. This AutoBot Mod is simply made to bring Automation up to date and offer a little more balance for players who prefer an experience closer to Vanilla presets.\n\n## Automated Mining Bot\n\nThe Automated Mining Bot only went through minimal updates primarily as follows:\n\n* Converting 10000 Gas into 1000 shale is no longer possible as this was exploited through a constant Chemistry Table to Auto Miner loop that saw 800 shale to 10000 stacked Gas build up a very tidy resource profit but ended player’s mining/wrenching careers.\n* The Gas icon disappeared from some releases out there due to recipe tagging features. This restores the icon.\n* The Workstation for the Automated Mining Bot has a different inventory color (gray) and is a different model from the Automated Ammunition Bot to better tell them apart.\n* Localization has been added.\n* It takes 10 seconds to ‘pick up’ the Bot for moving elsewhere.\n* Hit damage has been increased to 1200\n* The Automated Mining Bot unlocks at Advanced Engineering Level 4\n* It is compliant with A19 updates\n* Making the Automated Mining Bot requires a slightly different recipe\n\n## Automated Ammunition Bot\n\nThe Automated Ammunition Bot went through some fundamental recipe changes as follows:\n\nIt became easy to create HUGE quantities of ammunition by using the exploit in the Auto Miner and rather large quantities without it, to the degree that players were casually sharing 5K+ of AP ammo without putting the slightest dent into their own personal stocks.\n\nOne player could realistically supply the needs of every player on a populated server. Recipes have changed to bring in a different style of game play for those who prefer more of a challenge and are based on a simple formula:\n\n1) Half of each individual projectile’s Gunpowder requirement  \n+/or replaced with  \n2) Half of each projectile’s Secondary/Primary Resource where needed to maintain balance or in place of Gunpowder where Gunpowder was not required  \n+  \n3) One third of the Coin cost based on the projectile’s Player Vending Machine cost.\n\nWith [ammo](https://7daystodiemods.com/tag/7-days-to-die-ammo/) stacking providing a potential 20% discount on resources, the above formula exceeds that discount to 50% for Gunpowder or Secondary/Primary Resource but also brings in the extra requirement to use coin. This will give coin a greater purpose for latter Game Stage and reduce money hording as well as offer some greater context to the brass requirement of many types of ammo. The formula is not perfect, and may need to be tweaked, but makes this update a Quality of Life feature for those bringing in the coin and resources without it becoming a free hand out.\n\n* Icons disappeared from some releases out there due to recipe tagging and format. This restores the icons.\n* The Workstation for the Automated Ammunition Bot has a different inventory color (green) and is a different model from the Automated Mining Bot to better tell them apart.\n* Localization has been added.\n* It takes 10 seconds to ‘pick up’ the Bot for moving elsewhere.\n* Hit damage has been increased to 1200\n* The Automated Ammunition Bot unlocks at Advanced Engineering Level 4\n\nThe Automated Miner with icon color and recipe.\n\nThe Automated Ammunition Bot with description and a different icon and color.\n\nAs with standard, a full array of [mining](https://7daystodiemods.com/tag/7-days-to-die-mining/) options minus the shale to stop the dog chasing its own tail which gets longer with each nip.\n\nAnd standard mining speed increases with attached augers that reflect their level.\n\nAs for the ammo, a Gunpowder and Coin requirement that gives batches of 500 for rounds. 500 for turrets ammo with calculations based on Player Vending Machine and Primary Resource costings. 100 for arrows and bolts.\n\nThis is a server side only mod and only needs to be placed in the server Mods folder. Players are not required to install it in their Mods folder.\n\nThe AutoBot Mod is compatible with existing Auto Miner/Ammo Mods because they have their own names and will not conflict. However, as with introducing any new mods to your server, this will add two new items and due diligence on a test server is prudent.\n\n**[Download](https://github.com/arramus/AutoBots-A19-2021May29/archive/refs/heads/main.zip)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/24421-autobots-automated-mining-and-ammunition-bots-revisited/).\n\n**Credits:** [Arramus](https://7daystodiemods.com/tag/arramus/), Snufkin",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/arramus/AutoBots-A19-2021May29/archive/refs/heads/main.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/24421-autobots-automated-mining-and-ammunition-bots-revisited/",
  "modAuthors": [
    "Arramus",
    "Snufkin"
  ],
  "modTags": [
    "7 days to die ammo",
    "7 days to die mining",
    "Arramus"
  ]
}