{
  "modURL": "https://7daystodiemods.com/auto-mechanics/",
  "modCreatedTime": "2021-12-06T11:00:00+00:00",
  "modLastUpdatedTime": "2021-12-06T11:07:44+00:00",
  "modName": "Auto Mechanics",
  "modImages": [],
  "modShortDescription": "This mod adds a new workstation, which is required to craft motor vehicles and their parts. This mod also adds a new auto mechanic trader.",
  "modDescription": "Creates auto mechanic traders and workstations.\n\n## Features\n\n### New Motor Vehicle Workstation\n\nThis mod adds a new workstation, which is required to craft motor [vehicles](https://7daystodiemods.com/tag/7-days-to-die-vehicles/) and their parts. The workstation is not needed for bicycles.\n\nThis workstation cannot be crafted. It is only available at the new auto mechanic trader.\n\n### New Auto Mechanic Trader\n\nThis mod also adds a new auto mechanic [trader](https://7daystodiemods.com/tag/7-days-to-die-trader/). This trader has specialized loot, consisting only of things needed to craft motor vehicles, and sells only schematics related to motor vehicles.\n\nThe trader still gives the traditional quests, and offers the same rewards as 7D2D traders upon completing these quests.\n\nThis trader is the only place that you can find the new motor vehicle workstation, and so is the only place where players can craft motor vehicles.\n\n## Technical Details\n\nThis mod uses XPath to modify XML files, and does not require SDX or DMT. It should be compatible with EAC. Servers should automatically push the XML modifications to their clients, so separate client installation should not be necessary.\n\n### Adding the Auto Mechanic to Vanilla RWG Maps\n\nThe trader is already integrated with vanilla RWG. It is spawned as a trader, but can spawn half as close to each other as other traders, which should increase the likelihood of spawning.\n\nThe trader is placed in the world when that world is generated. You will need to create a new world after installing this mod.\n\n### Adding the Auto Mechanic to Navezgane\n\nUnfortunately, there is no way to automatically place [POIs](https://7daystodiemods.com/tag/7-days-to-die-prefab/) in Navezgane via XML. If you are playing on Navezgane, you will have to place this trader manually, after the world is already generated.\n\n### Adding the Auto Mechanic to Nitrogen Maps\n\nThere is a file named prefablist\\_khzmusik\\_AutoMechanics.txt in the root of this mod folder. This is an addition to the prefab list which will tell Nitrogen how to spawn the auto mechanic.\n\nTo use it in Nitrogen, you will need to add the file contents to the end of whichever prefab list you are currently using in Nitrogen. For example, if you are using it with the Compo Pack (currently at version 47), add the contents to the end of the prefablist\\_CompoPack\\_47.txt file.\n\nBy default, the auto mechanic trader is spawned in Nitrogen’s “trader”, “industrial”, “hillbillyjunk”, and “carlot” placement zones. This is because this trader is the only place where you can craft vehicles. You may add or remove whichever Nitrogen placement zones that you want, by removing/adding the placement zones at the end of the line in the text file (semicolon-delimited).\n\nAs with 7D2D RWG, the trader is placed in the world when that world is generated. You will need to create a new world after installing this mod.\n\n## Changelog\n\n* Filled in gap in POI that players could get stuck in\n* Fences around trader now reach all the way to the top; have barbed wire at the top; zombies shouldn’t get caught between walls and fences now\n* Rebalanced trader loot, expanded secret stash loot\n\n**[Download](https://gitlab.com/karlgiesing/7d2d-a19-modlets/-/archive/master/7d2d-a19-modlets-master.zip?path=khzmusik_Auto_Mechanics)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/24348-a19-khzmusiks-modlets/).\n\n**Credits:** [Khzmusik](https://7daystodiemods.com/tag/khzmusik/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/karlgiesing/7d2d-a19-modlets/-/archive/master/7d2d-a19-modlets-master.zip?path=khzmusik_Auto_Mechanics",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/24348-a19-khzmusiks-modlets/",
  "modAuthors": [
    "Khzmusik"
  ],
  "modTags": [
    "7 days to die prefab",
    "7 days to die trader",
    "7 days to die vehicles",
    "Khzmusik"
  ]
}