{
  "modURL": "https://7daystodiemods.com/bandits-mod-for-a18/",
  "modCreatedTime": "2020-02-08T20:05:00+00:00",
  "modLastUpdatedTime": "2021-07-12T08:47:23+00:00",
  "modName": "Bandits Mod for A18 (Closed)",
  "modImages": [],
  "modShortDescription": "We're not alone in the 7DTD world anymore. This 7 Days to Die mod adds 4 new bandits to the A18 game version. We might encounter bandits around the streets.",
  "modDescription": "We are not alone in the 7DTD world anymore. We might encounter bandits running around the streets. Most important, this bandits mod works in version A18.\n\nThis 7 Days to Die mod adds 4 new bandits to the A18 game version.\n\n## Features\n\n**AshBandit:** A dual wielding older, fatter version of your favorite EvilDead character.  \n**BanditEve:** 4 foot tall, MP7 wielding gal, hard to hit but cute if you live long enough to get close.  \n**BanditArcher:** Babe with a bow. You can see her and what she can do in a picture below.  \n**BanditBoss:** A Starvation favorite. Heavy armor and a plasma rifle. Avoid unless your ready to dance.\n\nThey spawn wherever enemy [animals](https://7daystodiemods.com/tag/7-days-to-die-animals/) spawn, and wander the game world. They will attack all enemies (Zombies, NPCs and dangerous animals), and will attack the player. They can be killed and may drop a [loot](https://7daystodiemods.com/tag/7-days-to-die-loot/) container.\n\nEach has a ranged [weapon](https://7daystodiemods.com/tag/7-days-to-die-weapons/) with xml configurable properties. These may need adjusting, but are set at various ranges and are pretty accurate. Change the [ammo](https://7daystodiemods.com/tag/7-days-to-die-ammo/) speed and/or the SpreadDegrees settings in xml to adjust. Some randomly shoot more than 1 projectile per shot, which is also adjustable. They are not over powered and are not tough kills except for the boss.\n\nThe archer will put arrows into the player. Those arrows can be removed by the player but you may need to change view sometimes especially if its stick into your butt. On dedi or MP, other players can remove them for you, but Xyth has not tested that yet. It looks badass to leave them in though, especially if you get one to the knee.\n\nSpawning is handled by adding all 4 as a rare spawn to any “enemyanimal” spawn groups. Depending on your preferences, make them more or less rare, change where they spawn, and let me know what works well. You might want groups of bandits as wandering hordes as well.\n\nThe bandit class is vanilla code with a slight code fix for movement speed.\n\n## Change Log\n\n* v1.7 : Converted to faction based attacking, improved ranged targeting\n* v1.6 : Added ModInfo.xml to work around DMT bug and temp. removed BanditBoss from spawn due to NRE on his death\n* v1.55 : Dedi animation fix\n* v1.52 : Bleeding fix\n* v1.5 : A18 DMT version with refactored code\n* v1.11 : Removed [zombie](https://7daystodiemods.com/zombie-mods/) buffs from weapons\n* v1.10 : Converted Bandits to SDX class that improves movement, required Patch\\_Entity to fix death by bleeding bug\n* v1.00 : Initial release\n\n## Known Issues\n\nBandits are accurate aiming at players but less so on other entities. Need to look at TFP ranged collision code to see what changed since A17.\n\nSome minor sliding in and out of firing animations might still remain. Xyth not sure why A18 introduced this yet.\n\nLoot might sux on these as the vanilla loot containers keep changing so reusing vanilla containers for now.\n\n## Installing\n\nThis is a DMT mod so it must be compiled with DMT. This mod has one dependency that must be compiled with this mod for it to work properly. **Required:** [0-SphereIICore](https://yehonal.github.io/DownGit/#/home?url=https://github.com/SphereII/SphereII.Mods/tree/master/0-SphereIICore)\n\n**IMPORTANT!**  \nThis mod is formally retired. The bandits now are part of the [Creature Packs](https://7daystodiemods.com/creature-packs-a-community-entity-project/). See you there.\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/11700-xyths-dmt-bandits-mod/).\n\n**Credits:** [Xyth](https://7daystodiemods.com/tag/xyth/)  \n_Additional Credits:_ Mumpfy, SphereII",
  "modDownloadURLs": [
    {
      "Info": "",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/11700-xyths-dmt-bandits-mod/",
  "modAuthors": [
    "XythAdditional Credits: Mumpfy",
    "SphereII"
  ],
  "modTags": [
    "7 days to die bandits",
    "Xyth"
  ]
}