{
  "modURL": "https://7daystodiemods.com/better-perks-lucky-looter/",
  "modCreatedTime": "2019-12-20T18:04:44+00:00",
  "modLastUpdatedTime": "2020-06-02T00:01:40+00:00",
  "modName": "Better Perks  Lucky Looter",
  "modImages": [],
  "modShortDescription": "This 7 Days to Die mod will grant you up to 100% granted drops and up to 5 times any stackable loot. Claymore hope you enjoy!",
  "modDescription": "Claymore has to admit: He really wanted to make it a Better Attributes mod, but then decided, it won’t fit.\n\nThis 7 Days to Die mod will grant you up to 100% granted drops and up to 5 times any stackable [loot](https://7daystodiemods.com/tag/7-days-to-die-loot/). Sounds OP, but is it? Think of doing hordes in A16 and the rewards you got. You went to the corpses, pressed E and got at least the resources back you depleted for.\n\nA17 and A18 made hordes worse. Why do hordes? [Farming](https://7daystodiemods.com/farming-mods/) 7 days, just to survive the next horde? What about doing quests? What about dungeons? What about to simply enjoy the awesome new RWG (no comparison to NitroGen, but anyways)? What about a bit of chilling? He try to bring you back this feeling with this mod. He hope you enjoy!\n\nP.S.: He play at Insane with 64 blood moon [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/), 2 hour day, no loot respawn, no airdrops. Just, if you would have asked.\n\nCompatibility: A18+\n\n**Changes**\n\n* 1.0.1: Removed some leftovers from the localization before the mod got split up to separate mods.\n\n[Download](https://www.mediafire.com/file/0v8pd35fn46bs6z/Claymore_Better_Perks_Lucky_Looter.zip)\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/15031-claymores-modlets/).\n\n**Credits:** [Claymore](https://7daystodiemods.com/tag/claymore/)",
  "modDownloadURLs": [
    {
      "Info": "\nClaymore has to admit: He really wanted to make it a Better Attributes mod, but then decided, it won’t fit.\nThis 7 Days to Die mod will grant you up to 100% granted drops and up to 5 times any stackable loot. Sounds OP, but is it? Think of doing hordes in A16 and the rewards you got. You went to the corpses, pressed E and got at least the resources back you depleted for.\nA17 and A18 made hordes worse. Why do hordes? Farming 7 days, just to survive the next horde? What about doing quests? What about dungeons? What about to simply enjoy the awesome new RWG (no comparison to NitroGen, but anyways)? What about a bit of chilling? He try to bring you back this feeling with this mod. He hope you enjoy!\n\nP.S.: He play at Insane with 64 blood moon zombies, 2 hour day, no loot respawn, no airdrops. Just, if you would have asked.\nCompatibility: A18+\nChanges\n1.0.1: Removed some leftovers from the localization before the mod got split up to separate mods.\nDownload\nThe forum topic of the mod is here.\nCredits: Claymore\nShare this mod with your friends:\n\n",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/15031-claymores-modlets/",
  "modAuthors": [
    "Claymore"
  ],
  "modTags": [
    "7 days to die loot",
    "7 days to die perks",
    "Claymore"
  ]
}