{
  "modURL": "https://7daystodiemods.com/castle-spartan/",
  "modCreatedTime": "2020-06-26T19:59:44+00:00",
  "modLastUpdatedTime": "2020-06-26T19:59:46+00:00",
  "modName": "Castle Spartan",
  "modImages": [],
  "modShortDescription": "Castle Spartan is a base design for the game 7 Days to Die that that was mostly built during Grand Spartan live streaming.",
  "modDescription": "Castle Spartan is a base design for the game 7 Days to Die that that was mostly built during Grand Spartan live streaming.\n\nThe one thing missing for Eric Beaudoin was the ability to do a virtual visit of the Castle. Fortunately, Grand Spartan was kind enough to give him access to the save game files and he was able to extract the Castle and create a 7 Days to Die POI (Point of Interest). This project’s goal is to allow players to download the POI to their computer and interact with it in using the game.\n\n## How to Install\n\n### Download the Mod\n\nYou need CastleSpartan\\_3.1.zip. This file includes both POI and modlet files in the Mods folder.\n\nThe instructions are slightly different if you play 7 Days to Die on a stand-alone PC or if you use a dedicated server.\n\n#### Stand-Alone PC Installation\n\nCopy the **CastleSpartan** folder into your 7 Days do Die **Mods** folder.\n\n**Optional:** Copy the **Mods\\\\CastleSpartan\\\\Prefabs** files into your game **Data/Prefabs**. This will allow you to see the castle using the in game POI editor.\n\n#### Dedicated Server Installation\n\nIt’s pretty much the same thing then the stand-alone PC installation, you copy the **CastleSpartan** folder into the server **Mods** folder on your server. Most hosting services provide FTP access that will allow you to upload the files to the right folder.\n\nThe players do not need to install the mod, it only has to be installed on the server.\n\n## How to Use the Mod\n\nOnce the mod is installed, randomly generated worlds will have a chance to spawn Castle Spartan. You just have to generate a new world and the castle should be in there somewhere. There should be multiple instances of the castle in your new world.\n\nAs you may guess, this will only work with newly generated worlds. Any world that was generated before you installed the mod will not spawn the castle. You will also need to start a new game in order to use that new world.\n\n## How to See If the Castle Actually Spawned in My Generated World\n\nOnce the world is generated, you will find a folder with the world name near where the save games are located. On Eric Beaudoin’s PC, the folder for the generated worlds is **%APPDATA%\\\\7DaysToDie\\\\GeneratedWorlds**. (He’s using a Windows 10 box.) For dedicated servers, you might find the folder by looking at the **UserDataFolder** in the **serverconfig.xml** file. You will need to find where that folder is on your PC or Server.\n\nOnce you found the folder named for your world (something like South Pidimo County or West Wikeno Territory), you will find a file named **prefabs.xml** inside. If you open that file with any text editor like Notepad, you can search for CastleSpartan\\_v3\\. If you find it, you know that your random world has spawned the POI.\n\n**[Download](https://gitlab.com/spartan-designs/castle-spartan/raw/master/Releases/CastleSpartan_3.1.zip)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/17995-castle-spartan/).\n\n**Credits:** [Eric Beaudoin](https://7daystodiemods.com/tag/eric-beaudoin/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/spartan-designs/castle-spartan/raw/master/Releases/CastleSpartan_3.1.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/17995-castle-spartan/",
  "modAuthors": [
    "Eric Beaudoin"
  ],
  "modTags": [
    "7 days to die prefab",
    "Eric Beaudoin"
  ]
}