{
  "modURL": "https://7daystodiemods.com/comsenmod/",
  "modCreatedTime": "2020-05-09T20:55:23+00:00",
  "modLastUpdatedTime": "2020-05-11T13:57:03+00:00",
  "modName": "ComSenMod",
  "modImages": [],
  "modShortDescription": "Common Sense for Loot and More. Mod makes hundreds of small changes, many of them to loot, to use what’s already in the game in a more common sense way.",
  "modDescription": "Common Sense for Loot and More. ComSenMod makes hundreds of small changes, many of them to loot, to use what’s already in the game in a more common sense way. Everything is carefully apportioned so that intuition and logic apply, without needing prior knowledge of the game.\n\n* People rarely keep their clothes in a desk, their canned food in a purse, or their trophies in a filing cabinet.\n* You can fit more in a big storage box than in a small storage chest.\n* The bigger the tree, the more wood it yields, and many [trees](https://7daystodiemods.com/tag/7-days-to-die-trees/) contain bird nests.\n* Machetes are appropriate for chopping wood.\n* You can’t start a fire without a source of ignition.\n\nAnd so on. At the same time, quantities are still fine tuned for gameplay, iteratively based on many hours of gameplay. Many factors, including risk versus reward, rarity, tangible value, the progression curve over time, and utilization are taken into consideration.\n\n## Zombies With Tailored Loot\n\nZombie corpses can once again be looted directly for whatever low-level loot was on their person. They might have some lockpicks, vitamins, or a brass wristwatch for example. More lucratively, [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) drop more loot backpacks than in vanilla, and each type of zombie drops their own unique type of backpack. If you want an axe or a chainsaw, you can selectively target a lumberjack zombie and hope he drops a backpack with one.\n\n## Satisfying Portions\n\nFinding a couple of nails is nearly useless; it clutters your inventory more than anything. So although ComSenMod doesn’t aim to increase loot overall, if you do find something, it will generally be enough to potentially change the narrative of your game. Similarly, players get a bonus for destroying a tree or boulder completely, instead of leaving it partially damaged.\n\n## Improved Day 1 Experience\n\nThe starter quest is re-ordered based on increasing complexity and a player’s real priorities. It’s enhanced via (English) localization text changes and more to be easier to follow, while teaching more about game functions and the interface. It also adds safeguards against some ‘cheap’ Day 1 dangers, while adding authenticity to early game survival.\n\nComSenMod isn’t aimed at making the game easier or harder. It’s not meant to take the game in a wildly new direction with changes that are experimental or frivolous. His hope is that ComSenMod can appeal broadly, to improve the game for all kinds of players and play styles.\n\n## Change List\n\nThis is a list of all changes in ComSenMod relative to the vanilla game. For your reading pleasure, each change is accompanied by the reasoning behind it.\n\n**biomes.xml**\n\n* Reduced max surface rock probability (found in clay subbiomes) from .025 to .015\n\nAesthetically, the 2 rock models used are old Unity assets that look bad when repeated so often on screen. Balance-wise, these were so abundant, you never needed to mine underground.\n\n* Quadrupled chance of [mining](https://7daystodiemods.com/tag/7-days-to-die-mining/) silver/gold/diamond ore in all biomes\n\nDon’t have a feature so rare the player never encounters it. That’s still a 1 in 1250 chance to hit silver, just among sub-biome blocks, and the other ores are rarer.\n\n* Reduced hollow tree stumps by 50%\n\nThere shouldn’t be many of them within eyesight. It’s visually repetitious, and too many warm clothes growing on trees nullifies the unique challenges of the snowy biome.\n\n* Reduced bird nests by 50%\n\nGoes with another change to put ‘bird nests’ in trees, where players intuitively expect to find them.\n\n* Reduced snowberries in forest subbiome by 50%\n\nThey were unnaturally thick, and more abundant in temperate forest clay than any other place.\n\n**blocks.xml**\n\n* Moved harvesting car headlights from fully damaged state to somewhat damaged state\n\nThe headlight is only visible in the intact and somewhat-damaged models. Besides, it would be broken long before the car is down to its metal chassis.\n\n* Added chance to harvest car batteries from undamaged cars\n\nLogically, car batteries are easily accessible and removable without having to strip down the car first. Balance-wise, players weren’t harvesting enough batteries relative to the number of headlights.\n\n* Any tree with harvestable wood has a chance to drop feathers when destroyed. Trees that also bear seeds have a 50% greater chance of feathers.\n\nMost birds make nests in trees, so players intuitively expect to find them there. This represents picking through any bird nests that may be in the tree after it falls, while the eggs break from the fall.\n\n* Doubled chance of harvesting mechanical parts from all stages of cars\n\nA car has far more bolts, gears, etc. than other sources of mechanical parts, like chairs and toilets.\n\n* Changed coffins to use their own loot list\n\nCoffins should have clothes & bones over random junk.\n\n* House front doors have a chance to drop doorknobs when destroyed\n\nThe doorknob is clearly visible, and this is consistent with other brass fixtures in these houses.\n\n* Bird nests drop wood when destroyed instead of plant fibers\n\nThe nest’s material is set to wood. When you hit it, it sounds like wood, and makes wood particles.\n\n* School desks can be harvested for scrap plastic & iron\n\nThe seat and desktop are made of plastic. It was probably set up before plastics & harvesting were introduced.\n\n* Cacti drop wood when destroyed instead of yucca fruit\n\nCacti were effectively just another yucca plant, and too much fruit makes hunger & thirst a nonissue. Now players will still appreciate the wood, from which the ribs of a real saguaro are made.\n\n* Blinds drop scrap plastic when destroyed\n\nThese were probably created before the game had plastic as a material.\n\n**buffs.xml**\n\n* Increased splint effectiveness from 2x healing speed to 3x\n\nThe healing time was still frustratingly slow when you consider a splint is the only and best remedy a player has, and how easily legs sprain and break.\n\n**entityclasses.xml**\n\n* Set basic female zombies to drop basic zombie loot instead of fat zombie loot\n\nThis is expected to lower the overall amount of food from zombies considerably. It was probably an oversight.\n\n**items.xml**\n\n* Increased chance of torches alighting enemies from 10% to 25%\n\nThis is the one obvious thing players expect could happen when hitting a zombie with a torch. Torches aren’t trivial to make and are poor [weapons](https://7daystodiemods.com/tag/7-days-to-die-weapons/) otherwise; this helps the game ‘look right’ more than anything.\n\n* Added weight to running shoes so they can be scrapped\n\nNo reason these shouldn’t be scrappable like all other shoes. Probably an oversight.\n\n**loot.xml**\n\n* Added small chance to find precious metals in cupboards & drawers\n\nThis represents finding fine silverware.\n\n* Increased quantities found for some stackable junk loot, like nails\n\nFinding one nail at a time is useless; it just takes up inventory space. Finding a handful of nails is at least equally plausible and more likely to be good for something other than scrap.\n\n* Added scrap iron to junk\n\nRepresenting all the random stuff people throw away containing iron or other cheap metals.\n\n* Added [clothes](https://7daystodiemods.com/tag/7-days-to-die-clothing/) to junk\n\nOld clothes get thrown away. Naked in the apocalypse, you’d be happy to wear dirty rags.\n\n* Added plant fibers & dirt fragments to junk\n\nRepresenting yard waste & decomposing matter, and that junk tends to be dirty.\n\n* Made first aid kits twice as common as other rare [medicine](https://7daystodiemods.com/tag/7-days-to-die-medical-supplies/)\n\nThey’re less valuable than beakers, antibiotics, blood draw kits, and first aid schematics, so they should appear more often.\n\n* Added medicine to lootable backpacks\n\nMedicine’s just a sensible thing someone traveling with a backpack would pack.\n\n* Renormalized backpack loot probabilities\n\nNo effect on gameplay, just easier to compute at a glance.\n\n* Added scrap plastic to medicine & sinks\n\nRepresenting old plastic bottles one would find under sinks and wherever medicine is found (mostly medicine cabinets)\n\n* Increased probability of old cash from safes\n\nSafes are where the money is.\n\n* Added iron club to zombie cop loot\n\nRepresenting a billy club.\n\n* Added [tools](https://7daystodiemods.com/tag/7-days-to-die-tools/) to garage loot\n\nWhat garage doesn’t have some tools lying around?\n\n* Added working stiffs loot to airdrops (including chance to spawn rare tools like calipers)\n\nThe army is enlightened enough to realize you don’t just need stuff, you need things for making stuff. Teach a man to fish and all that.\n\n* Added eggs, feathers, and mushrooms to hollow stumps\n\nRepresenting that dead stumps may be home to nesting birds and growing fungus.\n\n* Added clothes and books to suitcases\n\nWhat do people pack in suitcases? Clothes, mostly. Maybe a book to read. This isn’t rocket science.\n\n* Replaced instances of Sham sandwiches in loot with all types of rotten [food](https://7daystodiemods.com/tag/7-days-to-die-food/)\n\nA sandwich contains meat and bread. But since you can’t scrap a sandwich to get either of these (material=“organic”), zombies should drop the pieces sometimes instead of the whole sandwich.\n\n* Added repair kit to guns+ammo loot group\n\nIt makes sense people would keep materials for repairing/maintaining their guns with their guns and [ammo](https://7daystodiemods.com/tag/7-days-to-die-ammo/).\n\n* Added goldenrod & red tea to beverage loot\n\nNo reason not to add these: they’re drinks you’d find in coolers where this loot group occurs, and their value lies between beer and water.\n\n* Reduced container size for purse and bird nest from 12 to 8\n\nThese container’s capacities didn’t reflect their small physical size. 8 is small enough to notice, without being too small for the loot they might contain.\n\n* Increased max number of casino tokens from cash registers by 50%\n\nCrater Creator found that he never got enough tokens from a store to be able to buy something from its vending machine, which makes the convenience of having vending machines in different stores irrelevant.\n\n* Split backpack loot between ‘cupboard’ food and rotten food\n\nThis reflects that some people packed perishable food in their backpacks, which are often moldy and decomposing by now.\n\n* Doubled max amount of loot in dumpsters\n\nDumpsters are big. Their container grids are large, but they only spawned as much loot as a small trash pile. It’s still junk, there’s just more of it.\n\n* Increased Utility Worker’s chance of dropping tools\n\nIf there’s one zombie you’d expect to be carrying a hammer, wrench, or other tools, it’s this guy.\n\n* Added a number of Working Stiffs-type loot to Utility/Construction Worker zombie loot\n\nSame. This changes the zombie from merely looking different into a sought-after target.\n\n* Removed books from Mortician’s Drawer\n\nWhy would there ever be a book in there?\n\n* Added facial piercings to skateboarder zombie loot\n\nIt fits the skateboarder stereotype.\n\n* Added facial piercings & black bandana to biker zombie loot\n\nIt fits the biker stereotype.\n\n* Replaced beer with grain alcohol in farmer zombie loot\n\nAnyone can drink beer. Homegrown moonshine has more backwoods charm.\n\n* Added overalls to farmer zombie loot\n\nIt fits the farmer stereotype.\n\n* Moved trophies out of filing cabinets and into safes\n\nKeeping a trophy in a safe seems much more plausible than keeping it in a filing cabinet. Who does that?\n\n* Slightly increased possible feathers & eggs per bird nest\n\nOffsets lower nest frequency.\n\n* Added rare medicine to Pop n Pills loot\n\nIf a football player can drop a first aid kit schematic or a beaker, surely you should be able to find them at a pharmacy.\n\n* Reduced amount of medicine you can get from airdrops\n\nOn the default 3 days between airdrops, you accumulate too many antibiotics and beakers\n\n* Doubled amount of loot you can find in [cars](https://7daystodiemods.com/tag/7-days-to-die-car-mods/)\n\nCars are larger than other containers. They have more grid space and they occupy many blocks, so it makes sense that, like dumpsters, they can hold more things.\n\n* Increased max forged iron or steel you can find from several containers from 2 to 10\n\nYou can’t do anything with 2 forged iron/steel, and they’re too rare to accumulate enough from multiple sources to do anything. I assume this is a holdover from when it took less iron to make things.\n\n* Reduced container size of gas pump from 32 to 20\n\nOnly gas spawns in gas pumps; there’s no need for extra space\n\n* Made new loot list for coffins\n\nCoffins should have bones & clothes over random junk\n\n* Standardized sources of scrap plastic, other than UMA zombies, to spawn 1-8 units\n\nYou can’t do hardly anything with 3 units of plastic.\n\n* Added bucket to tools loot group\n\nBuckets weren’t found in any loot. This puts them alongside other common hardware.\n\n* Added military armor & hazmat gear to airdrop loot\n\nIf they’re willing to give you military weapons, they should be willing to give you military armor.\n\n* Transferred hazmat gear from lumberjacks to nurses & doubled probability to 0.02\n\nOne would sooner expect a nurse to encounter hazardous materials than a lumberjack.\n\n* Added scrap [armor](https://7daystodiemods.com/tag/7-days-to-die-armor-mods/) to heavy armor loot group\n\nScrap armor wasn’t found in any loot. This makes them appear rarely in backpacks.\n\n* Added concrete mix to working stiffs loot\n\nYou’d find it in a hardware store and, like rebar, it’ll give a player a nice timesaving, versatile leg up on building.\n\n* Added a rare chance to find seeds and duct tape in mailboxes\n\nTrying to make mailboxes less boring by adding better things to rarely find. Also, these items weren’t found in many different places. Duct tape represents packing tape & other adhesives you could reuse.\n\n* Reduced amount of oil you find in junk\n\nNow it matches the amount you find in the automotive loot group\n\n* Switched garbage piles & dumpsters to use new “trash” quality template\n\nJunk now contains items with quality levels, which should be low quality since they’re junk.\n\n* Loot found in trash (pile, dumpster, can) has lower quality by using a new quality template\n\nThis became necessary now that clothes, which have a quality, are found in trash.\n\n* Removed duplicate entry for coffee beans in seed loot group\n\nAssumed to be an oversight.\n\n* Added black shades, worn boots to warm clothes loot group\n\nWhere there are shades, there should be black shades. Boots are warm.\n\n* Adjusted probabilities of individual ammo types in ammo loot group\n\nThey were all equal except for magnum rounds. They now better reflect the scarcity/power/skill level of each type and/or the weapons that use them.\n\n* Made new “survival stash” loot group to replace sporting goods\n\nFound only in tree stumps, many sporting goods weren’t relevant. Now it’s stuff someone would stash on a hunting trip.\n\n* Reduced chance of finding doorknobs in junk by half\n\n[Doors](https://7daystodiemods.com/tag/7-days-to-die-doors/) now sometimes drop doorknobs when destroyed, so this is to keep the overall balance of brass roughly the same.\n\n**quests.xml**\n\n* Updated bedroll [quest](https://7daystodiemods.com/tag/7-days-to-die-quests/) to match new recipe\n* Updated campfire quest to match new recipe\n\n**recipes.xml**\n\n* Changed bedroll recipe to require cloth & cotton\n\nA bed is valuable for gameplay and imparts a degree of permanence. It should take more than 5 seconds worth of effort to make one. Helps justify very abundant cotton plants, and could deter PvP griefers.\n\n* Added calipers recipe requiring tool & die set\n\nAddresses the odd situation of finding the tool & die set before you find calipers, which means you can make rockets before you can make bullets. Tool & die sets are for making tools, so it works.\n\n* Added alternative steel arrow & steel bolt recipes using plastic and a workbench instead of feathers\n\nThis pairs with more abundant scrap plastic. Players can use more ‘high-tech’ plastic fletching to complement more ‘high-tech’ steel arrowheads.\n\n* Changed exploding crossbow bolt recipe to use scrap plastic instead of feathers\n\nThis pairs with more abundant scrap plastic, and reflects the higher-tech nature of these ammunitions.\n\n* Reduced electric parts needed for flashlight to not exceed other craftable lights\n\nFlashlights are smaller and less complex than wall lights, so they shouldn’t require more electric parts.\n\n* Added candle/torch to campfire recipe\n\nYou can’t make a fire with just rocks. You need a source of ignition. This changes the early game radically, but is pivotal for this to really be considered a survival game.\n\n* Reduced smelting time for brick blocks by about one third\n\nThe long forging times are a side effect of bricks being all clay. In short, when you compare the hit points of various materials as a function of the time to make them, brick was not competitive.\n\n* Changed food recipes that don’t use water to require the grill instead of the pot\n\nThe grill was underutilized. There was almost no reason to get one. Now both the pot and the grill offer a number of food options.\n\n* Changed blunderbuss recipe to use brass instead of forged iron (doesn’t require forge)\n\nBy the time most players could make a blunderbuss, they’d moved on to better weapons, so the blunderbuss didn’t fill any role.\n\n* Added alternate mining helmet recipe that uses ZU football helmet\n\nThe ZU football helmet is just a different color; it should work the same.\n\n## What’s New in ComSenMod 5.0?\n\nFirst and foremost, ComSenMod 5.0 brings compatibility with Alpha 18\\. It ports over the changes that still make sense from ComSenMod 4.0, and it adds over 60 new changes in keeping with the mod’s continuing spirit. I’ve gone over the full change list with a fine tooth comb to double check that everything listed is actually implemented and working.\n\nNew in ComSenMod 5, things like weapons and mods are distributed comprehensively among zombie backpacks, so that no character builds are favored over others. For instance, zombie cops can carry all types of pistol weapons in their backpacks, following the same tiered progression used elsewhere in the game.\n\nExperience points for killing all animal types are re-balanced so that the total reward (including harvestable materials) more closely matches the risk/effort required to kill them.\n\nItem icons are re-made to Alpha 18’s new, higher resolution standard. There are a few brand new or newly enhanced icons, including an easter egg based on current events which I’ll let you find and hopefully enjoy.\n\n## Installation\n\n### Automatic Installation\n\n1. Download SphereII’s Mod Launcher app.\n2. Find ComSenMod in the list of mods and download & install ComSenMod directly from within the app.\n\n### Manual Installation\n\n1. Move the Mods->ComSenMod folder from this download into your 7DTD installation’s Mods folder.\n2. Replace your 7DTD installation’s Data->Config->Localization.txt file with the Data->Config->Localization.txt file from this download.\n\nThat’s it!\n\n### ComSenMod & Other Mods\n\nBecause it uses standard xpath syntax, ComSenMod should generally be compatible with other mods. If anything, there may be conflicts in loot.xml or Localization.txt.\n\n### Multiplayer\n\nFor multiplayer games, every player should install ComSenMod on their own machine, in addition to the server operator. Like with other mods, some data (like item icons) aren’t pushed from the server to the clients, so clients without the mod installed will get confusing results.\n\n## Known Issues\n\n* Road debris sometimes floats above the ground, though it shouldn’t be any worse than the cinder blocks in vanilla\n* Some modified items (cigar, hazmat clothes, pumpkin soup) may not show their new stats\n* Hazmat zombies are supposed to resist catching fire, but this isn’t working\n\n**[Download](http://chamotlabs.com/Bob/ComSenMod/A18.4_ComSenMod_5.0.zip)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/4190-comsenmod-now-for-a18/).\n\n**Credits:** Crater Creator  \n_Additional Credits:_ Guppycur’s Discord, SphereII",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "http://chamotlabs.com/Bob/ComSenMod/A18.4_ComSenMod_5.0.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/4190-comsenmod-now-for-a18/",
  "modAuthors": [
    "Crater CreatorAdditional Credits: Guppycur’s Discord",
    "SphereII"
  ],
  "modTags": [
    "7 days to die ammo",
    "7 days to die armor mods",
    "7 days to die beverages",
    "7 days to die car mods",
    "7 days to die clothing",
    "7 days to die doors",
    "7 days to die drinks",
    "7 days to die food",
    "7 days to die loot",
    "7 days to die medical supplies",
    "7 days to die mining",
    "7 days to die ore",
    "7 days to die quests",
    "7 days to die recipes",
    "7 days to die tools",
    "7 days to die trees",
    "7 days to die weapons",
    "7 days to die zombies"
  ]
}