{
  "modURL": "https://7daystodiemods.com/darkness-falls-mod/",
  "modCreatedTime": "2022-05-15T14:08:00+00:00",
  "modLastUpdatedTime": "2022-05-31T11:01:14+00:00",
  "modName": "Darkness Falls Mod",
  "modImages": [],
  "modShortDescription": "Darkness Falls mod is here! This is a 7 Days to Die mod KhaineGB originally created to fix a few issues himself, his wife and friends felt the game had.",
  "modDescription": "This is a mod KhaineGB originally created to fix a few “issues” himself, his wife and some friends felt the game had. Turns out he really enjoy modding so he has expanded on it quite a bit. The intent is to drag out the early game, so it will take you longer than usual to get to Iron and Steel. He has also tried to inject a little realism by locking away quite a few recipes behind perks, since most normal folks wouldn’t know how to do/make those things.\n\nAlso, he started playing in Alpha 8, so he wanted to try and bring back a few things from that era. Hub city, sharp rocks and sticks are pretty good examples, and he want to try and incorporate more features from that era of gameplay. He will also be trying to add in new [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/)/enemies to make the “end game” more difficult.\n\n## Features\n\n* 8 Classes to choose from, with 6 quests each!\n* 96 slot [backpack](https://7daystodiemods.com/tag/7-days-to-die-backpack/)! 12 slot crafting queue!\n* Custom UI! Food/Water bars next to the hotbar.\n* Increased zombie spawn/respawn rate!\n* Night time is now dangerous. The ferals come out to play…\n* Zombie Behemoth (male and female) added!\n* Scrap Iron Tools added. Iron requires level 15.\n* Titanium added! Can be found as trophies, underground and above ground. Used to make tools, weapons and blocks.\n* Forge Ahead & Leather Tanning books are back! (can also be purchased as perks)\n* Wrench is now a perk and a schematic, but crafted and repaired with Iron.\n* All common books added as perks, so you have the choice of finding the book or spending points.\n* Action skills are back!\n* Skill [books](https://7daystodiemods.com/tag/7-days-to-die-books/) added for all 100 level skills.\n* Generic skill point book added so you have ways to get skill points.\n* Skill notes! Find a recipe you already have? Scrap it into a skill note and craft that into something more useful.\n* Extra crops! Grow apple, orange banana and coconut trees, plus wheat, carrots and tomatos!\n* More food! Way too much to list, but bread is now an option. So are sunday roast dinners. YUM!\n* Animal Coops and Snares from Valmod added.\n* Clay bowls are back, and used for more than just pretty plants!\n* Craftable Small Engines and Lead Batteries!\n* Several new [guns](https://7daystodiemods.com/tag/7-days-to-die-weapons/)! Like the P225 Pistol, AR-15 Automatic Rifle, Winchester Rifle and Combat Shotgun.\n* Gun crafting! Gun parts are back and require the rare, find-only Lathe to be crafted.\n* Arrows can now use cloth fragments instead of feathers. Sticks and Sharp Stones have also made a return!\n* Tree sap is now a thing! Try left-clicking on non-dead trees with jars or bowls…\n* Sterile Bandage! New healing item to fill the void between normal Bandages and First Aid Bandages.\n* Working sinks and ovens! Both types craftable, so pick whichever matches your kitchen.\n* 5 new workstations. The Advanced Forge (required to smelt steel, but no fuel needed!), the Mortar and Pestle and two workbenches! There is also the rare, loot-only, Lathe!\n* Stone hammer added. Counts as a construction [tool](https://7daystodiemods.com/tag/7-days-to-die-tools/). Used only for repairing and upgrading.\n* Lockpicks added! Now you can lockpick all safes and most doors.\n* Steel crossbow added that takes steel, exploding and titanium bolts. Both crossbows can be scoped.\n* Combat axe added. There’s also a titanium version.\n* Trader’s are no longer protected! Take care of your local business!\n* Guards added to the trader, with a Guard Captain NPC! Talk to them to buy quest starters, which can earn you skill notes! (Single player only due to server bugs)\n* Larger player-crafted storage (kitchen cabinets, lockable!).\n* Time REMOVED from under the compass and on the map. Added to the trader window (under restock time).\n* Junction box added for invisible wires. Unlocked via [electricity](https://7daystodiemods.com/tag/7-days-to-die-electricity/) perk.\n* Bomber zombies added! These are designed to tear your base to bits. You have been warned!\n* 7 Day hordes re-done (less game stages so difficulty should ramp up faster and ferals appear sooner).\n* Writing Desk, Ink and Quill available! Used together, these halve the cost of creating skill books and class papers.\n* Grass spawns reduced for better performance/easier to see things.\n* Traders now have more basic materials for building.\n* Localization HEAVILY edited to show where items are crafted, including if they can be made in multiple workstations (one will have a reduced resource cost) and what tools may be needed.\n* Compo pack added!\n* Hornet from A15 and earlier is back, with it’s original sounds and model! Keep an eye out for them in forest [biomes](https://7daystodiemods.com/tag/7-days-to-die-biomes/).\n* Trader Caitlin has arrived! She has her own POI, her own voice, lives in the wasteland and carries the most powerful items.\n\n## SDX Integration\n\n* AnimationSDX added so custom models can all be added, rigged and animated in-game.\n* Plants (not tree’s) now REQUIRE water to grow on a [farm](https://7daystodiemods.com/tag/7-days-to-die-farming/)! They will still spawn in the world with no issues. However, they must have water within 4 blocks of them (any direction, including underneath) otherwise they will die. Water must also be topped up.\n\n## Class Information\n\n### Civilian Class\n\n**Grants the following:**\n\n* Quest 1 – Full suit, +1 skill point.\n* Quest 2 – 2 murky water, 2 red meat, +1 skill point.\n* Quest 3 – 2 painkillers, 2 first aid bandages, +1 skill point.\n* Quest 4 – Flashlight and +1 skill point.\n* Quest 5 – 2 painkillers, 2 first aid bandages, +2 skill points.\n* Quest 6 – Bicycle.\n\nClass mastery: None\n\n### Farmer Class\n\n**Grants the following:**\n\n* Quest 1 – Cowboy hat, t-shirt, denim pants, cowboy boots.\n* Quest 2 – 2 boiled water, 2 beef rations, +1 Living off the Land perk.\n* Quest 3 – 2 first aid bandage and +1 Sous Chef perk.\n* Quest 4 – No reward.\n* Quest 5 – Blunderbuss, 50 blunderbuss ammo and +1 Sous Chef perk.\n* Quest 6 – Iron Hoe Recipe.\n\nClass mastery: Gaining the two Mastery [perks](https://7daystodiemods.com/tag/7-days-to-die-perks/) grants the following:\n\n* Wheat Seed Recipe.\n* Carrot Seed Recipe.\n* Tomato Seed Recipe.\n* Banana, Orange, Coconut and Lime Tree Recipes.\n* Grandpa’s Awesome Sauce Recipe.\n* Grandpa’s Moonshine Recipe.\n* Grandpa’s Learnin’ Elixir Recipe.\n* Beer Recipe.\n* Roast Dinner Recipe.\n* Blueberry Pancakes Recipe.\n* Banana Pancakes Recipe.\n* Banana Bread Recipe.\n* Orange Marmalade Recipe.\n* Orange Tea Recipe.\n* Meat Bolognaise Recipe.\n* Veggie Bolognaise Recipe.\n\n### Hunter Class\n\n**Grants the following:**\n\n* Quest 1 – T-shirt, denim pants, worn boots, Cowboy Hat.\n* Quest 2 – 2 boiled water, 2 chicken rations, The Huntsman Perk.\n* Quest 3 – 2 first aid bandage.\n* Quest 4 – Scrap Machete, The Huntsman Perk.\n* Quest 5 – Pipe Rifle, 100 7.62mm Bullets, Stealth Assassin Perk.\n* Quest 6 – No Reward.\n\nClass mastery: Gaining the Hunter Mastery perk grants the following:\n\n* Titanium Machete Recipe.\n* Titanium Combat Axe Recipe.\n* Steel Crossbow Recipe.\n* Titanium Bolt Recipe.\n\n### Laborer Class\n\n**Grants the following:**\n\n* Quest 1 – T-shirt, brown denim pants, worn boots, mining helmet.\n* Quest 2 – 2 boiled water, 2 beef rations, Hammer and Forge Perk.\n* Quest 3 – 2 first aid bandage.\n* Quest 4 – Hammer and Forge Perk.\n* Quest 5 – Hammer and Forge Perk.\n* Quest 6 – Nailgun item.\n\nClass mastery: Gaining the Laborer Mastery perk grants the following:\n\n* Titanium frame recipes for building bases.\n* Titanium bar recipes (normal and centred).\n* All Titanium tools (Hammer, Fireaxe, Pickaxe, Shovel, Auger, Chainsaw)\n\n### Mechanic Class\n\n**Grants the following:**\n\n* Quest 1 – ZU Football T-Shirt, Overalls, Ball Cap, Worn Boots.\n* Quest 2 – 2 first aid bandage, Salvage Operations Perk.\n* Quest 3 – Wrench Item, Salvage Operations Perk.\n* Quest 4 – 2 boiled water, 2 chicken rations.\n* Quest 5 – Salvage Operations Perk.\n* Quest 6 – No Reward.\n\nClass mastery: Gaining the Mechanic Mastery perk grants the following:\n\n* Motorbike + Parts Recipe.\n* 4×4 + Parts Recipe.\n* Oil Pump Recipe.\n* Steel Wrench Recipe.\n* Car Battery Recipe.\n* Small Engine Recipe.\n\n### Scientist Class\n\n**Grants the following:**\n\n* Quest 1 – White jacket, t-shirt, suit pants, suit shoes.\n* Quest 2 – Physician Perk.\n* Quest 3 – 2 boiled water, 2 chicken rations, Self Medicated Perk.\n* Quest 4 – Scrap Machete Item.\n* Quest 5 – Physician Perk.\n* Quest 6 – No Reward.\n\nClass mastery: Gaining the Scientist Mastery perk grants the following:\n\n* Antibiotics Recipe.\n* Painkillers Recipe.\n* Paramedic Kit Recipe.\n* Coedine Pills Recipe.\n* Acid Recipe.\n\n### Security Class\n\n**Grants the following:**\n\n* Quest 1 – Army shirt, army pants, worn boots, ball cap.\n* Quest 2 – 2 boiled water, 2 chicken rations, Pain Tolerance Perk.\n* Quest 3 – Pipe Pistol, 100 9mm bullets.\n* Quest 4 – Flurry of Blows Perk.\n* Quest 5 – Pain Tolerance Perk.\n* Quest 6 – +1 skill point.\n\nClass mastery: Gaining the Security Mastery perk grants the following:\n\n* Titanium Armor Recipes (Chest, Boots, Gloves, Legs, Helmet).\n* Titanium Spiked Club Recipe.\n* M4A1 and all parts Recipes.\n\n### Survivalist Class\n\n**Grants the following:**\n\n* Quest 1 – T-Shirt, army pants, cowboy boots, cowboy hat.\n* Quest 2 – 2 murky water, 2 chicken rations, all leather armour recipes.\n* Quest 3 – 2 first aid bandage, 2 painkillers, +1 skill point.\n* Quest 4 – No Reward.\n* Quest 5 – Scrap Fireaxe, Pickaxe and Shovel recipes.\n* Quest 6 – Watch Recipe.\n\nClass mastery: Gaining the Survival Mastery perk grants the following:\n\n* Titanium Machete Recipe.\n* Survival Torch Recipe.\n* Radio Recipe.\n* Jerky Recipe.\n\n## Terms of Use\n\nThe use of SDX has allowed him to add various models and sound effects into the game, but some of these had to be purchased. As such, a Terms of Use is now required so he can properly detail what may and may not be used by other people in their projects. Personal use is fine, but they may not be redistributed. As such, here are the lists of what may and may not be used by other modders.\n\n### Available For Use\n\n* Any XML as this is originally property of TFP and I have simply expanded upon it.\n* Combat Axe – Available for free on the Unity store.\n* Water Barrel – Available for free on the Unity store.\n* Tomato Plant + Tomato – Available for free online and legally.\n* Original Behemoth – Property of TFP.\n* Frostbitten Worker – Property of TFP.\n* Female Lab Zombie – Property of TFP.\n* Health/Stamina/[Food](https://7daystodiemods.com/tag/7-days-to-die-food/)/Water bars – Property of TFP.\n* Item Icons – Either provided for use by Valmar on these forums, icons from previous alphas or icons altered by me.\n* Roadhog and sounds.\n\n### Not Available For Use\n\n* New UI textures.\n* Lockpicks.\n* Stone Hammer.\n* Stone Spear.\n* Radio.\n* Oil Pump.\n* Metal Workbench.\n* Laser Workbench.\n* Lathe.\n* Big Forge\n* Advanced Forge.\n* Fusion Forge.\n* Any of the “Sci Fi” stuff, like doors, desks, etc.\n* Laser Rifle, Pistol, Sword and new tool.\n* Male Lab Zombie.\n* AR-15.\n* Combat Shotgun.\n* P225.\n* Apple Tree’s + Apple.\n* Banana Tree’s + Banana.\n* Carrot Plant’s + Carrots.\n* Palm Tree’s + Coconut.\n* Wheat Plants.\n* Female Voice Lines for Bandit.\n* Female Voice Lines for Caitlin.\n* Winchester Rifle.\n* Laser Weapons.\n* Coil guns.\n* Steel Wrench.\n* Both Demons.\n* Armoured Car.\n\nPermission will never be granted to use items in the “not available for use” list due to EULA’s, so please don’t ask! All of them are available on the Unity store and he is happy to provide links to the various store items if people want them (and if they are still available). Any mods found using those assets will be repoted to the moderators. You have been warned.\n\n## Compatibility\n\nDarkness Falls is a total overhaul mod, which means KhaineGb has changed large amounts of the XML files on a permanent basis. Not all modlets will be compatible, therefore I thought it might be a good idea to start a list of ones that do work.\n\nUsing mods not on this list means he can not offer you support.\n\n### Confirmed Working\n\n* [Sorcery](https://7daystodiemods.com/sorcery-mod/) (A19 preview version confirmed working.)\n* Valmar’s Expanded Traps (other modlets here are not confirmed)\n\n**DO NOT INSTALL COMPO PACK.** It is already included, has been edited so quests work more reliably and better balance for loot/zombies.\n\n**DO NOT USE NITROGEN.** It does not obey biome restrictions KhaineGB has put in place for some POI’s.\n\n## Known Issues\n\n* Animals have some issues that need to be investigated.\n* Food/Water don’t display correctly. Anything over 100 doesn’t seem to work, so bear that in mind.\n\n## Changelog\n\nAlright folks, here it is. Darkness Falls V4.03A with compo pack included is now ready for everyone!\n\nThis update includes some required tweaks so the mod will now be compatible with XBox Game Pass versions of the game. Also, this version of the mod has been tested on both 20.4 and 20.5 experimental, so you can use whichever version of the game you wish.\n\nRegarding save compatibility, he has tested it on his youtube save, and there was no issue going from 20.4 and V4.03, to 20.5 and V4.03A. A new save is still recommended, as per TFP guidelines, but you CAN get away with not doing it.\n\n**Darkness Falls V4.03A**\n\n* Added Krunch’s 8k map and required POI’s.\n* CompoPack and required rwgmixer edits added.\n* Khaine’s version of the A19 Crack-A-Book tower added.\n* Edited the small Crack-A-Book POI to swap to new bookshelves.\n* Added new pre-generated maps that included the CompoPack. (they have CP at the end instead of NoCP)\n* Scoutsmod updated to run from any folder, and compiled into the main DF DLL file.\n* Scoutsmod now configurable via blocks.xml (info is at the bottom of the file).\n* Darkness Falls XML updated to allow it to run from any folder (including the new mod folder).\n\n## Installation Instructions (If you don’t use the mod launcher)\n\nMake a copy of your 7 Days to Die folder first!\n\nDownload the zip file at the link below. Unzip the Mods folder and Darkness Falls Icon and Serverconfig.xml to your 7 Days to Die folder. Overwrite when prompted.\n\nVideo here for folks who find that easier.\n\n## Installation Instructions for macOS Users\n\n**Important Note:** He does not have a mac. This is a guide he found for Starvation Mod and Ravenhearst, but it also works on War of the Walkers so it should be fine here.\n\n* 1) Uninstall 7dtd. Open Finder, from taskbar choose Go -> Home. Open Library -> Application Support -> Steam -> steamapps -> common. Delete 7 Days to Die folder. Reinstall 7 Days to Die.\n* 2) Unzip downloaded mod. Open unzipped folder. You should see 3 folders: 7DaysToDie\\_Data, Data, and Mods. I will be referring to this as a “home screen”.\n* 3) Open Steam. In your games Library, right-click 7 Days to Die and choose Properties from the drop-down menu. Choose the LOCAL FILES tab and choose BROWSE LOCAL FILES.\n* 4) Copy & paste (do not drag-and-drop) the Mods folder to this location.\n* 5) Open 7DaysToDie\\_Data -> Managed.\n* 6) Right-click 7DaysToDie.app and choose Show Package Contents. Here you should see 2 folders: Contents and Data. This will be the other “home screen”.\n* 7) Open Contents -> Resources -> Data -> Managed.\n* 8) Copy & paste (do not drag-and-drop) the .dll files into this location. Mac OSX will ask if you want to keep both or replace. Choose replace.\n* 9) Navigate back to each home screen.\n* 10) Drag-and-drop the 7DaysToDie\\_Data and Mods folders into this location.\n* 11) Open the Data folders in each location. You will see there are Config, Prefabs, and UMATextures folders in each.\n* 12) For each of these three folders, open up its corresponding folder so you can see the contents. Drag-and-drop the mod’s contents into its respective folder. For duplicate files, mac OSX will ask if you want to Skip, Stop, or Replace. Check the “Apply to All” checkbox, then choose Replace.\n* 13) Start 7 Days to Die and enjoy the mod!(edited)\n\n**Alpha 20 Version**  \n**[Download](https://dev.azure.com/KhaineUK/_git/DarknessFallsA20)** Client and Server for **A20** _(Not EAC Friendly. Click the 3 dots, select download as zip)_  \nAlso available on the mod launcher!  \n**Alpha 19 Versions**  \n**[Download](https://gitlab.com/KhaineGB/darknessfallsa19client/-/archive/master/darknessfallsa19client-master.zip)** Client for **A19** _(Not EAC Friendly)_  \n**[Download](https://gitlab.com/KhaineGB/darknessfallsa19server/-/archive/master/darknessfallsa19server-master.zip)** Server for **A19** _(Not EAC Friendly)_  \nAlso available on the mod launcher!\n\nIf you appreciate KhaineGB’s work and you want to show support, use the [Paypal](https://www.paypal.me/khainegb)/[Patreon](https://www.patreon.com/darknessfallsmod) link.\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/4941-darkness-falls-they-mostly-come-out-at-night/).\n\n**Credits:** [KhaineGB](https://7daystodiemods.com/tag/khainegb/)",
  "modDownloadURLs": [
    {
      "Info": "Alpha 20 Version",
      "Version": "v19"
    },
    {
      "Info": "Client and Server for A20 (Not EAC Friendly. Click the 3 dots, select download as zip)",
      "URL": "https://dev.azure.com/KhaineUK/_git/DarknessFallsA20",
      "Version": "v19"
    },
    {
      "Info": "Also available on the mod launcher!",
      "Version": "v19"
    },
    {
      "Info": "Alpha 19 Versions",
      "Version": "v19"
    },
    {
      "Info": "Client for A19 (Not EAC Friendly)",
      "URL": "https://gitlab.com/KhaineGB/darknessfallsa19client/-/archive/master/darknessfallsa19client-master.zip",
      "Version": "v19"
    },
    {
      "Info": "Server for A19 (Not EAC Friendly)",
      "URL": "https://gitlab.com/KhaineGB/darknessfallsa19server/-/archive/master/darknessfallsa19server-master.zip",
      "Version": "v19"
    },
    {
      "Info": "Also available on the mod launcher!",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/4941-darkness-falls-they-mostly-come-out-at-night/",
  "modAuthors": [
    "KhaineGB"
  ],
  "modTags": [
    "7 days to die backpack",
    "7 days to die bigger backpack",
    "7 days to die biomes",
    "7 days to die farming",
    "7 days to die food",
    "7 days to die hud mod",
    "7 days to die menu",
    "7 days to die more slots",
    "7 days to die perks",
    "7 days to die quests",
    "7 days to die skill points",
    "7 days to die tools",
    "7 days to die weapons",
    "7 days to die zombies",
    "KhaineGB"
  ]
}