{
  "modURL": "https://7daystodiemods.com/djkrebmen-supertool/",
  "modCreatedTime": "2021-09-23T05:51:30+00:00",
  "modLastUpdatedTime": "2021-10-04T20:54:01+00:00",
  "modName": "DJKREBMEN SuperTool",
  "modImages": [],
  "modShortDescription": "The DJKREBMEN SuperTool is the result of many hours of crafting community bases, tunnels, etc. and being sick of how long it takes.",
  "modDescription": "The DJKREBMEN SuperTool is the result of many hours of crafting community bases, tunnels, etc. and being sick of how long it takes. This mod aims to not only speed up and streamline the upgrade and destruction process, but also to give the user a wider area of view with a unique hold-type that shows the entire screen instead of a third of it being hidden by your [Auger](https://7daystodiemods.com/tag/7-days-to-die-tools/). Additionally, this frees up a spot in your hotbar by combining the DJKREBMEN “Tunnel Auger” in left click, and an upgraded, superfast nailgun on right click. This allows you to remove your Auger and Nailgun from your hotbar and replace it with this one item.\n\nThe mod is entirely server-side. It does not require the client to install any mods. Unpack into the Mods directory on your server like you would any other mod, and enjoy!\n\nIn the current implementation, this item is intentionally only spawn-able via the creative menu. If there is interest, I can create alternate versions upon request.\n\n**[Download](https://drive.google.com/file/d/137v55QRsJqgS6yiTwYbg3IcQWBDWJ3E5/view?usp=sharing)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/25404-djkrebmen-modlets/).\n\n**Credits:** DJKREBMEN",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/137v55QRsJqgS6yiTwYbg3IcQWBDWJ3E5/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/25404-djkrebmen-modlets/",
  "modAuthors": [
    "DJKREBMEN"
  ],
  "modTags": [
    "7 days to die tools"
  ]
}