{
  "modURL": "https://7daystodiemods.com/dlx-weapons-fix-aligned-sights-aiming-directly-from-the-scope-and-more/",
  "modCreatedTime": "2022-06-02T18:55:00+00:00",
  "modLastUpdatedTime": "2022-06-02T18:57:52+00:00",
  "modName": "DLX Weapons Fix - Aligned Sights, Aiming Directly From the Scope and More",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2022/04/7-days-to-die-dlx-weapons-fix-aligned-sights-aiming-directly-from-the-scope-and-more-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/04/7-days-to-die-dlx-weapons-fix-aligned-sights-aiming-directly-from-the-scope-and-more-additional-screenshot-2.jpg"
  ],
  "modShortDescription": "Welcome to DanyEr12LX's mod project! This mod was born with the purpose of fixing the iron sights of all weapons!",
  "modDescription": "Welcome to DanyEr12LX’s mod project!\n\nThis mod was born with the purpose of fixing the iron sights of all weapons! How? His goal is to adjust the height of the front sights, align them correctly with the rear sight, and add the latter to all weapons that are missing one.\n\nOver time he has gradually improved other aspects and added new components where he could.\n\nHere he completely overhauled the concept of aiming with the scope, using the real scope on the weapon rather than a small reticle drawn on a black background.\n\nThis game has caught his attention since the very earliest alphas (He’s one of the players who played Alpha 1 back in 2013) and he fell in love with this game from the early days. But there are some things, like weapon mechanics, that have always left him wanting. That’s why, starting a few months ago, he finally learned how to edit and create a mod for this game.\n\nThis is the first in a series of Mods that will cover the majority of current weapons.\n\n**Weapons currently treated:** Pistol, Ak 47, Hunting Rifle, SMG. Over time he will cover other weapons, such as the Magnum, Lever Action Rifle and so on.\n\nStay Tuned for more additions…\n\n**P.S.** He recommend using this mod alongside Ragnar’s Mod [FovChanger](https://github.com/RagnarHbUa/7d2dWeaponFovChanger/releases/download/v1.0.0/Ragnars_FovChanger.rar) and set it to 60.\n\n## So, Here’s What’s in This Mod\n\n### Main Goal\n\n#### Sight\n\n* The rear sight is shortened to the right height.\n* The Scope, Reflex, and the Iron sight are perfectly aligned.\n* Replaced the Iron Sight with a New One when the original does not fit the aesthetics of the gun.\n* Added a Front/Rear Sight when the gun misses this kind of element.\n* Rounded and Improved the back side of the gun so that this part does not lose quality when aiming.\n* CameraOffset Z, which is basically the zoom on the weapon when aiming, is correctly set.\n\n#### Scope Overhaul\n\n* Completely overhauled the Scope concept, removing the old zoom method accompanied by a reticle in a completely black background.\n* You can now use the Scope directly from the Scope Model (In a COD-BF style).\n* Added an external slide that reflects the external environment in a dynamic way.\n* The inner slide contains a reticle and a central bright spot, all set in a dusty reddish background.\n* Improved Textures, so that you can zoom in on the Scope model without losing texture quality.\n* Improved Mesh, so that you can zoom in on a well rounded Scope model.\n* The Zoom is correct: by aiming the objects will be magnified exactly twice for the 2X, four times for the 4X and eight times for the 8X Scope.\n* Added Scratches on the right side of the Scope to help distinguish the 2X and 4X scopes.\n* Added a Blur Background for the 4X and 8X Scope.\n\n#### Bullet Shell and Muzzle Smoke, Muzzle Fire and Muzzle Light\n\n* Added a Bullet Shell of the right caliber that exits the [weapon](https://7daystodiemods.com/tag/7-days-to-die-weapons/) chamber, visible both when shooting from the hip and when aiming.\n* The Bullet Shell dynamically interacts with the external environment.\n* Added Muzzle Smoke coming out of the chamber after firing.\n* Added Muzzle Fire, consisting of 3 different particles, different in shape each time the weapon fires.\n* Added a Muzzle Light that illuminates the surroundings of the weapon.\n\n#### Animations\n\n* Improved Weapon Fire and Weapon Reload Animations to make them smoother.\n* New weapon components have been animated, such as the Pistol Hammer or the Ak 47 Charging Handle.\n\n#### New Mod Models\n\nAdded new models for mods currently not visible on the weapon, such as the Magazine Extender, Muzzle Brake, Fore Grip etc…\n\n### Other Details Specific to the SMG\n\n#### Model and Texture Modification\n\n* Improved SMG Texture on the back of the gun.\n* Improved SMG Iron Sight Texture.\n* Added Roughness and Metallic Texture on the Iron Sight and on the back of the gun.\n* Rounded SMG Mesh on the back of the gun.\n* Totally Replaced the Front and the Rear Sight with a New One.\n\n#### Animations\n\n* Added and animated the Action, i.e. the part where the Bullet Shells exit.\n* Improved Mesh and Texture of the spent Bullet Shell.\n\n#### New Mod Models\n\n* Added a model for the Retracting Stock (Before this you couldn’t even use this mod on the SMG).\n* Added a model for the Fore Grip.\n* Added a model for the Magazine Extender.\n* Added a model for the Drum Magazine.\n* Added a model for the Muzzle Brake.\n* Added a model for the Barrel Extender.\n\n### Other Details Specific to the Hunting Rifle\n\n#### Model and Texture Modification\n\n* Improved Hunting Rifle Texture around the Iron Sight.\n* Totally Replaced the Iron Sight with a New One.\n* Removed the Rail on the top of the gun. Now it appears only when a scope/reflex is attached.\n\n#### Animations\n\n* Added Recoil in Fire Animation.\n* Slightly changed the Reload Animation to be more powerful.\n\n#### Reflex and Laser\n\n* Updated the Reflex Mesh in order to be more open and clear.\n* Moved the Laser near the lateral Rail.\n\n#### New Mod Models\n\n* Added a model for the Retracting Stock.\n* Added a model for the Fore Grip.\n* Added a model for the Bipod.\n* Added a model for the Muzzle Brake.\n* Added a model for the Barrel Extender.\n\n### Other Details Specific to the AK 47\n\n#### Model and Texture Modification\n\n* Revised AK 47 Model.\n* Revised Ak 47 Texture.\n* Added a Roughness, Metallic and Ambient Occlusion Texture\n* Removed the Rail on the top of the gun. Now it appears only when a scope/reflex is attached.\n* The Dust Cover is further rounded.\n\n#### Charging Handle\n\nAnimated the Charging Handle each time the weapon fires.\n\n#### New Mod Models\n\n* Added a model for the Magazine Extender.\n* Added a model for the Drum Magazine.\n* Added a model for the Retracting Stock.\n* Added a model for the Fore Grip.\n* Added a model for the Bipod.\n* Added a model for the Muzzle Brake.\n* Added a model for the Barrel Extender.\n\n### Other Details Specific to the Pistol\n\n#### Scope Overhaul\n\n* The Scope has been moved to the right position.\n* Now it follows the Slide when the weapon fires and reloads.\n\n#### Reflex\n\n* The Reflex has been moved to the right position.\n* It has been also resized.\n* Now it follows the Slide when the weapon fires and reloads.\n* The textures have been adjusted and aligned with the pistol’s sight.\n* The Reflex dot is now a bright spot.\n* The Reflex glass is redesigned to be a dusty and reddish glass.\n\n#### Hammer and Firing Pin\n\n* The hammer is lowered to the loading position.\n* It is also animated during PistolFire and PistolReload animations.\n* Furthermore, the Mesh and the Texture of the Slide have been modified, adding the firing pin.\n\n#### Laser and Silencer\n\n* The Laser is now a real laser, aiming directly from the gun barrel and following the player’s movements.\n* Reduced the size of the Silencer so you can use it when aiming from the iron sight.\n\n#### New Mod Models\n\n* Added a model for the Muzzle Brake Mod.\n* Added a model for the Extender Barrel Mod.\n\n## How to Install\n\n* Download the Latest Version.\n* Unzip “DLX-Weapons\\_Fix.rar”.\n* Drag-n-Drop the Folder “DLX-Weapons\\_Fix” to Your 7 Days To Die “Mods” Folder, (…\\\\7 Days To Die\\\\Mods).\n* For safety purpose, Disable EAC (this is not necessary, but you never know)\n* Play da game.\n\n## Terms of Use\n\n* The Mod Author and Developer of this Mod, DLX Weapons Fix, is DanyEr12LX.\n* The Mod Author allows to use DLX Weapons Fix with or without any kind of modifications. Remember that all these are restricted to private use only unless otherwise indicated with the written consent of the Mod Author.\n* The Mod Author is not responsible for any damage and/or corruption of game files (including save files), that may be inflicted during and after the installation of DLX Weapons Fix.\n* The use, reuse, share, modification, copying, duplication and/or distribution of DLX Weapons Fix, all the files included DLX Weapons Fix and in the asset file, in any format and in any form, is prohibited outside of private use only unless otherwise indicated with the written consent of the Mod Author.\n* After having a written consent in any form from the Mod Author to do one of the aforementioned actions outside of private use, you are obligated to give appropriate credit to the Mod Author and provide a link to the original source of DLX Weapons Fix.\n\n## Changelog\n\n**Update: Time for the SMG to Shine With the New Version 1.3.36**\n\nIn this Update he focused on SMG.\n\nHere is a summary.\n\n* Iron sight is perfectly aligned.\n* Totally Replaced the Iron Sight with a New One.\n* Totally Replaced the Front and the Rear Sight with a New One.\n* Improved SMG Texture on the back of the gun.\n* Improved SMG Iron Sight Texture.\n* Added Roughness and Metallic Texture on the Iron Sight and on the back of the gun.\n* Rounded SMG Mesh on the back of the gun.\n* Zoom on the weapon when aiming is correctly set.\n* You can now use the Scope directly from the Scope Model.\n* Zoom on the weapon when aiming with Scope is correctly set.\n* Improved Scope Textures.\n* Improved and Rounded Scope Mesh.\n* Added a Spent Bullet Shell that dynamically interacts with the external environment.\n* Added and animated the Action, i.e. the part where the Bullet Shells exit.\n* Improved Mesh and Texture of the spent Bullet Shell.\n* Added Muzzle Smoke, Muzzle Fire and Muzzle Light.\n* Animations have been made smoother.\n* Improved SMG Texture around the Iron Sight.\n* Added new models for mods currently not visible on the weapon.  \n   * Retracting Stock (Before this you couldn’t even use this mod on the SMG).  \n   * Fore Grip.  \n   * Magazine Extender.  \n   * Drum Magazine.  \n   * Muzzle Brake.  \n   * Barrel Extender.\n\nStay Tuned for more additions!\n\n**[Download](https://drive.google.com/drive/folders/1a9pBvsjxlxiEuJ6fJiXHwaOvnkNscjQ3?usp=sharing)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/28433-dlx-weapons-fix-a20-aligned-sights-aiming-directly-from-the-scope-and-more/).\n\n**Credits:** DanyEr12LX",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/drive/folders/1a9pBvsjxlxiEuJ6fJiXHwaOvnkNscjQ3?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/28433-dlx-weapons-fix-a20-aligned-sights-aiming-directly-from-the-scope-and-more/",
  "modAuthors": [
    "DanyEr12LX"
  ],
  "modTags": [
    "7 days to die weapons"
  ]
}