{
  "modURL": "https://7daystodiemods.com/dmt-mods-by-sphereii/",
  "modCreatedTime": "2020-09-26T15:32:00+00:00",
  "modLastUpdatedTime": "2020-09-26T15:40:17+00:00",
  "modName": "DMT Mods by SphereII",
  "modImages": [],
  "modShortDescription": "SphereII's all 7 Days to Die DMT mods are here for you. Bloom's Animal Husbandry, A better life, Music Box, NPC Dialog Boxes, SyX Security Bots and more.",
  "modDescription": "SphereII’s all 7 Days to Die DMT mods are here for you. Bloom’s Animal Husbandry, A better life, Music Box, NPC Dialog Boxes, SyX Security Bots and more.\n\nThis mod is not EAC-safe, and EAC must be turned off. Compatible with A18.\n\nThis is still a work in progress; Each feature is available, however may not be completely refined yet. Balancing and suggestions are welcomed.\n\n0-SphereIICore is a new concept that provides all the functionality and scripts I provide, which can be turned on and off through a central block. This central block can be manipulated in your own modlets to turn on and off features, and change settings. This mod is named as it is so that it is loaded first, allowing all subsequent mods to make changes to it.\n\n## 0-SphereIICore\n\nA new mod pack called 0-SphereIICore is now available for use, either in standalone or inclusion to any other mod package, without any limitation.\n\nThis pack contains a large variety of Scripts, PatchScripts, and Harmony scripts that adds to and enhances vanilla features.\n\n### Key Features:\n\n* **AnimationSDX:** Provides animation hooks for custom entities\n* **Food Spoilage System:** Allow food to expire at a global rate, or fine tune individual foods to spoil at different rates.\n* **Enhanced Item Repair:** Allow more complicated repair recipes\n* **Item Damage / Durability:** The amount of damage an item can do is reduced as durability goes down. Repair often!\n* **Anti-Nerd Pole:** Disables the ability to nerd pole, or jump-and-place a blocks/block\n* **Soft Hands:** Your hands are soft! Player takes damage when punching things with bare hands.\n* **One Block Crouch:** Enhance your Agility character by allowing you to crawl through one block openings.\n* **Transmogrifier:** Allow random walk types and sizes for zombies to break up the monotony\n* **UMA Tweaks:** Small tweaks to UMA system, drastically reducing the high resolution UMAs into something more manageable.\n* **Head Shot Only:** Take off their heads to truly kill them.\n* **Zero XP:** Don’t like getting experience? Turns off the ability to get a new kind of experience.\n* **Disable XP Pop up:** Disables the XP icon pop up\n* **No Exception Hijack:** Prevents the console from popping down with Red error. Useful for when you are testing…\n* **Disable Trader Protection:** Turn off the invulnerability of the trader compound.\n* **Quick Continue:** Keep your Scroll Lock button on to automatically load up the last game you played.\n* Custom Buffs, AI Tasks, Items, Blocks, Entity classes, and XUiC components are already active. Make the right calls in your XML to enable the functionality.\n\nFeatures can be turned on and off by adding xpath set from another modlet and changing the included “ConfigFeatureBlock” in Config/blocks.xml\n\n**Example:**\n\n```\n<configs>\n  <set xpath=\"/blocks/block[@name='ConfigFeatureBlock']/property[@class='FoodSpoilage']/property[@name='FoodSpoilage']/@value\">true</set>\n  <set xpath=\"/blocks/block[@name='ConfigFeatureBlock']/property[@class='AdvancedPlayerFeatures']/property[@name='OneBlockCrouch']/@value\">true</set>\n  <set xpath=\"/blocks/block[@name='ConfigFeatureBlock']/property[@class='AdvancedNPCFeatures']/property[@name='MakeTraderVulnerable']/@value\">true</set>\n  <set xpath=\"/blocks/block[@name='ConfigFeatureBlock']/property[@class='AdvancedPrefabFeatures']/property[@name='DisableTraderProtection']/@value\">true</set>\n  <set xpath=\"/blocks/block[@name='ConfigFeatureBlock']/property[@class='AdvancedWorldGen']/property[@name='DisableSplatMap']/@value\">true</set>\n</configs>\n```\n\n## Bloom’s Animal Husbandry\n\nIntroducing basic [animal](https://7daystodiemods.com/tag/7-days-to-die-animals/) husbandry, Bloom’s Animal Husband comes with a few animals that spawn in random herds. Animals have likes and dislikes, and can be encouraged to fall you home with the right incentive.\n\n## SphereII A Better Life\n\nFish, birds, and small animal gains are introduced in this work-in-progress mod.\n\n## SphereII Clear UI\n\nInspired from The Walking Dad, re-worked through Harmony and [UI](https://7daystodiemods.com/ui-mods/) adjustments by Sirillion, Clear UI removes all on screen elements for a truly immersive experience. \\[Only a small health and stamina bar are visible in place of the compass\\]\n\n## SphereII Food Spoilage\n\nThis modlet enables the actual [food](https://7daystodiemods.com/tag/7-days-to-die-food/) spoilage system found in SphereII Core, with some preset global values for all non-can food items. Use this to get started with adding your own unique twist to spoilage.\n\n## SphereII Music Box\n\nThis modlet enables the Music and Video player originally implemented in the Winter Project, and can play CDs and DVDs found in the world.\n\n## SphereII NPC Dialog Boxes\n\nThis modlet enables a special UI interface, designed by Sirillion, to talk with NPCs\n\n## SphereII Take And Replace\n\nThis modlet enables the Take And Replace, which allows you to pull off boards from windows and [doors](https://7daystodiemods.com/tag/7-days-to-die-doors/) without brute force. Hold a hammer or a crowbar (not included) to make this go faster!\n\n## SphereII Winter Project\n\nEnter the cold and unforgiving world buried under a snow apocalypse. Find new challenges as you explore the desolate icy wasteland, and see if you can unlock [Winter Project](https://7daystodiemods.com/winter-project/)’s secrets.\n\n## SyX Security Bots\n\nIn the fight against the degradation of society, SyX Security has produced a series of counter-measures against the so-called “zombie apocalypse”. Deployed in infected hot spots around the world, these counter-measures have been designed to reduce and ultimately send the [zombie](https://7daystodiemods.com/tag/7-days-to-die-zombies/) apocalypse into remission.\n\n**Warning:** These hot spots are extremely dangerous for the non-infected, and any survivors are strongly recommended to be evacuated before they are deployed.\n\n**Compatible Mods:** [NPCs Mod](https://7daystodiemods.com/npcs-mod/), [Bandits Mod](https://7daystodiemods.com/bandits-mod-for-a18/), [Wandering Traders Mod](https://7daystodiemods.com/wandering-traders-mod-for-a18/)  \n**Required Tool:** [DMT Modding Tool](https://community.7daystodie.com/topic/13037-dmt-modding-tool/)\n\n## Changelog\n\nNew 0-SphereIICore update pushed (19.1.1.213). It is only compatible with 19.1, and not previous versions.\n\n* Generate code quality improvements were done\n* A bad null check fixed in music box logic\n* Slightly refactored other null checks to be cleaner\n* (hopefully) improved cave generation speed and performance\n* Changed CaveAir back to Air. Let me know if this causes any stability issues.\n* Added in cave biome spawning. Check spawning.xml for new entries Cave and DeepDave ( used when y < 30 ).\n* Added in DeepCavePrefabs for deep-only prefab spawning.\n\n**[Download](https://github.com/SphereII/SphereII.ModsA19/archive/master.zip)** for A19  \n**[Download](https://github.com/SphereII/SphereII.Mods/archive/master.zip)** for A18\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/10628-sphereiis-dmt-mods/).\n\n**Credits:** [SphereII](https://7daystodiemods.com/tag/sphereii/)",
  "modDownloadURLs": [
    {
      "Info": "for A19",
      "URL": "https://github.com/SphereII/SphereII.ModsA19/archive/master.zip",
      "Version": "v19"
    },
    {
      "Info": "for A18",
      "URL": "https://github.com/SphereII/SphereII.Mods/archive/master.zip",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/10628-sphereiis-dmt-mods/",
  "modAuthors": [
    "SphereII"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die doors",
    "7 days to die food",
    "7 days to die npcs",
    "SphereII"
  ]
}