{
  "modURL": "https://7daystodiemods.com/electricity-overhaul-mod/",
  "modCreatedTime": "2022-05-21T01:31:00+00:00",
  "modLastUpdatedTime": "2022-05-21T01:37:21+00:00",
  "modName": "Electricity Overhaul Mod",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/10/7-days-to-die-electricity-overhaul-mod-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/10/7-days-to-die-electricity-overhaul-mod-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/11/7-days-to-die-electricity-overhaul-mod-additional-screenshot-3.jpg"
  ],
  "modShortDescription": "This mod tries to solve issues with the existing electricity implementation and tries to improve overall handling with power items and sources.",
  "modDescription": "ocbMaurice would like to proudly present his Electricity Overhaul Mods.\n\nThis mod tries to solve issues with the existing electricity implementation and tries to improve overall handling with power items and sources. It lets you form bigger grids with multiple power source that feel more natural. It consists of several other smaller mods that should all work standalone. Pick the ones you like and install them beside the overhaul mod.\n\n* [Electricity Wire Colors](https://github.com/OCB7D2D/ElectricityWireColors/archive/refs/heads/master.zip) (A20/Harmony)\n* [Electricity Workarounds](https://github.com/OCB7D2D/ElectricityWorkarounds/archive/refs/heads/master.zip) (A20/Harmony)\n* [Electricity Buttons Push](https://github.com/OCB7D2D/ElectricityButtonsPush/archive/refs/heads/master.zip) (A20/Harmony)\n* [Electricity No Wires](https://7daystodiemods.com/dmt-mod-to-hide-wires-when-wiring-tool-is-not-equipped/) (A20/Harmony)\n* [Electricity Solar Recipes](https://github.com/OCB7D2D/ElectricitySolarRecipes/archive/refs/heads/master.zip) (XML)\n* [Electricity Lamps](https://7daystodiemods.com/new-and-better-electric-lamp-light-blocks/) (A20/Harmony)\n* [Electricity Wind Power](https://7daystodiemods.com/electricity-wind-power/) (A20/Harmony)\n\n## UL Support (1.0.0)\n\n* Introducing compatibility for UL (experimental). Rename this mod to e.g ZElectricityOverhaul to load after UL\n* Charging demand for batteries changes according to fill state. Nearly empty batteries charge faster than nearly full ones\n* Items in solar banks and windmills degrade very slowly. Can be repaired quite easily (maintenace needed \\~10d)\n* Replaces BatteryChargeDemand for min/max smoothstep configs\n* Adds new game option to prefer fuel over batteries\n* Adds extended info when hovering over power sources. Needs [OcbRemoteDescription](https://github.com/OCB7D2D/OcbRemoteDescription) to work in multiplayer\n* Adds German translations\n\n## Compatibility Release A20.4 b42 (0.9.4)\n\n* Fix compatibility for Alpha 20.4 (b42)\n* Automated deployment and release packaging\n* Fix backward/forward game dll compatibility\n\n## Compatibility Update (0.9.3)\n\n* Fix EnumGamePrefs patching to be more dynamic\n* Fixes compatibility with Alpha 20.4 (b38)\n* Fixes server.xml parsing on dedicated servers (0.9.1)\n\n## Performance Update (0.9.0)\n\nThis release only tries to optimize CPU utilization and to improve frame update congestion. As such this update is kinda experimental, although the changes seem rather safe, but there will always be dragons. So if you’re happy with version 0.8.0 you don’t need to upgrade immediately. Upgrading existing maps should be possible, but you should always make a Backup when early adopting such a mod upgrade!\n\n## Compatibility Update (0.8.0)\n\n* Fixed some compatibility issues with other mods  \n   * They now use ‘OutputPerStack’ as a scaling factor  \n   * They no longer hard-code ‘MaxFuel’ for generators\n* Cleaned up and refactored update routine a bit\n* Improved and fixed ‘EnumGamePrefs’ patching\n\n## Linux Update (0.7.4)\n\nThere is also a version for linux, but you need to start the game via s special startup scripts to get the pre-loading hook working (e.g. startmodserver.sh). Those script will also be installed after the first initial loading of the mod.\n\n## Important Update (0.7.2)\n\nHe has ported this mod over to A20\\. Unfortunately given the nature of what it changes, it still is not 100% working out of the box with A20, but he got it pretty close! You can download this mod like any other regular mod, but once you start up the game for the first time you get a “scrambled” start screen and the console should show up (otherwise you can bring it up with F1). It should tell you that it has installed some additional files into the game folder that allows preload patching via BepInEx, which this mod requires to work correctly. You should just need to restart the game once after installing this mod and it should work OOTB.\n\nThis is all very experimental at the moment, but he hope it does work out!\n\n## Main Features\n\n* Power sources can be connected like every other power item\n* Power can be taken from any upstream power source\n* Prioritize renewable energy before using gasoline\n* Additional grid demand/supply and charge statistics\n* Batteries are all charged/discharged when in a bank\n* Recipes for solar panels and cells (behind engineering perk)\n* Solar power gradually fades in and out at dawn and dusk.\n\n## Additional Features (Also Compatible With Vanilla Game)\n\n* Color wires according to power state – see which ones are un(der)powered\n* Hide [wires](https://7daystodiemods.com/tag/7-days-to-die-electricity/) when the wiring tool is not equipped (except trip wires and fence posts)\n* Fix issue with power duration and e.g. motion sensors\n* Fix issue with trigger groups forcefully untriggering downstream triggers\n* Fix issue with start delay and triggered duration if trigger is too fast\n\n## Compatibility and Further Notes\n\nThis is the first “release” and while he tested it quite thoroughly, he hasn’t really used this mod for a full game yet. So he does expect that there are a few bugs lurking in there. He also doesn’t know how well this will scale in multi-player, since it does add quite a lot more load than the original implementation, but might be just fine even with bigger and more grids.\n\nHe has developed and tested this mod against version a20.b218.\n\n**[Download](https://github.com/OCB7D2D/ElectricityOverhaul/releases/download/1.0.0/ElectricityOverhaul-1.0.0.zip)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/25507-electricity-overhaul-mod/).\n\n**Credits:** [ocbMaurice](https://7daystodiemods.com/tag/ocbmaurice/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/OCB7D2D/ElectricityOverhaul/releases/download/1.0.0/ElectricityOverhaul-1.0.0.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/25507-electricity-overhaul-mod/",
  "modAuthors": [
    "ocbMaurice"
  ],
  "modTags": [
    "7 days to die electricity",
    "ocbMaurice"
  ]
}