{
  "modURL": "https://7daystodiemods.com/elemental-bullets/",
  "modCreatedTime": "2019-12-14T14:46:16+00:00",
  "modLastUpdatedTime": "2020-06-02T00:04:41+00:00",
  "modName": "Elemental Bullets",
  "modImages": [],
  "modShortDescription": "Adds two mods for guns, shotguns and revolver. One releases the hell on earth on an enemy (fire), the other stuns and gives electrical damage.",
  "modDescription": "Adds two mods for guns, shotguns and revolver. One releases the hell on earth on an enemy (fire), the other stuns and gives electrical damage. Both mods can’t be uses together, since they’re OP by themselves. And because of that: You can’t buy the schematics: You have to find them. They’re as rare as the radremover. And even if you find the schematics: The [recipes](https://7daystodiemods.com/tag/7-days-to-die-recipes/) are hard too. So you’re required to know how to craft electrical fence posts and forges. Both sounds harmless? You’re required to have – and just as one component – either 10 electrical fence posts (for the shocking mod), or 10 forges (for the burning mod).\n\nClaymore is not unfair: You have a tiny chance to find the mods. But they’re rare. Good luck!\n\nP.S.: Claymore won’t make them work for bows, crossbows or rocket launchers. Don’t ask.\n\nCompatibility: A18+\n\n**Changes:**\n\n* 1.1.0 Forgot to add the burning shematic to the [loot](https://7daystodiemods.com/tag/7-days-to-die-loot/)list. Sorry.\n* 1.1.1 Bugfix\n* 1.1.2 Localization fix\n\n[Download](https://www.mediafire.com/file/1dbntn7qb74dj1c/Claymore_Elemental_Bullets.zip/file)\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/15031-claymores-modlets/).\n\n**Credits:** [Claymore](https://7daystodiemods.com/tag/claymore/)",
  "modDownloadURLs": [
    {
      "Info": "\nAdds two mods for guns, shotguns and revolver. One releases the hell on earth on an enemy (fire), the other stuns and gives electrical damage. Both mods can’t be uses together, since they’re OP by themselves. And because of that: You can’t buy the schematics: You have to find them. They’re as rare as the radremover. And even if you find the schematics: The recipes are hard too. So you’re required to know how to craft electrical fence posts and forges. Both sounds harmless? You’re required to have – and just as one component – either 10 electrical fence posts (for the shocking mod), or 10 forges (for the burning mod).\nClaymore is not unfair: You have a tiny chance to find the mods. But they’re rare. Good luck!\n\nP.S.: Claymore won’t make them work for bows, crossbows or rocket launchers. Don’t ask.\nCompatibility: A18+\nChanges:\n1.1.0 Forgot to add the burning shematic to the lootlist. Sorry.1.1.1 Bugfix1.1.2 Localization fix\nDownload\nThe forum topic of the mod is here.\nCredits: Claymore\nShare this mod with your friends:\n\n",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/15031-claymores-modlets/",
  "modAuthors": [
    "Claymore"
  ],
  "modTags": [
    "7 days to die ammo",
    "7 days to die recipes",
    "7 days to die weapons",
    "Claymore"
  ]
}