{
  "modURL": "https://7daystodiemods.com/entity-randomizer/",
  "modCreatedTime": "2021-09-15T10:58:00+00:00",
  "modLastUpdatedTime": "2022-03-12T21:58:15+00:00",
  "modName": "Entity Randomizer",
  "modImages": [],
  "modShortDescription": "A 7 Days to Die modlet generator that makes copies of entities and randomizes them. The script currently can randomize zombie and animal entities.",
  "modDescription": "A 7 Days to Die modlet generator that makes copies of entities and randomizes them. The script currently can randomize zombie and animal entities.\n\nThe randomizer script that generates the modlet is still very experimental BUT modlets generated from it are being put here for use/comments to help polish the script for release.\n\nDoughphunghus highly recommend using one of the pre-generated modlets below before attempting to use the script! These pre-genrated modlets have been tested to prove they work in game.\n\n**Warning:** You can trash/break your computer if you are not familiar with properly installing perl (some OS’s have a built in perl and you DO NOT want to modify or remove it)\n\nDo not attempt to use the script unless you are familiar with installing perl, possibly installing build tools (compiler, etc, maybe needed to install perl depending on your OS), intalling the script dependencies, virtualizing the perl environment (probably desired), and the 7D2D entity XML you will need to build a config file.\n\n## Warning\n\n* The script is not well tested. Do not try to run it until you have read and understood the documentation.\n* The script may not generate 7 Days to Die modlets that work properly with the game.\n\nDocumentation for how to install perl + dependencies on Mac, Windows, and Unix: See [wiki](https://github.com/doughphunghus/7D2D-EntityRandomizer/wiki).\n\nDocumentation for how to setup the config file/run the script: See [wiki](https://github.com/doughphunghus/7D2D-EntityRandomizer/wiki).\n\nIf you are using a pre-generated modlet below, load the modlets in the table below that’s specific to your game version! Only load one “entity type” (e.g. don’t load 2 zombie ones together, if more than 1 choice exists)\n\n## Current Pre-generated Modlets – Notes\n\n* **Doughs-RandEnts\\_For\\_a19.5-b50\\_vanilla-enemy-animals-only-600-clones** – 600 clones of vanilla zombie animals, with localization (Recommend loading an enemy health bar viewer modlet to see the names!)\n* **Doughs-RandEnts\\_For\\_a19.5-b50\\_vanilla-friendly-animals-only-400-clones** – 400 clones of vanilla friendly/wild animals, with localization (Recommend loading an enemy health bar viewer modlet to see the names!)\n* **Doughs-RandEnts\\_For\\_a19.5-b50\\_vanilla-zeds-only-4920-clones** – 4920 clones of vanilla zombies (Recommend loading an enemy health bar viewer modlet to see the names!)\n* **Doughs-RandEnts\\_For\\_a19.4-b7\\_vanilla-enemy-animals-only-600-clones** – 600 clones of vanilla zombie animals, with localization (Recommend loading an enemy health bar viewer modlet to see the names!)\n* **Doughs-RandEnts\\_For\\_a19.4-b7\\_vanilla-friendly-animals-only-400-clones** – 400 clones of vanilla friendly/wild [animals](https://7daystodiemods.com/tag/7-days-to-die-animals/), with localization (Recommend loading an enemy health bar viewer modlet to see the names!)\n* **Doughs-RandEnts\\_For\\_a19.4-b7\\_vanilla-zeds-only-4920-clones** – 4920 clones of vanilla zombies (Recommend loading an enemy health bar viewer modlet to see the names!)\n* **Doughs-RandEnts\\_For\\_a19.3-b6\\_vanilla-enemy-animals-only-600-clones** – 600 clones of vanilla zombie animals, with localization (Recommend loading an enemy health bar viewer modlet to see the names!)\n* **Doughs-RandEnts\\_For\\_a19.3-b6\\_vanilla-friendly-animals-only-400-clones** – 400 clones of vanilla friendly/wild animals, with localization (Recommend loading an enemy health bar viewer modlet to see the names!)\n* **Doughs-RandEnts\\_For\\_a19.3-b6\\_vanilla-zeds-only-4920-clones** – 4920 clones of vanilla zombies, with localization (Recommend loading an enemy health bar viewer modlet to see the names!)\n* **Doughs-RandEnts\\_For\\_a19.2-b4\\_vanilla-enemy-animals-only-600-clones** – 600 clones of vanilla zombie animals, with localization (Recommend loading an enemy health bar viewer modlet to see the names!)\n* **Doughs-RandEnts\\_For\\_a19.2-b4\\_vanilla-friendly-animals-only-400-clones** – 400 clones of vanilla friendly/wild animals, with localization (Recommend loading an enemy health bar viewer modlet to see the names!)\n* **Doughs-RandEnts\\_For\\_a19.2-b4\\_vanilla-zeds-only-4920-clones** – 4920 clones of vanilla zombies (may not be server side safe! Possible a file is too large and will not transfer. Researching this), with localization (Recommend loading an enemy health bar viewer modlet to see the names!)\n* **Doughs-RandEnts\\_For\\_a19.2-b4\\_vanilla-zeds-only-492-clones** – 492 clones of vanilla zombies (likely server side safe!), with localization (Recommend loading an enemy health bar viewer modlet to see the names!)\n\n## See Also: Other Randomizer Mods\n\n[trubs-variants](https://github.com/trub64/trubs-variants): An entity randomizer for a20 and has new/other features like AI randomization. Doughphunghus just ran across it, haven’t tried it, but definitely give it a try if you’re looking for random zeds for a20+.\n\n## Notes\n\nThis is still in a very experimental stage of development. If a zombie in a pre-generated modlet here is really bad, please submit an issue [here](https://github.com/doughphunghus/7D2D-EntityRandomizer/issues) with the modlet name and name of the zombie. Zombies names start with doughsR. You’ll have to be in debug mode in the script (or also if viewing teh zombie in the game) to see the name.\n\nThe pre-generated modlet entities are “generally” tougher/faster than the vanilla zombies. The randomizer was tweaked to make slow/weak zeds more unlikely. They can still happen though.\n\nThe vanilla zombies are not removed from the game. This just adds more copies of them.\n\nThere is no cosmetic/skinning changes to the vanilla zombies. They all look the same, on purpose. Other than a non vanilla speed, size or walk type, you can’t tell what properties are different from the vanilla zeds as they approach.\n\nHe will be generating modlets with the names of this pattern: Doughs-RandomizedEntities-For– This is the “modlet” folder you put into the Mods folder. It is highly likely that if you don’t use the modlet with the exact same version of your game, there may be issues (like no zombies spawning).\n\nAt a high level, the randomizer script (currently) that generates the modlet attempts to do these things:\n\n1. Make a copy of the zombie entities in the game, giving them a new, unique name\n2. For each entity, randomizes characteristics as set in the config file.\n3. Based on the config file settings, loops and runs again, so more random copies can be made of each zed.\n4. Writes out an XML modlet containing all the random entities, and adds them to all the entity groups they normally spawn in.\n\nAlso note, for the pre-generated modlets: The “randomness” is not completely random. Each metric gets a different “randomness” varience, and some metrics are tweaked. For example:\n\n* If a zombie is a crawler type, the zomnie copy will not have a random walk type (because a legless crawler can float in midair if its made to walk)\n* In some cases, where its not easy to get a metric, he has manually chosen a metric to center the randomness around.\n* Some [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) may be “too big” to fit through doors generally he tried to center size randomness so they will not be, but it may happen\n\n## Config File Argument Documentation (Very WIP, Subject to Change)\n\nOnce perl and dependencies are installed, the script is run like so: Open a shell, cd to the project directory, and run (example) perl ./randomizer.pl –config-file ./config\\_example\\_TEST\\_all\\_entities.json\n\nwhere:\n\n–config-file = REQUIRED. The JSON formatted config file to use.\n\nSee the example JSON config files included in the project root dir as examples. The config file keys/values are:\n\n### Values in {}, the “Top Level” Config Values\n\n“game\\_install\\_dir”: Directory where 7 Days To Die is installed. Example value: “/Steam/steamapps/common/7 Days To Die”\n\n“game\\_saves\\_dir”: Directory where 7 Days To Die local save game files are installed. Example value: “/7DaysToDie/Saves”\n\n“use\\_save\\_game”:”” Advanced setting!. To parse the XML files in a save game folder instead of the game\\_install\\_dir Leave this empty unless you know how to use this. Example value: “” <- Do not use a save game for XML. Use installed game XML Example value: “Navezgane/”\n\n“game\\_version”:”a19.2-b4″ The version of the game, as seen on the top right hand corner when it runs Note: Put a dash “-” between the version and the build. The dash is not required, but this info is used to build the This is used to build the name of the toplevel mod folder and the dash makes it look nice. Example value: “a19.2-b4”\n\n“author”: This value get put into the ModInfo.xml file of the generated mod. Example value: “Doughphunghus”\n\n“modlet\\_name\\_prefix”: This is used to build the beginning of the name of the toplevel mod folder. Keep it as short as possible. A good practice is to put your name (or an abbreviation of it) as the first word. Note: Put a dash “-” between any words instead of spaces/underlines. This info is used to build the name of the mod and it makes it look nice. Example value: “Doughs-RandEnts”\n\n“modlet\\_name\\_tag”: This is used to build the end part of the the name of the toplevel mod folder. A good practice would be to make this very descriptive as to what the generation is for or contains. Note: Put a dash “-” between any words instead of spaces/underlines. This info is used to build the name of the mod and it makes it look nice. Example value: “vanilla-enemy-animals-only-600-clones”\n\n“log\\_level”: This controls the level of logging when the script runs, and can be useful for debugging. Allowed values: 0 = Minimal logging (only STDOUT/STDERR messages which are not caught) 1 = ERROR Messages only 2 = ERROR and INFO Messages 3 = ERROR and INFO and DEBUG Messages Example value: “2”\n\n“config\\_file\\_format”: Advanced setting!. Do not change unless you know how to use this. This is the config file format “version”. If the version of script you are running is older its possible it cannot parse a version of the config file you are using. This was put in place in case he make config file format breaking changes, and have older config files he try to use. If he does this, the script will refuse to process the file based on the version mismatch. Example value: “v1”\n\n“unique\\_entity\\_prefix” This is used to prefix the internal names of the cloned entity names in the XML Note: Keep it as short as possible. This is because a unique key is needed so all cloned entities are unique, but so you can also (should you change this) run different generated cloned modlets either by yourself or others (using the same script, different config files) side by side. Note: A good practice would be to put your name or an abbreviation of it in this. Note: This is part of the name you can see when using the F6 entity spawner in the games debug mode. This also makes your cloned entities searchable in that tool. Example value: “DoughsR”\n\n“ignore\\_entity\\_list”: This is a dictionary/hash of values but is supposed to contain any entities you do not want to clone, globally (no matter what Type/Class they are or inherit from). This can be empty or contain key/values. Use the value to document the reason the ehtity is being ignored. Use the internal XML class name of the entity! Example value: {} <- Do not ignore any entities Example value: { “animalDoe”:”I do not want any clones of this”, “animalZombieVulture”:”I do not want any clones of this” }\n\n“only\\_allow\\_these\\_entities\\_list”: This is a dictionary/hash of values but is supposed to contain any entities you ONLY want clones of. It is just like ignore\\_entity\\_list, but only the entities in the lise are cloned, everything else is ignored. This is good when you want a lot of clones of a specific zombie/animal, or have a special config file to randomize just this entity, seperate from others. Another use would be to randomize entities from mods (this may or may not work well!, and you have to use the use\\_save\\_game config setting to point the script to a saved, modded game to read the modded entities from. Example value: {} <- Do not ignore any entities Example value: { “animalDoe”:”I do not want any clones of this”, “animalZombieVulture”:”I do not want any clones of this” }\n\n“enable\\_localization”: The script can generate a Localization.txt file for the mod it generates from special files (not documented yet or supplied with this code, but you can find the names/locations in the script if you want to supply your own. The Localization files are just text files with a single word on each line. If the files are supplied, the script generates randomized names for each cloned entity by choosing random words from each localization file). If you do not have localization files, obviously set this to 0 Allowed values: 0 = Do not use Localization files/generate localization 1 = Do use Localization files/generate localization Example value:”1″\n\n“ConfigDefaults”: This section defines all of the “default master filters” used in the ConfigEntityEnemyAnimal,ConfigEntityFriendlyAnimal,ConfigEntityZombie sections below. { }\n\n“ConfigEntityEnemyAnimal”: This section defines all of the default “filters” for Enemy Animal Entities { }\n\n“ConfigEntityFriendlyAnimal”: This section defines all of the default “filters” for Friendly Animal Entities { }\n\n“ConfigEntityZombie”: This section defines all of the default “filters” for Zombie Entities { }\n\n### Values in “ConfigDefaults”\n\nTBD! This is a complicated section and requires some thought to document!\n\n#### Values in “ConfigEntityEnemyAnimal”, “ConfigEntityFriendlyAnimal”, and “ConfigEntityZombie”\n\nAll of these sections behave the same and can be configured using the same methods, so he will document only how to configure one of the sections. ConfigEntityZombie will be the example section used, so to do the others simply substitute the class/entity names of the appropriate entity/class instead of Zombies.\n\nTBD! This is a complicated section and requires some thought to document!\n\n## Changelog\n\n* **_(new)_** Cleaned up random name files a little.\n* Doughphunghus has generated pre-generated modlets for a19.3 b6 stable.\n* He has started doing diffs of the vanilla configs as updates are pushed (to see if he can tell which of his mods break without testing them all), and it looks like (his best guess, no guarantees!) the a19.2 b4 pre-generated modlets should work with a19.3 b6\\. So if you were playing a game in 19.2 b4 and didn’t want to update just because of these pre-generated modlets, it might be safe. Even if it was not, you could likely pull out the 19.2 b4 one and replace it with the a19.3 b6 one and all that would likely? happen is any spawned entities would cease to exist, and it would likely throw some console errors as the game tried to spawn them when you entered a chunk where they were spawned before the update. Just his guess, he has not tested this.\n* The important thing is only load one “set” of mods for a particular version, do not try to load them all across versions.\n\n**[Download](https://github.com/doughphunghus/7D2D-EntityRandomizer/archive/refs/heads/master.zip)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/17197-doughs-modlets/).\n\n**Credits:** [Doughphunghus](https://7daystodiemods.com/tag/doughphunghus/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/doughphunghus/7D2D-EntityRandomizer/archive/refs/heads/master.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/17197-doughs-modlets/",
  "modAuthors": [
    "Doughphunghus"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die zombies",
    "Doughphunghus"
  ]
}