{
  "modURL": "https://7daystodiemods.com/enzombies-more-zombie-variations/",
  "modCreatedTime": "2022-06-09T15:50:00+00:00",
  "modLastUpdatedTime": "2022-06-09T16:39:30+00:00",
  "modName": "enZombies - More Zombie Variations",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/12/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-1c.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/10/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-2c.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-3d.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-6g.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-7g.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-8e.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-10.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-14.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-9.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-15.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/07/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-4d.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-11a.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/08/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-5e.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-12.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-enzombies-more-zombie-variations-additional-screenshot-13.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-enzombies-more-zombie-variations-changelog-screenshot.jpg"
  ],
  "modShortDescription": "This mod has been updated for Alpha 20 and adds much more zombie variations to the game, using the UMA archetype method. Stronger and boss-level zombies.",
  "modDescription": "**ErrorNull Zombies (enZombies):** This mod has been updated for Alpha 20 and adds much more zombie variations to the game, using the UMA archetype method most notably showcased by the Snukfin’s Custom Server Side Zombies – PLUS mod maintained by arramus. All the UMA Zombies by khzmusik are also included in enZombies. The goal of this mod is to always be server-side, thus only needs to be installed on the server, and not on the individual clients. These zombies are meant to be your average walkers and crawlers to complement the existing vanilla ones… though stronger and boss-level zombies are slowly being added. Each enZombie also has their own feral and radiated variant.\n\nenZombies spawn out in the terrain based on the [biome](https://7daystodiemods.com/tag/7-days-to-die-biomes/), with each zombie group sporting a unique color theme that matches the biome. So you will find foresty zombies in the forest, deserty zombies in the desert, snowy zombies in the snow, and so forth. enZombies also spawn in many other scenarios, like in wandering hordes, screamer hordes, sleepers in POIs, and during the bloodmoon horde night. Unfortunately, there’s no easy way to spawn zombies in these other scenarios while also based on specific biomes, so a more random range of enZombies will be seen there.\n\nThe short challenge quests are an underutilized feature in the vanilla game, and enZombies appear within them as well. New challenge quests have also been added to showcase the new zombies. All new quests are simply found as items within the usual loot containers where vanilla [quests](https://7daystodiemods.com/tag/7-days-to-die-quests/) are found. Many more quests are planned.\n\n* Goblin Raid\n* Forest Goblin Raid\n* Desert Goblin Raid\n* Snow Goblin Raid\n* Red Goblin Raid\n* Wasteland Goblin Raid\n* Business Meeting Gone Wrong\n\n## Compatibility\n\nenZombies and the add-ons (see Add-ons section) are designed for Alpha 20\\. Using other mods with enZombie might work and might not. Even if an unsupported mod does work without errors, it will be missing the custom biome spawn behavior that enZombies use. If there is enough demand for a specific unsupported mod, ErrorNull can create a patch mod for it (see Patches section) so that it works with enZombies and recognizes the custom biome spawn groups. If you are getting errors or strange glitches while using unsupported mods with enZombies, feel free to report the errors and what other mods you are using, and he will be glad to take a glance when he get the chance.\n\n## Usage\n\nYou may use his mod as it is presented, or just pull his zombie definitions from archetypes.xml and entityclasses.xml and merge them into your own mod. Don’t forget to grab corresponding code from items.xml and buff.xml. If you are just pulling the zombie XML code, he’d appreciate if you credit him somewhere like on your website, discord or forum post. The more exposure enZombies can have, the more players use it, and the more motivation for him to continue development. He love making these custom [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) and hope to continue on for a long while, but it does take lots of time and effort.\n\n## Download and Install\n\nThis mod is not intended to be used with any other mods, except for the Add-Ons and for any mods that he has made Patches for. Refer to Add-Ons and Patches section further below.\n\n## Add-Ons\n\nThese are optional mods created for enZombies. The main enZombies mod must be installed in order for these Add-Ons to work.\n\n### enZombie Harvest Add-on\n\nThis mod adds the ability to harvest all enZombies for resources (eg. cloth, rotten flesh, bones) when they are defeated. Zombies that carry bags or backpacks can also be looted before harvesting their corpses. To counter-balance the added abundance of resources from zombie harvesting, this mod also slightly increases the resource requirements of any recipes that rely on them.\n\n### enZombie Settings Add-On\n\nA collection of small mods that allow adjusting certain zombie settings: No Nudes, Attack Range, Wilderness Spawn Amount, and Wandering Horde Spawn Amount. Download the add-on package and take the specific folder that matches the setting you wish to adjust and place it into your 7 Days to Die “Mods” folder.\n\n## Patches\n\nInstall these ‘patch’ mods to make enZombies compatible with the “target” mod. Download the package. Take the specific folder that matches the target mod you want and place it into your 7 Days to Die Mods folder. Don’t forget, you need to have the main enZombies mod installed as well as the main target mod you are using with enZombies. These mods do two things: It makes the target mod aware of the new custom spawning groups that enZombies uses. And, it allows the player to enable zombie body harvesting for the zombies that are part of the target mod.\n\n### Snufkin’s Server Side Zombies PLUS Patch\n\nThis patch mod allows [Snufkin’s Custom Server Side Zombies](https://7daystodiemods.com/snufkins-custom-server-side-zombies-plus/) to be compatible with enZombies. The main mod is maintained by Arramus and contains a great collection of unique UMA archetype zombies, as well as custom zombies based on the vanilla models. These zombies are boss-level and perfect for the later gamestages.\n\n### Robeloto’s Custom Zombie’s Patch\n\nThis patch mod allows [Robeloto’s Custom Zombies](https://7daystodiemods.com/robelotos-custom-zombies/) to be compatible with enZombies. The main mod is by Robeloto and contains a ton of excellent custom zombies which use creative texture swaps and weapon prefab attachments onto the base vanilla zombies. The zombies range from easy to very tough and from very small to super large. There’s something for everyone.\n\n### Zulk Zombie Patch\n\nThis patch mod allows the [Zulk Zombie](https://7daystodiemods.com/zulk/) mod to be compatible with enZombies. The Zulk zombie was created by BeBeLiouS and is a nice looking green giant with normal, feral, and radiated varieties, and works well with any game playthrough.\n\n## Known Issues\n\nThere are some interesting bugs when working with UMA zombies and molding them from the archetypes.xml. It’s not unique to enZombies and are present in any mod that uses UMA style zombies – for example, the Snufkin mod also contain some UMA zombies which will experience these bugs. In his opinion, the relative ease in creating and modifying these zombies outweigh the quirks:\n\n* UMA zombies fly amazing distances when struck with a powerful attack. Their physics seem to be more ‘floaty’ compared to the vanilla zombies. This also results in the occasional zombie getting stuck into nearby walls and bars when explosions and powerful attacks send them rag-dolling overhead. To some this is a bug, to others this is a feature.\n* UMA zombies do not collide with player vehicles whether driven or parked. So the zombies will simply walk right through them. This behavior does not occur with the abandoned POI vehicles that litter the landscape… UMA zombies interact with them like normal.\n* UMA zombies don’t get shocked when walking into electric fence traps… not really, at least. It seems that if they are knocked down while on the fence, they will occasionally get shocked! Stun batons behave normally and shock the zombies just fine.\n* UMA zombies appear to cause a ‘micro-freeze’ or stutter in the game each time a set number of them are spawned. This was not the case (or it was very insignificant) in Alpha 19\\. The number of zombies that trigger this stutter seem to range from 5 to 8\\. Thus, while exploring POIs and encountering sleeper zombies, or fighting through horde night, there will be a short stutter when every 5th to 8th UMA zombie is spawned in. The severity of the micro-freeze might depend on your system specs, but it’s not completely certain at this point.\n* There is a NullReferenceException error that can occur when sleepers are spawning inside POIs. Majority of the incidents are occurring during trader quest, and can sometimes even result in a sleeper zombie being spawned invisible – which can be a vanilla zombie and possibly UMA zombie. Unfortunately, this zombie cannot be killed and if part of a Clear quest will cause the quest to fail. This issue is still being investigated. Troubleshooting is challenging as this NRE error appears intermittent and not tied to a specific POI or specific UMA zombie. However, it only occurs when UMA zombies are spawning as sleepers. If you encounter this NRE error – please take a screenshot (or send him the log) and let him know which POI and if the error was repeatable later at the same POI. This will help with the research.\n\n## Wish List to The Fun Pimps\n\nHere he list enhancements to the 7 Days modding experience that he would love for the developers to add which will allow him to add more immersion to enZombies and the game as a whole.\n\n* Remove the gamestage maximum that’s part of the wandering horde. Currently it only goes up to gamestage 50 and then wraps around back to 1\\. This limits him from adding stronger zombies to the wandering horde in order to maintain sensible difficulty balance. If gamestage must wrap around, then increase max limit to something like 1500, 2000, etc.\n* Add gamestage progression for all wilderness biome zombie groups. Currently, these wilderness zombies do not scale at all with gamestage, and so this prevents him from adding increasingly challenging zombies to spawn in wilderness for each biome.\n* Add separate zombie hordes specific to each biome. This will allow hordes like wandering, screamer, POI sleepers, and bloodmoon to spawn zombies specific for each biome.\n* Add more specialized zombie entitygroups for POIs. Vanilla game already has groups like ZombieGhostTownGroup, HospitalGroup, ZombieNightClubGroup, ZombieFarmGroup, etc. Would love to see more entitygroups for POIs like schools, stores and shops, police stations, residential homes, etc. Of course he can see how this will be low priority for the devs given their small pool of vanilla zombies to fill up these POI roles. At this time, it is the zombie modders who would benefit, and of course the players.\n\n## Credits\n\nThanks to Snufkin for starting it all with his Snukfin’s Server Side Z(S)ombies mod, and thanks to Arramus for keeping it going with the Snufkin’s Custom Server Side Zombies – PLUS mod. ErrorNull studied these mods for weeks to figure out how it worked and gave him inspiration to contribute as well. Also thanks to Khzmusik who gave ErrorNull permission to add his UMA Zombies into enZombies. Much appreciated!\n\n## Screenshots\n\n## Mentioned Mods\n\n* [Snufkin’s Custom Server Side Zombies – PLUS](https://7daystodiemods.com/snufkins-custom-server-side-zombies-plus/)\n* [Robeloto’s Custom Zombies](https://7daystodiemods.com/robelotos-custom-zombies/)\n* [Khzmusik’s UMA Zombies](https://7daystodiemods.com/uma-zombies/)\n* [Zulk Zombie](https://7daystodiemods.com/zulk/)\n\n## Changelog\n\n**Version 2.7**\n\n* Removed ability for any zombies that wear hats/helmets, holding items/weapons, or are giants, from becoming crawlers\n* Removed all custom zombie crawlers to simplify code. Existing zombies (that are not mentioned above) can still be crawlers if they are crippled.\n* Added elemental zombies: enElementalOrganicCrawler, enElementalSandCrawler, enElementalStoneCrawler, enElementalIronCrawler, enElementalSandWalker, enElementalStoneWalker, enElementalIronWalker, enElementalRadiatedWalker\n* Added custom characteristics to elemental zombies: nerfed ranged weapons against them, bonus to mining tools against them, they do not bleed, they have increased entity and block damage\n* Redid wandering horde code to use vanilla groups and progression. Should make more mods (like UL) no need for patch\n* Renamed enSnufkinBoss to enScientistBoss1\n* Added feral versions of khzAiden and khzChang\n* Added hospital zombies: patientFemale1, patientFemale2, and patientFemale3, patientMale1 and patientMale2, labFemale1, nurseHD\n* Added more existing zombies: biker3 and biker4, lumberjack3 and lumberjack4\n* Renamed and streamlined all enemy handitems\n* Added louder swoosh sounds to the larger weapons carried by zombies: clubs, shovels, pickaxes, stun baton, etc\n* Updated all entitygroups/spawning code to be more compatible with mods that rely on vanilla zombie groups\n* Removed game animals from spawning in wasteland (since it was removed from vanilla game)\n* Added loadingscreen tips specific to enZombies\n* Added settings mod enZombiesSettings09RemoveZombies\n\nThe following mods have also been updated for use with enZombies v2.7\\. So if you are using these add-on mods, please download the latest one. The readme file within each add-on mod will show what changes have been made.\n\n* enZombieHarvest\n* enZombiesSettings01NoNudes\n* enZombiesSettings03WildernessSpawn\n* enZombiesSettings04WanderingSpawn\n* RobelotoZombiePatch\n* SnufkinZombiePatch\n* ZulkZombiePatch\n\nFor the next update ErrorNull will spend more time on compatibility with other zombie mods ([NPCMod](https://7daystodiemods.com/npcmod-a-community-project/) and [Darkness Falls](https://7daystodiemods.com/darkness-falls-mod/)), and ability to modify attack reach of any enZombie, and modify HP and XP of any enZombie, etc. Of course he will throw in a couple more new zombies too… he still want to add some shopkeeper zombies, normal cops, and more zombies that fly and attack with projectiles…\n\n**Updated the Attack Range Settings Mod**\n\nAdded ability to modify the newest lumberjacks, bikers, and hospital zombies.\n\n**How to Use**\n\nDrop this mod into your Mods folder (just like any other mod) to activate it.\n\n* Go into the **items.xml** file and find the line representing the zombie you want to modify\n* Modify the range Value … increase value to give zombie further reach, or decrease value to shorten zombie’s reach\n* Exit and re-run the game.\n\nThis mod only allows modifying the attack range of enZombies and not any vanilla zombies.\n\n**[Download](https://github.com/ErrorNull0/enZombies/archive/refs/heads/main.zip)** enZombies  \n**[Download](https://github.com/ErrorNull0/enZombiesHarvest/archive/refs/heads/main.zip)** enZombie Harvest Add-on  \n**[Download](https://github.com/ErrorNull0/enZombiesSettings/archive/refs/heads/main.zip)** enZombie Settings Add-on  \n**[Download](https://github.com/ErrorNull0/enZombiesPatches/archive/refs/heads/main.zip)** Patches\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/24594-enzombies-a-spawn-of-snufkins-server-side-zombies/).\n\n**Credits:** ErrorNull, Snufkin, Arramus, Khzmusik",
  "modDownloadURLs": [
    {
      "Info": "enZombies",
      "URL": "https://github.com/ErrorNull0/enZombies/archive/refs/heads/main.zip",
      "Version": "v19"
    },
    {
      "Info": "enZombie Harvest Add-on",
      "URL": "https://github.com/ErrorNull0/enZombiesHarvest/archive/refs/heads/main.zip",
      "Version": "v19"
    },
    {
      "Info": "enZombie Settings Add-on",
      "URL": "https://github.com/ErrorNull0/enZombiesSettings/archive/refs/heads/main.zip",
      "Version": "v19"
    },
    {
      "Info": "Patches",
      "URL": "https://github.com/ErrorNull0/enZombiesPatches/archive/refs/heads/main.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/24594-enzombies-a-spawn-of-snufkins-server-side-zombies/",
  "modAuthors": [
    "ErrorNull",
    "Snufkin",
    "Arramus",
    "Khzmusik"
  ],
  "modTags": [
    "7 days to die biomes",
    "7 days to die quests",
    "7 days to die zombies"
  ]
}