{
  "modURL": "https://7daystodiemods.com/food-spoilage/",
  "modCreatedTime": "2021-09-23T05:43:00+00:00",
  "modLastUpdatedTime": "2021-09-23T05:48:01+00:00",
  "modName": "Food Spoilage",
  "modImages": [],
  "modShortDescription": "Introduces food spoilage to the game. Most foods that are not canned or otherwise preserved can now spoil. Battery-powered refrigerators can be crafted.",
  "modDescription": "Introduces food spoilage to the game.\n\n## Features\n\n* Most foods that are not canned or otherwise preserved can now spoil.\n* Prepared drinks (such as teas) can now spoil.\n* Battery-powered refrigerators can be crafted. Recipes can be learned through schematics, or by purchasing the Advanced Engineering perk.\n\n## Dependent and Compatible Mods\n\nThis mod is prefixed with a number, in order to load it after all dependent mods.\n\nThis mod is dependent upon the [0-SphereIICore](https://7daystodiemods.com/dmt-mods-by-sphereii/) mod. It was designed and tested to be used with version 19.3.1.14 of that mod.\n\nThis mod might not work with different versions of 0-SphereIICore. Use other versions at your own risk.\n\n## Technical Details\n\nThis mod uses XPath to modify XML files, and does not require SDX or DMT.\n\nHowever, the 0-SphereIICore mod does require [DMT](https://community.7daystodie.com/topic/13037-dmt-modding-tool/). It is not compatible with EAC.\n\nAfter installation, it is highly recommended to start a new game.\n\n### How Food Spoilage Works\n\nThis mod depends upon the food spoilage code provided by the [0-SphereIICore](https://7daystodiemods.com/dmt-mods-by-sphereii/) mod. That mod has custom C# code that is configurable via XML. It is loosely based on item degradation from the vanilla game.\n\nFood spoilage is calculated when the player opens a container with one or more stacks of consumable items in it. The term SpereII uses for this calculation is loss calculation.\n\nA loss calculation can only happen after a certain number of game ticks since the last time the loss was calculated. This number of ticks is called ticks per loss. The ticks per loss is configurable in XML, and can be set individually per consumable item.\n\nThe loss caluclation can happen multiple times at once, if the ticks per loss would have been reached multiple times since the container was last opened. For example, if ticks per loss is 100, and it has been 1000 ticks since the user last opened the container, then the loss calculation will happen 10 times when the user opens that container.\n\nEach time the loss calculation occurs, it uses a number of different values to determine the amount of [food](https://7daystodiemods.com/tag/7-days-to-die-food/) spoilage:\n\n* The spoilage amount starts as an amount specified for that consumable item in the item’s XML. This amount is called spoilage per tick (though it should probably be called “spoilage per loss” or “spoilage per calculation”).\n* The stack of consumable items is always located in some container, and that container adds a number to the spoilage amount. The container can be the player’s backpack, the player’s toolbar, or a loot container. All three of these locations have their values set globally in XML.\n* If the item stack is located in a loot container, that container can offset the global amount of spoilage that is added for all loot containers. This is called the preserve bonus of the container. The preserve bonus is subtracted from the spoilage amount.\n\nOnce that amount is calculated, it is compared against the total amount of spoilage that can occur before one consumable item spoils. That total amount of spoilage is called the maximum spoilage.\n\nThis process happens until the calculated spoilage amount is less than the maximum spoilage:\n\n* One consumable item is removed from the item stack.\n* A spoiled item, representing a spoiled version of the original item, is created. The spoiled item can be specified in the XML for each consumable item, or defaults to rotten meat. If this is set to the consumable item itself, then the consumable item spoils into nothing.\n* The spoiled item is placed in the player’s backpack, creating a new stack if necessary. (It goes into the player’s backpack regardless of which container held the original item.) If there is no room in the player’s backpack, the spoiled item is dropped on the ground.\n* The maximum spoilage is subtracted from the calculated spoilage amount.\n\nHere are the details about configuring all this in the XML files.\n\n#### Feature Configuration Block XML\n\nSphereII created a block in _blocks.xml_ that is designed to hold feature configuration data for the entire Core mod. Each property node in that block is devoted to one feature, and that node has child property nodes that hold the configuration data.\n\nThe property node that deals with food spoilage has the “FoodSpoilage” class. These are the names of child property nodes and the features they configure:\n\n* “Logging”: Enables or disables verbose logging.\n* “FoodSpoilage”: Enables or disables food spoilage in the game.\n* “Toolbelt”: The amount of spoilage to add, per loss calculation, when consumable item stacks are located in the player’s toolbelt.\n* “Backpack”: The amount of spoilage to add, per loss calculation, when consumable item stacks are located in the player’s backpack.\n* “Container”: The amount of spoilage to add, per loss calculation, when consumable item stacks are located in loot containers.\n* “MinimumSpoilage”: The absolute minimum spoilage per loss calculation.\n* “TickPerLoss”: The default ticks per loss.\n* “SpoiledItem”: The default item that consumable items turn into when they spoil.\n\n#### Consumable Item XML\n\nThese can be added as new properties to each item in _items.xml_ that is consumable.\n\n* “Spoilable”: Enables or disables food spoilage on this item. **Note:** Setting the value to “false” does not work. If a consumable item is not spoilable, remove this property entirely.\n* “ShowQuality”: Whether to only show the quality bar underneath the item.\n* “QualityTierColor”: The tier number for the color of the quality bar underneath the item. This can be an integer from 0 through 7.\n* “SpoiledItem”: The item that this consumable item turns into when it spoils.\n* “TickPerLoss”: The ticks per loss for this consumable item.\n* “SpoilageMax”: The maximum spoilage before one consumable item spoils.\n* “SpoilagePerTick”: The spoilage “per tick” (actually, per loss).\n\n#### Container Block XML\n\nThis can be added as a new property to each container in _blocks.xml_, as desired.\n\n“PreserveBonus”: The preservation bonus, per loss calculation, for this container.\n\n### Hints for Customizing\n\nKhzmusik recommend that you keep _SpoilageMax_ and _SpoilagePerTick_ at their default values of 1000 and 1, respectively. This makes the math easier.\n\nIf _SpoilageMax_ is 1000 and _SpoilagePerTick_ is 1, then _TickPerLoss_ should be the number of in-game days that it takes for one item to spoil in ideal conditions, multiplied by 24\\. (The math works out because there are 1000 ticks per in-game hour.)\n\nIf we want N items to spoil in those in-game days, set _SpoilagePerTick_ to _N_ (but don’t adjust _TickPerLoss_).\n\nThere will be an extra number of items spoiled according to the stack location, and the container block’s _PreserveBonus_ value (if any). For instance, if the stack is in a “Container” (set to 4 in the config block), and the container block has a _PreserveBonus_ of 1, an extra 3 items will spoil in that number of in-game days. (The spoilage will not occur until the next loss tick, as determined by _TickPerLoss_.)\n\nThis actually makes some fairly complicated things possible. For example, let’s say that you don’t want corn bread to be affected very much by the container it’s in. But you still want as many items to spoil as any other food – say, 3 times per week.\n\nIn this case, you can use a longer number of in-game days to represent the time it takes for one piece of cornbread to spoil – say, 4 weeks. To make up for it, you set the _SpoilagePerTick_ to 12, so it still averages out to 3 per week.\n\nEven if an extra 4 pieces of cornbread spoil because it’s in a container with no _PreserveBonus_ value, those 4 pieces are spread out over 4 weeks, so they’re much less noticable to players.\n\nOn the other hand, if you want meat stew to be very affected by the container it’s in, use a short number of in-game days – say, 3 – and set _SpoilagePerTick_ to 1\\. If it’s in a container with no _PreserveBonus_ value, an extra 4 bowls of stew will spoil during those 3 days. But if it’s in a container with a _PreserveBonus_ value of 2, only 2 extra bowls of stew will spoil during those same three in-game days.\n\n### Possible Improvements\n\nThese are some ideas about possible features that might improve the mod. He has not looked into whether they are possible/practical to implement.\n\n#### Unpowered Food Preservation Blocks\n\nThese would not require power.\n\nThe ones that are just specially-built containers (e.g. the pie safe) would have a very low _PreserveBonus_ and the ones that work by convection (e.g. clay pot cooler) would have a medium-low _PreserveBonus_.\n\nThe ones that work by convection would ideally require replenishing with a resource (e.g. water or snowballs), but he doesn’t yet know how to do that, or if it’s possible.\n\n* [Clay pot cooler](https://en.wikipedia.org/wiki/Pot-in-pot_refrigerator)\n* [Coolgardie safe](https://en.wikipedia.org/wiki/Coolgardie_safe)\n* [Pie safe](https://en.wikipedia.org/wiki/Pie_safe) or [California cooler](https://en.wikipedia.org/wiki/California_cooler_(cabinet))\n* [Icebox](https://en.wikipedia.org/wiki/Icebox)\n\n#### Powered Container Improvements\n\nInstead of being perpetually self-powered with a battery, the powered containers (fridges) should use the 7D2D power system. He doesn’t yet know how/if this could be implemented.\n\nOther types of containers could also be created:\n\n* Powered beer cooler/mini-fridge\n* Powered freezer – _PreserveBonus_ would be greater than “Container” spoilage.  \n   * If implemented, set minimum spoilage to zero (though 0.1 is hard coded in SphereII Core).\n\n## Changelog\n\nCoffee now spoils, as does beer; added IPA that doesn’t (must be crafted)\n\n**[Download](https://gitlab.com/karlgiesing/7d2d-a19-modlets/-/archive/master/7d2d-a19-modlets-master.zip?path=1-SphereIICore_khzmusik_Food_Spoilage)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/24348-a19-khzmusiks-modlets/).\n\n**Credits:** [Khzmusik](https://7daystodiemods.com/tag/khzmusik/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/karlgiesing/7d2d-a19-modlets/-/archive/master/7d2d-a19-modlets-master.zip?path=1-SphereIICore_khzmusik_Food_Spoilage",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/24348-a19-khzmusiks-modlets/",
  "modAuthors": [
    "Khzmusik"
  ],
  "modTags": [
    "7 days to die food",
    "Khzmusik"
  ]
}