{
  "modURL": "https://7daystodiemods.com/halmod-expansion/",
  "modCreatedTime": "2022-06-07T16:23:00+00:00",
  "modLastUpdatedTime": "2022-06-07T16:24:00+00:00",
  "modName": "Halmod Expansion v1.00",
  "modImages": [],
  "modShortDescription": "The goal of Halmod Expansion is to overhaul the base game only through XML edits to promote co-op play with friends and strangers.",
  "modDescription": "Halmod Expansion is a 7 Days to Die modlet\\* inspired by Valmar’s Valmod Expansion. The goal of Halmod Expansion is to overhaul the base game only through XML edits to promote co-op play with friends and strangers. As such, the mod will always stay as a server-side mod, and only the host or host server will need to download/install the mod.\n\nAvailable in English, Chinese (汉语), and Japanese (日本語)!\n\n## Features\n\nHalmod Expansion adds a class system that is organic and true to the game. This system was developed with an emphasis on vanilla assets, mainly skill books and a carefully curated list of items that is befitting of its respective class. Classes that were on the low end of the power spectrum were buffed with custom equipment and mod that I felt were much needed to bring all the classes to the same level. Each playthrough of the game will never feel the same way again!\n\nBecause the players are equipped with weapons right from the start, I’ve moved my focus to making the game more challenging through encounters. I’ve accomplished this through changing how zombies and animals will spawn into the game and where they will spawn. As a result, I’ve split and divided all encounters based on [biome](https://7daystodiemods.com/tag/7-days-to-die-biomes/), town, commercial/industrial, or downtown. Biomes from lowest to highest difficulty: Forest < Desert < Snow < Wasteland. Different zombies and/or animals will spawn in each of these encounter zones. The number of naturally spawning zombies have been increased related its encounter zone. For example, there will be more zombies in the downtown area compared to the town area, and there will be even more zombies in downtown Wasteland than downtown Forest.\n\nA new type of zombies have been added into the game. These are ‘Ravenous’ zombies. Ravenous zombies are essentially weaker feral [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/). They inhabit cities and can be found wandering the world in very large numbers. Be careful while you’re out gathering or looting. You may never know when a horde may show up. The deadly encounters make blood moon horde trivial. In my honest opinion, blood moon horde should be turned off or only occur in the Wasteland and on the 7th day of each month.\n\nStamina has been drastically changed to favor a play style that is more in line with that I’ve envisioned. Your character will no longer burst to the brim with stamina regeneration. Instead, stamina will need to be managed more carefully. Due to the change, stamina regen has been reduced but max stamina has been increased. It is now more vital than ever to decide if you want to commit to an action before exerting your stamina. You may never know what’s behind the next corner!\n\nChanges have been made to animals and harvesting. Animal carcasses now take longer to harvest. Timid animals have also seen a big boost to their health. And when it comes to harvesting, the bone knife and [axes](https://7daystodiemods.com/tag/7-days-to-die-tools/) have been nerfed, except for Taza’s Stoneaxe which has been buffed in terms of harvesting.\n\nCertain foods and drinks now have a chance to give the player dysentery.\n\n### Classes\n\n* Brawler (Fortitude-Melee-Fighter-Runner)\n* Enforcer (Agility-Range-Shooter-Trader)\n* Firefighter (Strength-Melee-Fighter/Gatherer)\n* Gunner (Fortitude-Range-Shooter)\n* Gunslinger (Agility-Range-Shooter/Runner)\n* Hunter (Perception-Range-Shooter/Gatherer/Runner)\n* Infiltrator (Agility-Range-Shooter-Stealth)\n* Liberator (Strength-Range-Bruiser)\n* Looter (Any)\n* Miner (Strength-Melee-Gatherer)\n* Night Stalker (Agility-Melee/Range-Stealth)\n* Ranger (Agility-Range)\n* Scavenger (Any-Range-Gatherer)\n* Sniper (Perception-Range)\n* Tech Junkie (Intelligence-Melee/Range)\n* Thief (Agility-Melee/Range-Stealth)\n* Tribal Warrior (Perception-Melee/Range-Runner)\n* ZU Batter (Strength-Melee-Bruiser-Runner)\n\nEach class has their own strengths and weaknesses.\n\n* Melee – specializes in melee combat.\n* Range – specializes in range combat.\n* Fighter – uses stamina to fight.\n* Runner – uses less [stamina](https://7daystodiemods.com/tag/7-days-to-die-stamina/) while running and/or run faster.\n* Shooter – attacks primarily consume bullets instead of stamina.\n* Stealth – specializes in stealth combat.\n* Gatherer – specializes in resource gathering.\n* Bruiser – specializes in close-combat and can take a beating.\n\n### Deadly Encounters\n\nCities are now infested with ravenous zombies that will surely claw our your brain and guts. Be vigilant and don’t venture out into the city too soon. When you’re fully prepared, bring a trusted friend along with you to watch your back. If you’re alone, I suggest clearing out small towns first before stepping foot into the city.\n\n#### Forest Cities\n\nHome to ravenous zombies\n\n#### Desert Cities\n\nVulture hordes have made their nest in these cities\n\n#### Snow Cities\n\nWhite walkers (wights), [spider](https://7daystodiemods.com/tag/7-days-to-die-animals/) zombies, and crawlers have made their way into the outskirts of these cities.\n\n#### Wasteland Cities\n\nYou’ll only find radiated zombies here and the occasional mutated and burnt zombies\n\n#### Rare Animal Bosses\n\n* Forest – Grace (Mutated Boar)\n* Desert – Radiated Matriarch (Mother of zombie vultures)\n* Snow – Zombie Bear (Zombified bear)\n* Wasteland – Grace, Radiated Matriarch, Zombie Bear\n\n### Hunger\n\nAnimal carcasses take longer to butcher. Canned [food](https://7daystodiemods.com/tag/7-days-to-die-food/) and boiled water now has a chance to give the player dysentery. Players not skilled into harvesting animals will find it more difficult to get meats for their recipes.\n\n**[Download](https://www.dropbox.com/s/6k7kp7hivyhks1a/Halmod%20Expansion-2269-1-00-1654571999.zip?dl=1)**\n\n**Credits:** halcSan",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://www.dropbox.com/s/6k7kp7hivyhks1a/Halmod%20Expansion-2269-1-00-1654571999.zip?dl=1",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modAuthors": [
    "halcSan"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die biomes",
    "7 days to die drinks",
    "7 days to die food",
    "7 days to die stamina",
    "7 days to die starting items",
    "7 days to die tools",
    "7 days to die zombies"
  ]
}