{
  "modURL": "https://7daystodiemods.com/home-depot-mod/",
  "modCreatedTime": "2020-02-23T20:59:10+00:00",
  "modLastUpdatedTime": "2020-06-04T15:38:15+00:00",
  "modName": "Home Depot Mod",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/02/screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/02/screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/02/screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/02/screenshot-4.jpg"
  ],
  "modShortDescription": "Welcome to Home Depot. This 7 Days to Die mod adds many decorative items already in the game to either your crafting lists, or to the Traders items.",
  "modDescription": "Welcome to Home Depot where, if you can’t buy it, we can help you build it. This mod adds many (most) decorative items already in the game to either your crafting lists, or to the Traders items (at least as a rare Hidden Stash). It also fixes a couple established recipes and Perk walls (and, yes, ‘Fixes’ is a subjective term). But OrbitalBliss did try to leave most things the way the Devs made them. One of the main purposes of this Mod is to give players meaningful access to assets in the game that otherwise are trapped in Creative Mode. This 7 Days to Die mod is item-centric and kept completely within the Configs (aka; It’s a Modlet) so you can drop it on your server and it will deliver to everyone, no fuss no muss. Your players don’t have to do anything. And, yes, a few of the things this mod does have been done several times before… but like Home Depot, the Home Depot mod is meant to be one-stop shopping. Besides, he kinda wanted to write his own version of those things from the ground up anyhow as he taught himself how to mod. He hope this fills out your players gaming experiences. Have fun!\n\n## Added Trader Items\n\nIn this section they have added many (if not most) items that exist in game already, but cannot be acquired. These are added to the [Traders](https://7daystodiemods.com/tag/7-days-to-die-trader/) decorations lists, with Economic Values and Repair Materials added for those items missing them. Also, slightly boosted the number of Decorative items Traders carry.\n\n**Here’s a list:** WallOven, UtilitySink, HungSink, MicrowaveOven, RetroFridge, FridgeStainlessSteel, StoveOld, WashingMachine, TrashCompactor, Mirror, ShowerHead, BathTubEmpty, Toilet01, Toilet02, Toilet03, MedicineCabinet A, MedicineCabinet B, PillCase, Radiator, SchoolDesk, ShoppingBasket, LeatherCouchSofa, BarracksChair, Paintings (x6), CharcoalGrillClosed, CharcoalGrillOpen, GasGrillClosed, GasGrillOpen, BirdBathPlanter, Gurney, HospitalBed, FileCabinetShort, FileCabinetTall, LockersTall A, LockersTall B, LockersTall C, HeatVent, HeatVentIndustrial, LaundryBasket, FancyGarbageCan, Dumpster, WaterCoolerBottle, CoolerOpen, SatelliteDish, SatelliteDishSmall, MetalSlide, SwingSet, StationaryBike, Treadmill, WeightBar, BenchPress, Duffle01, WeaponsBagSmall, WeaponsBagLarge, Purse01, Suitcase, LuggageMedium, LuggageBig, Backpack01, Backpack03, AirConditionVentFan, ConditionVentFanDouble, SignRoadStop, SignRoadStop4way, SignRoadSlow, SignRoadPrivate, SignRoadWork, CommercialBlindsTop, CommercialBlindsBottom.\n\n## Added Recipes\n\nIn this section we added recipes for the handyman. A number of reasonably simple items (coffee table) and several related items (most of the cabinets) were added a recipes, many of them requiring Tablesaw and some of them requiring Perk levels.\n\n**Here’s a list:** CommercialDoor1, CommercialDoor2, CommercialDoor4, HouseFrontDoor1, HouseFrontDoor2, DoorFrameWhite1, DoorFrameWhite2, DoorFrameMetal1, DoorFrameMetal2, CupboardsRed(x1), CabinetsRed(x1), CupboardsOld(x3),CabinetsOld(x3), WindowTrim(x5), DoorTrim(x2), WoodCrown(x2), DecorativePillar(x2), StoreShelving (x3), PewSegment(x3), GarageDoorHouse, Window02, Shutters1Plate, HardenedChestSecure, BookcaseEmpty, CoffeeTable, tableDynamic, WoodCatwalkWedge, MetalPillarTable, Coffin, RoadRailing(x4), ChainLink(x8), CorrugatedMetalPillars(x6), ConcreteBarrier.\n\n## Fixes for Recipes and Perks (of course ‘fix’ is subjective)\n\nWe tried to keep this to a minimum, but here we tweaked some existing recipes to (in our opinion) make better sense.\n\nExisting recipes that should have required tablesaw: cntCabinetBottom, cntCupboardCabinetRedTopClosed\n\nInclude Snowberry Seeds Recipe (Locked behind LivingOffTheLand 3), and fixed planted snowberries to grow up into Player harvested Snowberries.\n\nInclude BloodDrawKit Recipe (Locked behind Physician 3)\n\nRequire GreaseMonkey Perk to craft vehicles (not just for vehicles parts) Each vehicle tied to its appropriate GreaseMonkey [Perk](https://7daystodiemods.com/tag/7-days-to-die-perks/) level.\n\nInclude Vehicles in Trader Hidden Stash (Starting at Barter 3).\n\n## Fix Some Strange Upgrades, Repairs & Economic Values\n\nA few items already in the game had either screwy economic values, or repair settings. And a few even have goofy upgrades. He think most of these were simply overlooked. They fixed those.\n\nHere’s a list: cntWaterCoolerFull, cntBookcaseFull, cntBookcaseEmpty, decoPicnicTable, cntMunitionsBox\n\nAdded a few more sources for Brass: Destroyed doors with Brass handles give a doorknob, Blass Lamp can be harvested.\n\n## Add New Items & Included Recipes\n\nIn this section they added new items/blocks, which are mostly variations of existing ones, and usually add some functionality to the Player built version. Also, usually, the Player version is locked behind an appropriate Perk wall, and requires the Trader (non-functioning) version to craft. Most things in this section can be easily found by typing ‘Home’ into your crafting search bar.\n\nCraftable Beds that can relocate. The bedroll was not the only respawn point, but was the only one allowed to be picked up. This adds player versions of the Mattress, Small Bed, and Large Bed that can also be picked up. Players still can’t have more than one respawn, just allows them to use the other ‘sleeping bags’ the same way if they so choose. Mostly this allows you to redecorate your home without having to destroy and rebuild your beds.\n\nCraftable Ovens that function as Campfires. This adds a couple of ovens, microwave, and some BBQ Grills to craft and function just like Campfires. In the future he hope to tie the Electric oven and Microwave to the Electrical grid (can’t find a way so far).\n\nCraftable Sinks and Fountains that function as Murky Water Sources. This adds some working plumbing. It also adds a much more difficult crafting item in the ‘Home Filtered Water Cooler’ which requires Purifiers in its recipe and higher Perk levels, but can provide Clean Water.\n\nCraftable [Light](https://7daystodiemods.com/tag/7-days-to-die-lights/) Sources. There’s all kinds of lighting in this game… but they gave us a single fixture to work with. This has been fixed, adding almost every electrical light source back into the game. In the future he would like to fix illumination levels, but this is impossible at the moment.\n\nHere’s a list: ceilingLight01, ceilingLight02, ceilingLight02Brass, ceilingLight04, ceilingLight05, ceilingLight05Brass, ceilingLight07, ceilingFanLight, wallLight01, sconce1Light, porchLight01, porchLight04, porchLight04Brass, deskLampLight, tableLampLight, endTableLamp, streetLight01, streetLightClassic, industrialLight01, industrialLight02, industrialLight02Red, signShopOpen, signExitLight, workLightPOI.\n\n## Add Wireless Electrical Relays & Switches\n\nIn this section we added Wireless (or rather Hidden wires) [electrical](https://7daystodiemods.com/tag/7-days-to-die-electricity/) options. A ‘Home Wireless Relay Block’ that can be built into structures (and painted if you wish), a ‘Home Wireless Switch Fusebox’ and ‘Home Wireless Switch Electrical Box’ which add those models back in and use them for wireless electrical Switches, and a ‘Home Electrical Pole Top Relay’ for power poles. Some of this is not perfect, and he would like to move where the Power Lines come “IN” to some of these, but that looks like it’s hard baked into the models. Also we matched the power usage, of the few things that cost zero watts, to the 1W cost of normal relays.\n\n## The Paint Department\n\nIn this section we’ve restored access to a couple of textures that were included with the paint brush but hidden (Orange Drywall & Tar Paper). Also, found a few more textures that work decently enough on blocks and included them (Bookcase, Vent, WashingMachine, & Wet Concrete.\n\n## How to Install\n\n* Simply download the Home\\_Depot\\_v1.0.zip file (or whatever the current release is).\n* Decompress this directly into your 7 Days to Die install directory.\n* If you didn’t have a “Mods” folder, this will create one.\n* You should be ready to go.\n\nPlease Always backup your save folder if you are adding mods to pre-existing games.\n\n**[Download](https://github.com/OrbitalBliss/HOME_DEPOT_7D2D_MOD)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/12874-home-depot-mod/).\n\n**Credits:** OrbitalBliss  \n_Special Thanks:_ XelaNull",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/OrbitalBliss/HOME_DEPOT_7D2D_MOD",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/12874-home-depot-mod/",
  "modAuthors": [
    "OrbitalBlissSpecial Thanks: XelaNull"
  ],
  "modTags": [
    "7 days to die building materials",
    "7 days to die electricity",
    "7 days to die lights",
    "7 days to die perks",
    "7 days to die prefab",
    "7 days to die recipes",
    "7 days to die trader"
  ]
}