{
  "modURL": "https://7daystodiemods.com/improved-hordes/",
  "modCreatedTime": "2022-06-03T14:23:00+00:00",
  "modLastUpdatedTime": "2022-06-03T14:25:34+00:00",
  "modName": "Improved Hordes",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2022/01/7-days-to-die-improved-hordes-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/01/7-days-to-die-improved-hordes-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/01/7-days-to-die-improved-hordes-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/01/7-days-to-die-improved-hordes-additional-screenshot-4.jpg"
  ],
  "modShortDescription": "Horde alert, Survivor! Customizable hordes that scale with gamestage progression to always keep the game feeling difficult.",
  "modDescription": "Horde alert, Survivor!\n\nThe hordes we’ve been getting recently seem to be… different. The old scouts seem to have returned alongside the screamer, and the wandering hordes have been acting smarter-than-usual. The [animals](https://7daystodiemods.com/tag/7-days-to-die-animals/) seem to have also been affected… what’s going on?\n\n## Backstory\n\nThis mod was initially an idea FilUnderscore came up with after playing A19, and reflecting on the past alphas where he felt wandering hordes used to be more dangerous and unpredictable. He wanted to bring this back and focus on improving both wandering hordes and scout hordes, to bring more difficulty (and customization) into the game, as he felt the only real threat was the blood moon.\n\n## Features\n\n### Improved Hordes\n\n* Customizable hordes that scale with gamestage progression to always keep the game feeling difficult. (Note: Balancing is still WIP.)\n* Combines a new heatmap system with the vanilla heatmap system for smarter difficulty scaling, taking biomes into account.\n* Additionally, hordes can also be grouped into larger hordes to allow for variations in enemies.\n\n### Better Wandering Hordes\n\n* Wandering hordes work off a schedule generated at the end of every blood moon (except for Day 1/whatever day you are on when the mod is first initialized). This schedule also determines what hordes are feral and which aren’t.  \n   * Feral hordes can sense your location and wander closer to increase the chances of encountering you especially near buildings. Non-feral hordes wander by in more distant proximity and are not as harmful, meaning you might not even notice them sometimes.\n\n### Refreshed Scout Hordes\n\n* Scouts have gotten a refresh, namely the addition of feral scout hordes.  \n   * The likelihood of a scout horde being feral increases as you hang around in an area.  \n   * As scouts scream, they contribute more heat to nearby areas which attracts harder hordes in these areas, thereby increasing the likelihood of a feral scout spawning.  \n   * Feral scouts are much more aggressive and will stick around 2x longer than a regular scout. They have a tendency for attracting more [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) than expected.  \n         * The benefit of this however is that scouts will now walk away given enough time and no disturbances in the environment are sensed (that means don’t use your forges/cement mixers/campfires/augers for a while.) If disturbances are sensed, the scouts will stick around for longer, be warned.  \n   * On a final note, the original spider zombie scout trio have returned in their original, feral, and radiated variants now.\n\n### New Patrol Hordes\n\nUtilising the new heatmap system, hordes begin to roam frequently visited areas on a determined frequency depending on the amount of heat generated in an area and biome difficulty. Avoiding detection lowers the heat in surrounding areas.\n\n### Horde AI\n\n* Changed some base entity behaviors to allow animals in particular to behave alongside zombie hordes.\n* Smarter AI which allows hordes to make use of the game’s sensing systems to detect players through sound and sight, making stealth a much more important area of play.\n* Horde Entities rely on command lists to find out what to do next, this behavior is most noticeable with scouts as they can change what they are doing at any moment if they sense a change in the environment around them.\n\n## Add-ons\n\n**Note:** These are optional. The ImprovedHordes mod must be installed for the add-ons to work. Installation for these add-ons is the same as for the ImprovedHordes mod, the folders prefixed with “IH-” go into your 7 Days to Die “Mods” folder.\n\n### Bigger Hordes Add-on\n\nIncreases the maximum size of hordes when spawned.\n\n### Random Hordes Add-on\n\nRemoves gamestage dependent spawn count increases and instead lets the zombie hordes occur at random sizes. You could get big or small hordes, totally random.\n\n### Reduced Screamer Scout Spawns Add-on\n\nHalves the chance that a screamer will spawn. To further modify the chance, you can modify the XML file included in the “IH-ReducedScreamerScoutSpawnsAddon” folder in your Mods folder.\n\n### No Screamer Scouts Add-on\n\nMakes it so scouts no longer spawn.\n\n**Note:** If there are not many zombies, change the max\\_alive\\_per\\_horde\\_player setting in your “Mods/ImprovedHordes/Config/ImprovedHordes/settings.xml” file.\n\n## Screenshots\n\n## Installation\n\n**Note:** This mod can be added to existing saves to start working, no new save is required. Testing has been done on removing the mod from an existing save game, and no issues have currently been uncovered.\n\n### For Clients\n\n**Note:** This mod is not client-side EAC-compatible and will not run with EAC enabled due to how mod DLL loading works in A20.\n\nDownload and extract the latest release into a new folder called ImprovedHordes, then drag and drop the newly created ImprovedHordes folder into the Mods folder in your 7 Days to Die install folder (create one if it does not exist).\n\nTo verify you have installed the mod correctly, located inside your Mods folder should be an ImprovedHordes folder (containing the Config folder, ImprovedHordes.dll and ModInfo.xml files).\n\nSettings can be modified in the **Config/ImprovedHordes/settings.xml** file in the ImprovedHordes mod folder.\n\n### For Dedicated Servers\n\nThe mod only needs to be installed on the server, as it is a server-side mod, so any client that joins your server without the mod installed will be able to experience it. The installation instructions are the same as the above, however it is installed in the Mods folder of the dedicated server.\n\n## Changelog\n\n**Improved Hordes 1.1.1 Update Released for Alpha 20.5 B2**\n\n* Updated for compatibility with Alpha 20.5 b2.\n* **Added**  \n   * Optional [Mod Manager](https://7daystodiemods.com/mod-manager/) support.  \n   * New Settings  \n         * <enabled> in <wandering\\_horde> to enable/disable custom wandering hordes.  \n         * <enabled> in <heat\\_tracker> to enable/disable the heat difficulty settings and patrol hordes.  \n         * New <horde\\_ai> option group.  \n                  * <sense\\_dist> The distance in meters at which hordes can sense players nearby.  \n                  * <threshold> The threshold before players nearby are sensed.  \n                  * New <advanced\\_settings> option group.  \n                              * <wander\\_time> The number of ticks that horde entities will wander before moving on.\n\n**Improved Hordes 1.1.0 Released for Alpha 20.3 B3**\n\n**Added**\n\n* Smarter heatmap that affects nearby chunks.  \n   * Simply being in a location for a long time will increase the heatmap by a small amount, normal heatmap activities will count more relative to roaming.  \n   * Affects the gamestage of any groups near these chunks, meaning more frequented areas will have harder hordes as zombies pinpoint the best places to catch survivors in.  \n   * Begins to decay after 1 day of no activity, takes 4 full days to decay. Revisiting the area will restart the timer and continue increasing the heat in the area. This can be adjusted in the settings.xml file under the heat\\_tracker section.\n* Patrol hordes  \n   * Begin to roam frequently visited areas on a determined frequency depending on the amount of heat generated in an area and the biome difficulty. Avoiding detection lowers the heat in the area.\n\n**Changed**\n\n* Improved Horde AI allowing horde zombies to sense players based on sight and sound.\n* Horde spawns for solo groups can now be in any direction.\n* Horde endpoints can now be 45-315° from their spawnpoint.\n* Gamestage difficulty now takes into account the biome you are in, adjusting for easier/tougher hordes, especially in the wasteland.\n* Feral scouts no longer summon a horde on death, but can fit in more screams than it’s non-feral variant.\n* Feral scout spawn chance is no longer dependent on gamestage, but instead now depends on the heat in an area.\n* Scouts contribute more heat to an area leading to harder hordes as they continue to scream.\n* Horde balancing changes.\n\n**Fixed**\n\n* Horde spawning within a player group instead of outside.\n* Wandering horde group occurrences for players not saving, leading to more spawns of certain horde groups than intended (ignoring the maxWeeklyOccurrences hordegroup value).\n* AI Horde not being removed from tracking after state change.\n\n**Improved Hordes 1.0.3 Update Released for Alpha 20.3 B3**\n\n* Updated for compatibility with Alpha 20.3 b3.\n* Added: Option to disable custom scout hordes and use default vanilla scout hordes instead. This setting can be changed in the settings.xml file.\n* Fixed: Bug where the first occurrence in the wandering horde schedule was being skipped due to an unchecked horde disbanding call.\n\n## Commands\n\nFor more information about the commands, type in the in-game console\n\n```\nhelp improvedhordes\n```\n\n**Note:** Requires a permission level of 0.\n\n## Wiki\n\nFor information such as changing mod settings or creating your own custom wandering/scout hordes, check out the [Improved Hordes Wiki](https://github.com/FilUnderscore/ImprovedHordes/wiki).\n\n## Mod Support\n\nAlthough mod support has not yet been tested, this should work with other mods that add new entities into the game that use the AI ApproachSpot/Wander properties, and can also be manually added with xpath. Mods that modify AI behavior may not work with this.\n\n## Terms of Use\n\n### Definitions\n\n* Private Use = Using the mod for personal use or hosting/running a server with the mod installed.\n* Binaries = The DLL file (ImprovedHordes.dll) distributed alongside the Improved Hordes mod.\n* Source Code = The files that fall under the “[Source](https://github.com/FilUnderscore/ImprovedHordes/tree/dev/Source)” directory in the Improved Hordes GitHub repository.\n* XML Files = The files that fall under the “[Config](https://github.com/FilUnderscore/ImprovedHordes/tree/dev/ImprovedHordes/Config)” directory in the Improved Hordes mod folder.\n* Mod Author = FilUnderscore, the original author of the Improved Hordes mod.\n* Original Sources = GitHub, Forum\n\n### Use\n\nYou are allowed to use Improved Hordes with or without any kind of modifications made to its source material.\n\n### Distribution\n\n* You are not allowed to distribute the Binaries and/or Source Code and/or XML Files of Improved Hordes in exchange for payment.\n* You are allowed to distribute modifications made to the XML Files of the Improved Hordes mod provided you give appropriate credit to the Mod Author and provide a link to the original sources of Improved Hordes and these Terms of Use.\n* You are not allowed to distribute the original nor modified Binaries and/or Source Code of the Improved Hordes mod without prior written consent from the Mod Author.\n* You are allowed to distribute links to the original sources of Improved Hordes.\n\n### Modification\n\nAny modifications made to the Improved Hordes Source Code and Binaries are limited to private use only if not stated otherwise with written consent from the Mod Author.\n\n### Liability\n\nMod Author is not responsible for any damage that may be caused during an incorrect or correct installation of Improved Hordes.\n\n### Written Consent\n\nIf you have been given written consent from the Mod Author to do one or more of the following: use, reuse, distribute, duplicate, copy or modify Improved Hordes outside of private use only, you are obligated to give appropriate credit to the Mod Author, provide a link to the original sources of Improved Hordes and these Terms of Use, and indicate if changes were made. You may do so in any reasonable matter, but not in any way that suggests the Mod Author endorses you or your use.\n\nAll rights to the Improved Hordes Binaries, Source Code, and XML Files are shared with The Fun Pimps.\n\n**[Download](https://github.com/FilUnderscore/ImprovedHordes/releases/latest/download/ImprovedHordes.zip)** Improved Hordes  \n**[Download](https://github.com/FilUnderscore/ImprovedHordes-Addons/releases/latest/download/IH-BiggerHordesAddon.zip)** Bigger Hordes Add-on  \n**[Download](https://github.com/FilUnderscore/ImprovedHordes-Addons/releases/latest/download/IH-RandomHordesAddon.zip)** Random Hordes Add-on  \n**[Download](https://github.com/FilUnderscore/ImprovedHordes-Addons/releases/latest/download/IH-ReducedScreamerScoutSpawnsAddon.zip)** Reduced Screamer Scout Spawns Add-on  \n**[Download](https://github.com/FilUnderscore/ImprovedHordes-Addons/releases/latest/download/IH-NoScreamerScoutsAddon.zip)** No Screamer Scouts Add-on\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/26781-improved-hordes-a20/).\n\n**Credits:** [FilUnderscore](https://7daystodiemods.com/tag/filunderscore/)",
  "modDownloadURLs": [
    {
      "Info": "Improved Hordes",
      "URL": "https://github.com/FilUnderscore/ImprovedHordes/releases/latest/download/ImprovedHordes.zip",
      "Version": "v19"
    },
    {
      "Info": "Bigger Hordes Add-on",
      "URL": "https://github.com/FilUnderscore/ImprovedHordes-Addons/releases/latest/download/IH-BiggerHordesAddon.zip",
      "Version": "v19"
    },
    {
      "Info": "Random Hordes Add-on",
      "URL": "https://github.com/FilUnderscore/ImprovedHordes-Addons/releases/latest/download/IH-RandomHordesAddon.zip",
      "Version": "v19"
    },
    {
      "Info": "Reduced Screamer Scout Spawns Add-on",
      "URL": "https://github.com/FilUnderscore/ImprovedHordes-Addons/releases/latest/download/IH-ReducedScreamerScoutSpawnsAddon.zip",
      "Version": "v19"
    },
    {
      "Info": "No Screamer Scouts Add-on",
      "URL": "https://github.com/FilUnderscore/ImprovedHordes-Addons/releases/latest/download/IH-NoScreamerScoutsAddon.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/26781-improved-hordes-a20/",
  "modAuthors": [
    "FilUnderscore"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die zombies",
    "FilUnderscore"
  ]
}