{
  "modURL": "https://7daystodiemods.com/lockpicking-mod/",
  "modCreatedTime": "2020-02-17T18:25:00+00:00",
  "modLastUpdatedTime": "2020-06-03T21:59:54+00:00",
  "modName": "Lockpicking Mod",
  "modImages": [],
  "modShortDescription": "You craft a lockpick, now renamed to LQ Lockpick, and equip it in your toolbar. You can then unlock most locked objects including doors and safes.",
  "modDescription": "Full credits and respect towards KhaineGB for the [original mod](https://community.7daystodie.com/topic/8494-lockpicking-modlet/). This 7DTD mod works like the original. You craft a lockpick, now renamed to LQ Lockpick, and equip it in your toolbar. You can then unlock (upgrade with right click) most locked objects including doors and safes. The advantage of it over the default lockpick is that it works on doors, won’t break until after you use it so it only takes on per lock, and only costs 20 scrap iron.\n\n**Other changes Tristam personally made:**\n\n* Reduced the number of “hits” until objects are unlocked. From an average of seven to an average of 2-3, in order to keep the item relevant when you have purple tools.\n* Made it work on vault doors and hatches, since they’re the reason he wanted the mod in the first place.\n* Removed the progression tree completely, so that it works as-is. By default, it would unlock at level 2, but the vanilla lockpick’s recipe unlocks at level 1\\. So he just made it so you can access it from the start. There’s also no need for a speed increase since the lockpicks all work faster than originally intended. The only thing left out is the reduced noise, but there needs to be more reason to use the vanilla Lockpicks over the LQ ones.\n* Localization is removed. So the description of the lockpick won’t show. (this is due to make skill level at “modding”) Changed, thanks to KhaineGB.\n\nMod is provided “as-is” and won’t receive major support.\n\n**Changelog**  \nUpdated by KhaineGB himself with localization.  \nMinor fixes.\n\n**[Download](http://www.mediafire.com/file/ekbmg2vprezjv7u/KHLockpicks.zip/file)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/17574-modlet-khlockpicks-183-ver/).\n\n**Credits:** [Tristam](https://7daystodiemods.com/tag/tristam/), KhaineGB",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "http://www.mediafire.com/file/ekbmg2vprezjv7u/KHLockpicks.zip/file",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/17574-modlet-khlockpicks-183-ver/",
  "modAuthors": [
    "Tristam",
    "KhaineGB"
  ],
  "modTags": [
    "7 days to die tools",
    "Tristam"
  ]
}