{
  "modURL": "https://7daystodiemods.com/mutations/",
  "modCreatedTime": "2020-08-28T20:50:00+00:00",
  "modLastUpdatedTime": "2020-09-18T20:21:09+00:00",
  "modName": "Mutations",
  "modImages": [],
  "modShortDescription": "Mutations mod adds a new perk line of mutations. One mutation exists for each attribute. But beware, each mutation you add makes you little less human.",
  "modDescription": "Mutations mod adds a new [perk](https://7daystodiemods.com/tag/7-days-to-die-perks/) line of mutations, which add end-game capstone abilities for those survivors who max out an attribute, as well as a money sink for those players who have too many dukes and not enough needs to fulfill with them.\n\nOne mutation exists for each attribute, and requires rank 10 in that attribute, as well as a two quest chains to get all the parts needed to create the granting item.\n\nBut beware, each mutation you add makes you little less human, and causes other NPCs to be a little less happy to give you a fair deal when trading with you.\n\nA new Tier 5 quest chain starter will be available when you attain Tier 5 [quests](https://7daystodiemods.com/tag/7-days-to-die-quests/), and the Traders’ Secret Stashes may contain Bounties for hunting down mutated wildlife.\n\n## v2.1 Release\n\nJust uploaded Mutations v2.1\\. This adds a line of custom mutant creatures to go along with the Bounty quests. One caveat, the bounties are not shareable, and the spawns in the final quest of each line are the only way to access those mutants. This means if you fail to get the kill, either through despawn or another player getting the kill credit, you’ll have to cancel the quest and start over. Make sure you’re prepared for Grace-level boss fights before triggering the 3rd stage.\n\n_Due to quest-line changes, this version is NOT backwards compatible with previous deployments. If anyone on the server has any of the quests active when you update the mod, it will corrupt their player file and restart them at level 1._\n\n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/stamplesmods/7d2dmodlets/tree/master/Mutations)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/16096-stamples-modlets/).\n\n**Credits:** [Stample](https://7daystodiemods.com/tag/stample/)  \n_Special Thanks:_ Snufkin, DerPopo",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/stamplesmods/7d2dmodlets/tree/master/Mutations",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/16096-stamples-modlets/",
  "modAuthors": [
    "StampleSpecial Thanks: Snufkin",
    "DerPopo"
  ],
  "modTags": [
    "7 days to die perks",
    "7 days to die quests",
    "Stample"
  ]
}