{
  "modURL": "https://7daystodiemods.com/nerf-them-all/",
  "modCreatedTime": "2022-02-19T10:52:00+00:00",
  "modLastUpdatedTime": "2022-02-19T10:55:31+00:00",
  "modName": "Nerf Them All",
  "modImages": [],
  "modShortDescription": "You think this game is easy and you are so bored you can't stand it? This is making the early gamestage longer lasting and more challenging.",
  "modDescription": "A big props to Jaxteller718 as many of his mods inspired Robeloto to make this mod.\n\nMakes the game more challenging and takes more time to reach end game content.\n\nYou think this game is easy and you are so bored you can’t stand it? Good, check out this modlet. The name can be a bit confusing as it can also mean that the difficulty is decreased, but it is not. The ‘easy to get stuff’ is nerfed and the challenging stuff is increased. Maybe someone have an idea of a better name of this modlet? Anyway, almost everything in this modlet is nerfed to make the game much harder. This is making the early gamestage longer lasting and more challenging.\n\nThe white river citizen quest is removed and now you have to find a trader by yourself. Heat map strength for the workstations are increased. Noise heat map strength from weapons is also increased. Do not rely just on weapons, cause that will punish you… with screamers.\n\nFarming takes now 7 hours for the crops to grow instead of 1 hour. Harvesting materials is reduced.\n\nSafes is harder to break up. The wandering hordes is much larger. Stone tools do less damage on metal. All tools/weapons can break. Ammo damage is reduced. Pipe weapons are nerfed.\n\nLooting is heavily nerfed and finding a wrench is almost impossible. Auger, Crucible and Steel Pickaxe/Sledgehammer is removed from loot. Better to make them yourself now as it is “supposed” to be, Quest rewards are nerfed. Robeloto only buffed up the challenge rewards cause they were way too bad. Traders does not sell as much as in the original and they restock every 2 weeks. In progression he nerfed the Sledgehammer a lot, but it is still OP, just not as much.\n\nRobeloto has listed everything that is nerfed down below.\n\n## Blocks\n\n* Increased heat map strength, time and frequency with about 20\\~% for all workstations. This will attract screamers a bit more than usual.\n* Decreased chance to get honey from tree stumps with 25%\n* Decreased all harvesting resources by 50%\\~\n* [Farming](https://7daystodiemods.com/tag/7-days-to-die-farming/) is a lot harder now. Slowed down the crops growing rate. Default is 60, in this mod it is 250\\. It takes about 4 hours for the crops to grow now instead of 1h\\~.\n* Harder to break up safes, their durability is increased with over 300%. Makes more use of the lockpicks.\n* Get less snow when digging\n\n## Biomes\n\n* No surface ores, except snow and wasteland with a very low chance.\n* Less Chrysantemum, Cotton, Aloe vera and Yucca plants.\n* Less grass\n\n## Gamestages\n\nGet a large horde that is split up in 3 waves, each day.\n\n## Items\n\n* It is not realistic with stone [tools](https://7daystodiemods.com/tag/7-days-to-die-tools/) do so much damage on safes and other metal objects. Now stone tools do much less damage on metal objects, except from the sledgehammer.\n* All tools and weapons can break\n* Pipe weapons are nerfed with 1.2 entitydamage.\n* All ammo damage is reduced by about 20-25%\\~\n* All damage from thrown explosives/molotovs is also reduced. The molotov also only lasts for about 8 seconds, instead of the unrealistic 16 seconds.\n* [Vehicles](https://7daystodiemods.com/tag/7-days-to-die-vehicles/) durability is reduced by a lot. Now you actually have to repair them.\n\n## Loot\n\n* The chests and [weapons](https://7daystodiemods.com/tag/7-days-to-die-weapons/) bag has less items in them.\n* Removed Auger, ImpactDriver, Ratchet, Crucible, Steel Pickaxe and Steel Sledgehammer completely from the lootcontainers. You can get auger in quests.\n* Also removed The Pickaxes from all lootcontainers, but you still can get an Iron Pickaxe from quests.\n* Treasure map loot chance reduced from a 0.09% chance to 0.02%. They should be rare to find.\n* Workstations is now much harder to find in the world.\n* Removed the wrench, ratchet, impactdriver, crucible and forge schematic from the schematictools group.\n* Wrench is removed from all the lootcontainers.\n* Treasure loot decreased by half\n* Nailgun loot chance decreased by 40%\n* Less drinks from the [drinks](https://7daystodiemods.com/tag/7-days-to-die-drinks/) lootgroup\n* Less water from luggage and fridges. Decreased water chance by 25%.\n* Lower chance to get water from the microwaves\n* Quest ammo reward is heavily reduced as it was way too much in original.\n* Quest thrown explosive ammo reward is also reduced. Molotov only last 8 seconds instead of 16.\n* Lowering GroupQuestTools chances from quest, Iron/Steel Pickaxe, Auger\n* Lowering GroupQuestWeaponsMelee – Iron/steel sledgehammer.\n* Lowered the Quest reward for Casino coins\n\n## Progression\n\n* You now need to have Advanced Engineering level 3 to be able to craft a forge, tablesaw workbench, cementmixer and various [traps](https://7daystodiemods.com/tag/7-days-to-die-traps/).\n* Unlock wrench at Salvage Operations level 3 instead of 1.\n* Club is nerfed in the perks, nerf is about 20\\~30%\n* Sledgehammer is nerfed in the [perks](https://7daystodiemods.com/tag/7-days-to-die-perks/) again. This weapon is still OP, even with the nerf. Robeloto would say the nerf is about 40\\~45%.\n* Stun Baton, only nerfed it a tiny bit as it is really no way an OP weapon, but just to even it out with the sledge and club weapons.\n* MasterChef Perk is changed. Stage 1 gives you only recipes for BaconAndEggs ,BakedPotato, CornBread and CornOnTheCob. Stage 2 gives BoiledMeat, GrilledMeat, RedTea, Coffee and GoldenRodTea recipe. Stage 3 gives SteakAndPotato, BlueberryPie, MeatStew, VegetableStew, PumpkinPie, PumpkinCheesecake and PumpkinBread recipe. Stage 4 gives ShamChowder, HoboStew, FishTacos, YuccaJuiceSmoothie, ChiliDog and Beer recipe. And finally stage 5 gives GumboStew, ShepardsPie, Spaghetti, TunaFishGravyToast, GrandpasMoonshine, GrandpasAwesomeSauce and GrandpasLearningElixir recipe.\n* You will unlock Iron Pickaxe at Miner69r stage 3 instead of 1.\n\n## Quests\n\n* White river citizen [quest](https://7daystodiemods.com/tag/7-days-to-die-quests/) is removed, so now you have to find a trader yourself without any help.\n* The Trader cannot show you the way to the next trader.\n* Tier 1 Quest Reward nerfed – Removed Bicycle, Forge, Wrench, Helmetlightschematic (Added bicycle parts).\n* Tier 2 Quest Reward nerfed – Removed Workbench\n* Tier 3 Quest Reward nerfed – Removed Darttrap, Genbank, Chemstation\n* Tier 4 Quest Reward nerfed – Removed Batterybank, Bladetrap. (Added Darttrap)\n* Tier 5 Quest Reward nerfed – Removed Autoturret, Forged Steel, Legendaryfirearms. (Added Blade trap, Generatorbank.)\n\n## Recipes\n\n* Harder to make gunpowder. 50% more resources is needed. If it was a way to decrease the veins of coal and nitrate powder, Robeloto would have done that too.\n* Junkturret [ammo](https://7daystodiemods.com/tag/7-days-to-die-ammo/) now needs 5 iron instead of just 3.\n* More snow is needed to make water\n\n## Sounds\n\n* Noise heat map strength increased on all guns. Relying too much on ammo and weapons will punish you with screamers.\n\n## Traders\n\n* Removed Auger, Steel pickaxe, Steel sledgehammer, Crucible, Wrench, Forged iron/steel, placeable motorvehicles and workstations. Go make them yourself as it is “supposed” to be. Do not rely on [traders](https://7daystodiemods.com/tag/7-days-to-die-trader/) so much!\n* Ammo is scarce so now the traders sells much less ammo. Ammo is often considered gold in this postapocalyptic world.\n* Building materials is also reduced, like cobblestone, cement and concrete mix.\n* Traders has less items to sell and the restock day is now every 2 weeks instead of daily.\n* Less items in vending machines and they never restock, well, they do… in 999 days, but who has gone so far in game days? It is not realistic that they get restocked so often in the original.\n\n## Changelog\n\n* Ammo damage slightly nerfed\n* Pipe weapons damage nerfed\n* Sledgehammers nerfed a bit more again\n\n**Alpha 20 Versions**  \n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A20_Modlets/tree/master/Robeloto_NerfThemAll)** for **A20**  \n**Alpha 19 Versions**  \n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A19_Modlets/tree/master/Robeloto_NerfThemAll)** for **A19**  \n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A19_Modlets/tree/master/Alternate%20versions%20of%20mods/Robeloto_NerfThemAll%20alternate%20versions/PerkAE%20and%20PerkGM%20removed%2C%20chance%20to%20loot%20steel%20tools%20and%20crucible)** alternate versions for **A19** _(Check the Readme for changes. Copy these files to the default mod and overwrite them to make the changes.)_\n\nIf you appreciate Robeloto’s work and you want to show support, use this [donate link](http://paypal.me/robeloto).\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/12229-robelotos-modlets/).\n\n**Credits:** [Robeloto](https://7daystodiemods.com/tag/robeloto/)",
  "modDownloadURLs": [
    {
      "Info": "Alpha 20 Versions",
      "Version": "v19"
    },
    {
      "Info": "for A20",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A20_Modlets/tree/master/Robeloto_NerfThemAll",
      "Version": "v19"
    },
    {
      "Info": "Alpha 19 Versions",
      "Version": "v19"
    },
    {
      "Info": "for A19",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A19_Modlets/tree/master/Robeloto_NerfThemAll",
      "Version": "v19"
    },
    {
      "Info": "alternate versions for A19 (Check the Readme for changes. Copy these files to the default mod and overwrite them to make the changes.)",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A19_Modlets/tree/master/Alternate%20versions%20of%20mods/Robeloto_NerfThemAll%20alternate%20versions/PerkAE%20and%20PerkGM%20removed%2C%20chance%20to%20loot%20steel%20tools%20and%20crucible",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/12229-robelotos-modlets/",
  "modAuthors": [
    "Robeloto"
  ],
  "modTags": [
    "7 days to die ammo",
    "7 days to die biomes",
    "7 days to die building materials",
    "7 days to die drinks",
    "7 days to die farming",
    "7 days to die loot",
    "7 days to die perks",
    "7 days to die quests",
    "7 days to die recipes",
    "7 days to die tools",
    "7 days to die trader",
    "7 days to die traps",
    "7 days to die vehicles",
    "7 days to die weapons",
    "7 days to die zombies",
    "Robeloto"
  ]
}