{
  "modURL": "https://7daystodiemods.com/new-game-plus-v2/",
  "modCreatedTime": "2021-10-08T20:58:00+00:00",
  "modLastUpdatedTime": "2021-10-09T01:46:56+00:00",
  "modName": "New Game Plus v2",
  "modImages": [],
  "modShortDescription": "This is the second version of my hardcore \"New Game Plus\" mod that I made to drive me and my friends insane.",
  "modDescription": "This is the second version of my hardcore “[New Game Plus](https://7daystodiemods.com/new-game-plus/)” mod that I made to drive me and my friends insane. What else am I going to do while endlessly applying for web developer jobs that require 3+ years experience for an entry level position? This mod is balanced (in my opinion, not so much my friend’s) and is a more intense and more difficult experience than the vanilla game. Even at higher levels players will struggle because of new limitations placed on them. I tried to shift the vibe away from a crafting game with zombies to a survival horror game with crafting.\n\n## Zombies\n\n* Zombies everywhere! The burnt region has the least amount of [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/). I’d recommend setting all zombie speeds to jogging or running at most, and decrease block damage to 25-50% to balance the constant zombies everywhere. But I left that up to the server settings.\n* Zombies stay stunned longer (play dead).\n* Wandering Hordes are always large and now only consist of zombies (no [animals](https://7daystodiemods.com/tag/7-days-to-die-animals/)).\n* Zombies can see you from 100 blocks away now, but have limited peripheral vision. If you run around a lot out in the open you will stir up a lot of zombies! To counter this, stealth has been improved.\n* Wights are faster, more frequent, and have a venomous attack. It doesn’t do any damage, but it disorients you and has a chance you make you fall over if you are sprinting. Once a Wight has marked you, good luck escaping!\n* A giant vulture (Jabberwocky) has been added to drive one of my friends, who can’t stand vultures, completely insane.\n* All zombie types appear everywhere in the world now, including the less common demolition zombie and fat acid cop.\n* Set SmellAlertThreshold to 999 so sleeping zombies are much less likely to detect you.\n\n## Player\n\n* Leveling curve: 4x faster at level 1, equivalent to vanilla by level 15, clamps at level 28\\. (level cap is still 300)\n* 3 Perk [points](https://7daystodiemods.com/tag/7-days-to-die-skill-points/) each level, but higher level perks require more points: Ranks 1-5 cost = (1, 1, 2, 3, 4). This way you level up basic perks quickly while still enjoying some struggle to master them.\n* Damage will halt you for a moment (0.67 seconds) immediately after getting hit. You cannot move or jump, and if you try to sprint you will fall over. So, if you are sprinting while you get shot, shocked, sliced by a barbwire fence, or clothes-lined by a zombie you will hit the ground. When fighting zombies you must fight them off or sprint between hits if you wish to flee! This makes groups of normal zeds incredibly dangerous because they can overwhelm and immobilize you if you turn and run at a bad time.\n* Injuries remain after near-death (except infection).\n* Any damage you take will also reduce your stamina. The amount of stamina depends on your health. Someone badly injured will be easily incapacitated.\n* Realistic player walk and sprint speeds.\n* Injuries are much more frequent at lower health levels.\n* [Carry](https://7daystodiemods.com/tag/7-days-to-die-backpack/) capacity is limited to 9 unencumbered slots at the start. You need to make pocket mods or use a vehicle to move large amounts.\n* Max [stack size](https://7daystodiemods.com/tag/7-days-to-die-stack-size/) for most resources is now 1000.\n* No crosshairs for ADS.\n\n## Items/Recipes/Things\n\n* Nerd pole prevention (an XML only solution! I am so smart, SMRT).\n* Items made with parts require less parts to make and do not increase in cost the higher level you are.\n* Items made with parts require those 1 of those parts for repair. Iron melee, tools, and vehicles still use repair kits.\n* Items with durability will now disintegrate when reaching 0.\n* Find [eggs](https://7daystodiemods.com/tag/7-days-to-die-food/) and feathers in shrubs.\n* Find potatoes and mushrooms while digging in soil.\n* Make Murky water with Boiled Water + Clay, make Animal Fat by grilling Meat.\n* Berserker porridge recipe added.\n* Meat recipes require less meat and now offer 2x calories.\n* Any recipe that uses rotting meat (e.g. Sham Stew, Hobo Stew) has Dysentery chance.\n* Hidden [vehicle](https://7daystodiemods.com/tag/7-days-to-die-vehicles/) modifiers are now found in automotive loot crates.\n* Vehicles are much weaker.\n\n## Credits\n\nMods I borrowed from: [Toad\\_VehicleMods](https://7daystodiemods.com/toads-vehicle-mods/), [Riles-SeatingPlus](https://7daystodiemods.com/riles-seatingplus/), [JaxTeller718\\_ToolsWeaponsBreak](https://7daystodiemods.com/weapons-and-tools-break/).\n\nRecommended and compatible with [0-CreaturePackZombies](https://7daystodiemods.com/creature-packs-a-community-entity-project/), “Zombie Creature Pack Base Modlet”, by XythCommunityProject as of Version 19.0.3.5.\n\n**[Download](https://drive.google.com/file/d/1WoEEov0OpJKeAEkjQh2O0d_WS1BPHkhB/view?usp=sharing)**\n\n**Credits:** [Jackalope](https://7daystodiemods.com/tag/jackalope/), AnsontheToad, Riles, JaxTeller718",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/1WoEEov0OpJKeAEkjQh2O0d_WS1BPHkhB/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modAuthors": [
    "Jackalope",
    "AnsontheToad",
    "Riles",
    "JaxTeller718"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die backpack",
    "7 days to die biomes",
    "7 days to die drinks",
    "7 days to die experience",
    "7 days to die food",
    "7 days to die loot",
    "7 days to die perks",
    "7 days to die recipes",
    "7 days to die skill points",
    "7 days to die stack size",
    "7 days to die stamina",
    "7 days to die vehicles",
    "7 days to die weapons",
    "7 days to die zombies",
    "Jackalope"
  ]
}