{
  "modURL": "https://7daystodiemods.com/not-medieval-mod-a-fantasy-modpack/",
  "modCreatedTime": "2022-06-23T16:00:00+00:00",
  "modLastUpdatedTime": "2022-06-23T16:02:24+00:00",
  "modName": "Not Medieval Mod - A Fantasy Modpack",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-2a.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-17.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-14.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-4.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-5.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-6.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-7.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-8.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-9.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-15.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-10.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-11.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-16.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-12.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-13.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-not-medieval-mod-a-fantasy-modpack-changelog-screenshot-1j.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-not-medieval-mod-a-fantasy-modpack-changelog-screenshot-2i.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-not-medieval-mod-a-fantasy-modpack-changelog-screenshot-3f.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/06/7-days-to-die-not-medieval-mod-a-fantasy-modpack-changelog-screenshot-4e.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/05/7-days-to-die-not-medieval-mod-a-fantasy-modpack-additional-screenshot-1a.jpg"
  ],
  "modShortDescription": "The 'Not Medieval Mod' is a fantasy modpack based around a 'medieval/historical' theme. It provides an immersive environment, from game characters to the overall theme.",
  "modDescription": "The ‘Not Medieval Mod’ is a fantasy modpack based around a ‘medieval/historical’ theme. It provides an immersive environment, from game characters to the overall theme. The goal was to move back in time and bring in a touch of magic. As such, modern day assets have been removed, renamed, or replaced where possible.\n\nMany regular game features will be recognisable and allow players to quickly adapt to the new theme. For example, a Worktable is now an NMM Dragon Worktable with some craftable items removed but some new ones gained. Regular modern zombies are also gone but you’ll still see Burnt Zombies out there and a few crawlers in POIs. The Wasteland is now Orcland with a partial burnt crispiness and wasted feel.\n\nWhile the NMM is not long out of development, it is fully functional.\n\n## About the World – NMM01\n\nNMM currently uses the game’s in-house RWG with a little repainting of the Biomes for additional variety. In addition, all buildings will be community made and incorporated into A20s superb Tiling system. This image shows how the biome and layout will look. The placement of Wilderness POIs and mixing of POIs in the tiling system will change as updates arrive and this image will be a very true likeness of what can be expected.\n\n**6K Version**\n\n**8K Version**\n\nTo make your own RWG, temporarily remove your Data > Prefabs > POIs. The NMM is bundled with all the required POIs to generate a World. If you prefer not to temporarily remove your POIs folder, your World will only have NMM City/Town/Village Tiles, but the Wilderness will contain regular default buildings.\n\nIt is brought to you by Darkstardragon, who has been very active supporting the community project [NPCMod](https://7daystodiemods.com/npcmod-a-community-project/), with an abundance of custom Addon entity packs. With the NPCMod being released (which powers the NMM), followed by CP48 Medievil Village (which adds that full on immersion to locations), the ‘Not Medieval Mod’ was simply waiting there for the taking.\n\nThe ‘Not Medieval Mod’ should really be considered as a team effort because it combines the creativity of Prefab/POI creators, modelers, coders, and everything and everyone else that is required to release a full on mod.\n\nIt provides a multitude of custom assets from game characters to a fully immersive environment. Here are a few images to demonstrate.\n\n## Environment\n\nThis images shows CP48 Medievil Village minimally customised for the ‘NMM’. Beyond changing things like electric lights and other modern assets, the POIs stay totally true to the original creators concept. The player is riding on the Pegasus which is currently available after completing a Tier 4 end tier Quest.\n\n## Entities\n\nThere are **Orcs and Goblins** which are ‘Bandit’ class entities. They will attack players without hesitation. In early Game Stages they will be melee type and as you progress you will experience some with ranged weapons (crossbows and bows). They will appear in the [Biomes](https://7daystodiemods.com/tag/7-days-to-die-biomes/) and selective POIs during Quests.\n\nThere are the **Undead**. These are a collection of ‘Zombie’ class entities. They will attack Players, Orcs and Goblins. However, some types of Orc and Goblin are also built into the Undead faction to help make Horde Night a more eclectic experience.\n\nThere are the **Friendlies**. These consist of ‘Survivors’ and ‘Hireable’ classes. The Survivors are just trying to survive like regular players, while the [hireables](https://7daystodiemods.com/tag/7-days-to-die-npcs/) can be hired by players to assist you. You can build your own merry band of followers.\n\nThere are also **Mythical Beasts** such as Dragons out there… And some giant Rats and Spiders are known to lurk around as well.\n\n## Vehicles\n\nPlayers can gain a [horse](https://7daystodiemods.com/tag/7-days-to-die-animals/) (kindly created by Zilox) after completing a Quest Tier if they so desire.\n\nThe Shaman Goblin. And that stick is not just for show… ^^\n\n## Weapons\n\nPlayers also have access to a variety of custom weapons:\n\n* Smite Thee Down type. These consist of hand held cutting, stabbing, and head cracking [weapons](https://7daystodiemods.com/tag/7-days-to-die-weapons/).\n* Flintlock and Blunderbuss weapons.\n* Semi-automatic crossbows that hold 4 bolts at a time.\n* Speary things.\n\nThese progress using their associated skill from Quality 2 – 6\\. They are integrated into the regular system but you’ll see a little difference in name changes.\n\noakraven has been prolific in sharing assets with the NMM and had these weapons all ready and prepared well in advance.\n\n## Traders\n\nThere are also custom Traders which are piggybacking the regular [traders](https://7daystodiemods.com/tag/7-days-to-die-trader/) and their unique traits.\n\nRekt has become Baker, who is built into the NPCMod Core files and being put to full effect. He also sells roast chicken and provides two custom quests.\n\nAnd Laz Man’s older version of the Blacksmith POI has also been converted into its own Trader POI with an appropriate character from the NMM.\n\n## Quests\n\nThere are an abundance of Quests beyond regular Fetch and Clear.\n\n* One is automatically provided upon entering the game and after completing the ‘Tutorial’ stage. It gives Skill Points for completing a certain number of eliminations during Horde Night. Players who prefer not to have this automatic quest can delete it from their quest tree list.\n* One can be found in the player tool belt and starts an entity quest to eliminate the Undead faction. This has 5 quest stages and awards experience and skill points upon full completion. Others in this series can be purchased from Traders.\n* Another is also shared in the tool belt and offers a mixed quest of collect / craft / defend. This can also be purchased again from Traders.\n* Some Traders have their own specific side [quests](https://7daystodiemods.com/tag/7-days-to-die-quests/) which only they will offer.\n\n### The Main Quest\n\nThe Main Quest is one which requires visiting certain POIs in a certain order based on the scroll instructions. This quest is primarily designed for SP or smaller groups who share as a party. It is not designed for large communities or public servers. A starter scroll is found at a certain central POI (which can be found in multiple towns) and leads players on a sequential quest mission. These POIs and scrolls will not reset and once taken or complete are gone forever. However, a server admin using server admin tools can reset the specific POIs or region that they sit in to provide a ‘loot respawn’ equivalent which will then bring them back into place.\n\nThe names can be provided to server admin on request but will not be publicly shared to avoid any spoiler disappointment.\n\nWhat else will you find? The Oakraven Forest Collection has been ‘plundered’ and incorporates the [fish](https://7daystodiemods.com/tag/7-days-to-die-fishing/) farming, bee hives, chicken coops, wells and and and… ^^\n\nHere is the Read Me added into the mod which shows a list of Credits, without whom the NMM would not be possible.\n\n**Not Medieval Mod for 7D2D is powered by 0-XNPCCore and 0-Score**\n\n**Assets**\n\n**1-NMMCore**\n\n1-NMMCore contains all of the base resource files and connected xml files.\n\n‘Not Medieval Mod’ (NMM) Creators and Developers in Alphabtical Order from Z – A:\n\n* Zilox – Kindly provided the Medieval Horse.\n* xyth – Kindly developed the 0-XNPCCore, along with the team. The 0-XNPCCore is a complete bundle of models, code, and other game assets.\n* Xyth/SphereII/Mumpfy – Kindly developed ‘Locks’ mod powered by Score.\n* sphereii – Kindly developed the 0-Score, along with the team. Also provided the 0-SphereII Legacy Distant Terrain.\n* oakraven – Kindly provided the NMMOakCore content, consisting of multiple released and NMM standalone mods. (Full list below)\n* magejosh – Kindly supported background development, such as Biome modification.\n* MichaelL./mplogue – Kindly provided custom Prefabs that match the theme of the NMM. POI creator extraordinaire.\n* KhaineGB – Thank you for sharing Lockable Inventory Slots for mod use.\n* Guppycur – Kindly provided resources, and a venue for the NMM development.\n* Darkstardragon – NMM Creator and Overseer. Bought and brought all entities, and some models, into the NMM along with a host of other critical tasks.\n* Compo Pack Team – Kindly allowed ‘Medieval’ type [Prefab](https://7daystodiemods.com/tag/7-days-to-die-prefab/) submissions to support the NMM. stallionsden brought them all together into tiled Medieval townships. (Full list below)\n* arramus – Kindly supported this, that and the other.\n\n_(Some customisation from original assets was required for integration and balance)_\n\n**2-NMMOakCore**\n\nThis 2-NMMOakCore Mod Pack compiles mods created by Oakraven, with support from arramus. It is a highly fundamental part of the NMM and Oakraven has really gone above and beyond. Thank you. The majority are individual mods and part of the Oakraven Forest Collection that can be found [here](https://7daystodiemods.com/oakraven-forest-collection/).\n\nOakraven Forest Collection Mod List:\n\n* Bee Hives\n* Chicken Coops\n* Cooking Stations\n* Dragon Beds and Stuff (A custom collection made for the NMM)\n* Dragon Blunderbuss (A custom collection made for the NMM)\n* Dragon Carts (A custom collection made for the NMM)\n* Dragon Crossbows (A custom collection made for the NMM)\n* Dragon Flintlocks (A custom collection made for the NMM)\n* Dragon Weapons (A custom collection made for the NMM)\n* Fireflies\n* Fish Farm\n* Oakdragon UI\n* Torches and Lights\n* Water Wells\n* Work Stations\n\n**1-NMMSmittysArmor**\n\nThis 1-NMMSmittysArmor Mod compiles assets provided by Smitty from the Smitty’s Armor mod. Thank you for giving your kind permission.\n\n**2-NMMCP48 Medievil Village Modded**\n\nThe Compo Pack is a well know and very well establish 7D2D resource that allows custom POIs/Prefabs to be added to Worlds. Submissions are made to the CP team and kept as intact as possible beyond carefully modifying for quality and performance.\n\nThe beauty of the CP is that it is very welcoming and open to all submissions and supports over 1000 Prefabs.\n\nA20 further diversified Worlds with a Tiling system and Stallionsden and team have carefully created themed tiles. Check them out [here](https://community.7daystodie.com/topic/21900-magolis-compo-pack-by-the-compopack/).\n\nThe Medievil Village is one of the themed tile sets and consists of 31 community made Prefabs that have been updated or submitted for A20\\. All of the Prefabs keep their original names. However, the Sleeper Volumes, some internal assets, and tags have been changed to match the theme and avoid conflict where the originals are installed.\n\nPrefab creators from Z – A include:\n\n* Zyncosa\n* WormPie\n* WildPig\n* Vitamin E\n* ‘Unknown’\n* Tom\n* TehKarmah\n* SirLoachalot\n* Riahsaurus Rex\n* PVWolfgang\n* Pashmina\n* Midnight Peach\n* Libby\n* Laz man\n* Guppycur\n* Ericbeaudoin\n* Eko\n* Eihwaz\n* Ataxia78\n* arramus\n\nAdditional POI submissions for CP49 are joining Medievil Village Modded.\n\nPrefab creators from Z – A include:\n\n* Shema\n* Redzero83\n* Magoli\n\n## Optional Setting\n\nBy default NMM has no food spoilage system. However, it is hooked up to allow it and this can be easily turned on to increase the challenge.\n\n* Step 1\\. Go inside your ‘1-NMMCore / Config folder and open the blocks.xml file.\n* Step 2\\. On Line 4 you can see this code line.\n\n```\n<set xpath=\"/blocks/block[@name='ConfigFeatureBlock']/property[@class='FoodSpoilage']/property[@name='FoodSpoilage']/@value\">false</set>\n```\n\n_(may say true at the end depending on your version)_\n\nChange the false to true to turn on food spoilage.  \nChange the true to false to turn off food spoilage.\n\n## Known Quirks/Issues/Exploits\n\n* The NPCs are not governed by low level protection rules and initial spawning may be met with a hostile or friendly interaction.  \n   * Response: Run to a safer place, ideally close to a friendly who will attack the hostile by default.\n* The NPCs sometimes pause, disappear, do not follow requests promptly, attack too much, or show other odd actions.  \n   * Response: They are what they are, and as good as it gets for now, which is actually very functional and adds immersion. For major issues, report in the NPCMod [thread](https://community.7daystodie.com/topic/26974-npcmod-a-community-project/).\n* Quests are not registering kills.  \n   * Response: Has been reported to the developers in the previous comment thread.\n* Fetch quests can be exploited.  \n   * Response: Place the fetch items in your inventory before handing in to the trader. This exploit can be both beneficial and negative depending on the sequence. This uses a built in game quest feature and will hopefully get resolved in the future.\n* It is not possible to open some crates when a light/object is placed above or under it.  \n   * Response: This requires some changes to the models and will be resolved in due course.\n\n## Localization\n\nThe NMM mod has been built using an English interface and Localization mods are gladly accepted for other languages.\n\n## Changelog\n\nUpdate the Development Build and the Stable Build to include a new multi-trader POI that replaces the mountain top version.\n\nIt is located in the Wilderness and some will be quite close to town while others will require a journey.\n\nThis POI was made by Shema specifically as a Trader location.\n\nIn addition, the Chicks in nests for the Stable Build will also receive the update from custom loot to standard nest loot which is showing stability with a 20% chance of a find.\n\nThe 6K and 8K Worlds have also been updated to include the trader POI.\n\nAdded a small update to the Development Build:\n\n* Icon updates for Oak mods (workstation, food/drink, etc)\n* New Chicken Coop and reduced audio\n* Localisation to make things more sequential\n\nHouse Coop\n\nSequential listing.\n\nThese will be added to the Stable Build in due course as additions/edits mount up.\n\nOakraven updated the icons for the Water Wells/Stand Pipes and they’ve been added to the Development Build.\n\nThey are much more face on and each well has its own unique icon.\n\n## Installation\n\nPlace these individual mods from the bundle in your Mods folder. The bundle to be placed in your Mods folder consists of the following:\n\nFor Players and Server Admin/Hosts who have never installed a mod before, here are some simple step by step instructions:\n\n1. If you’ve never installed a mod before, it is necessary to create a Mods folder in the main directory, typically inside :\\\\SteamLibrary\\\\steamapps\\\\common\\\\7 Days To Die. In the future, this location may change and they will update instructions at that time. If you have a custom install or your server host has modified the installation location, then you may have to explore.\n2. Simply make a new folder called Mods (with a capital M to reflect standard nomenclature) in your ‘7 Days To Die’ main directory folder.\n3. You can now drag all of the mod folders directly out of the zipped file, and it can be placed directly into the Mods folder. It should look like the list of folders and file in the image above.\n4. And when you launch the game, turn EAC (anti cheat software) off because EAC will not accept the custom content.\n* Does this Mod need to be installed in the server/client host? = YES\n* Do players also need to install this Mod? = YES (because it contains custom content that cannot be downloaded from the server).\n\nThe stable version will be updated on a weekly-monthly basis when the current development version has been fully tested as stable.\n\n**DEVELOPMENT BUILD – Can change daily**  \n**[Download](https://github.com/drkstardragon/NMM/archive/refs/heads/main.zip)** Not Medieval Mod _(This version is the development version and updated regularly. The current version will show the date on the Readme.)_  \n**[Download](https://github.com/drkstardragon/NMMWorlds/archive/refs/heads/main.zip)** NMM01 World _(This World is compatible with the above and will be updated when necessary. The current version will show the date of creation in the file name.)_  \n**STABLE BUILD – Updated weekly/monthly**  \n**[Download](https://www.moddb.com/downloads/start/232526)** Not Medieval Mod _(This version is the current public version which is decent for communities who want a stable build for everyone to download and share the same assets. It will be given a rapid update for critical issues, but other than that updates will arrive when there is sufficient additional content or change.)_  \n**[Download](https://www.moddb.com/downloads/start/232524)** World NMM01 _(This World is compatible with the above and will be updated when necessary. It is 6K.)_  \n**[Download](https://www.moddb.com/downloads/start/233663)** World NMM02 _(This World is compatible with the above and will be updated when necessary. It is 8K.)_  \n**LOCALIZATION**  \n**[Download](https://www.moddb.com/downloads/start/233314)** Japanese Localization Mod created by Macksan _(日本語化MOD)_\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/28810-not-medieval-mod-a-fantasy-modpack/).\n\n**Credits:** Darkstardragon and community",
  "modDownloadURLs": [
    {
      "Info": "DEVELOPMENT BUILD – Can change daily",
      "Version": "v19"
    },
    {
      "Info": "Not Medieval Mod (This version is the development version and updated regularly. The current version will show the date on the Readme.)",
      "URL": "https://github.com/drkstardragon/NMM/archive/refs/heads/main.zip",
      "Version": "v19"
    },
    {
      "Info": "NMM01 World (This World is compatible with the above and will be updated when necessary. The current version will show the date of creation in the file name.)",
      "URL": "https://github.com/drkstardragon/NMMWorlds/archive/refs/heads/main.zip",
      "Version": "v19"
    },
    {
      "Info": "STABLE BUILD – Updated weekly/monthly",
      "Version": "v19"
    },
    {
      "Info": "Not Medieval Mod (This version is the current public version which is decent for communities who want a stable build for everyone to download and share the same assets. It will be given a rapid update for critical issues, but other than that updates will arrive when there is sufficient additional content or change.)",
      "URL": "https://www.moddb.com/downloads/start/232526",
      "Version": "v19"
    },
    {
      "Info": "World NMM01 (This World is compatible with the above and will be updated when necessary. It is 6K.)",
      "URL": "https://www.moddb.com/downloads/start/232524",
      "Version": "v19"
    },
    {
      "Info": "World NMM02 (This World is compatible with the above and will be updated when necessary. It is 8K.)",
      "URL": "https://www.moddb.com/downloads/start/233663",
      "Version": "v19"
    },
    {
      "Info": "LOCALIZATION",
      "Version": "v19"
    },
    {
      "Info": "Japanese Localization Mod created by Macksan (日本語化MOD)",
      "URL": "https://www.moddb.com/downloads/start/233314",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/28810-not-medieval-mod-a-fantasy-modpack/",
  "modAuthors": [
    "Darkstardragon and community"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die armor mods",
    "7 days to die biomes",
    "7 days to die drinks",
    "7 days to die farming",
    "7 days to die fishing",
    "7 days to die food",
    "7 days to die lights",
    "7 days to die maps",
    "7 days to die melee weapons",
    "7 days to die npcs",
    "7 days to die prefab",
    "7 days to die quests",
    "7 days to die trader",
    "7 days to die weapons",
    "7 days to die zombies"
  ]
}