{
  "modURL": "https://7daystodiemods.com/npc-vincent/",
  "modCreatedTime": "2020-08-27T03:16:43+00:00",
  "modLastUpdatedTime": "2021-04-28T22:06:25+00:00",
  "modName": "NPC  Vincent",
  "modImages": [],
  "modShortDescription": "This mod adds Vincent, a basic resource gatherer, to the game. In this mod, you hire an NPC named Vincent for some dukes.",
  "modDescription": "This mod adds Vincent, a basic resource gatherer, to the game. This is a bit of a proof of concept mod, but works fine for single player only. In this mod, you hire an [NPC](https://7daystodiemods.com/tag/7-days-to-die-npcs/) named Vincent for some dukes. Once hired and placed, you can craft work order tools of a stone axe, stone sledge, iron pickaxe and axe, and a steel pickaxe and axe. These items can then be given to Vincent. You must be within the yellow circle under him for about a second before all buffs will kick in. This will make him start chopping the tree or mining the boulder. After a set time limit, depending on the tier of tool given, he will have completed the work order and have a pile of resources waiting to be collected. Stone tier will give 1000 stone or wood over 10 minutes. Iron tier will give 2500 over 8 minutes, and steel tier will give a full stack of 6k over just 5 minutes. **When doing these work orders, you must stay within the same chunk as Vincent. If you leave that chunk, the game will reload the entity and you will lose the buffs triggered, as well as the tool and resources.** So use your down time while at your base to have Vincent working for you.\n\nVincent will slowly ‘starve’ (the same as health) over time at a rate of 5 health per 25 seconds. When he is working, though, this will increase to 60 health per 25 seconds. You can craft him some custom bacon and eggs that will heal him for 40 every 2.5 seconds for one minute. At 20% health, he will display an icon indicating he is very hungry (for those of you who don’t use a health bars mod). Zombies are also able to attack him, so keep an eye on him. If he dies, you have to rehire him. Placing a new Vincent will destroy any other Vincent in the area within about 40 blocks.\n\nDoes not require restart.\n\nRequires client to install as well as server.\n\nTested and works with Alpha 19.4 b3\n\nThis mod only works on Single Player. Servers do not transfer the buffs correctly, sadly…\n\n**[Download](https://www.dropbox.com/s/8be9wolu9jhb6cb/TelricsNPCVincentA19.zip?dl=1)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/19976-telrics-a19-modlets/).\n\n**Credits:** [Telric](https://7daystodiemods.com/tag/telric/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://www.dropbox.com/s/8be9wolu9jhb6cb/TelricsNPCVincentA19.zip?dl=1",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/19976-telrics-a19-modlets/",
  "modAuthors": [
    "Telric"
  ],
  "modTags": [
    "7 days to die npcs",
    "Telric"
  ]
}