{
  "modURL": "https://7daystodiemods.com/nutrition-buffs/",
  "modCreatedTime": "2022-03-24T17:43:14+00:00",
  "modLastUpdatedTime": "2022-06-01T21:35:58+00:00",
  "modName": "Nutrition Buffs",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2022/03/7-days-to-die-nutrition-buffs-additional-screenshot.jpg"
  ],
  "modShortDescription": "This mod adds several new nutrition metrics in addition to your general hunger bar: protein, carbs, and fruits & veggies.",
  "modDescription": "**Note:** This is my first mod; use at your own risk!\n\n## Purpose\n\nSo, what problem are we trying to solve?\n\nFood management does not evolve as levels increase; instead it mostly disappears into the background. Similarly, farming requires only one or two real crops to keep you topped up at max cooking; finding new seeds or crops is not exciting, and meat begins to overflow storage boxes.\n\nThis mod is aimed at incentivizing variety in food intake, and thus making variety in farming valuable while also putting some pressure on increased meat usage, primarily through providing buffs for a diverse diet. Also works as a ‘dump’ for excess food.\n\n## Description\n\nThis mod adds several new nutrition metrics in addition to your general hunger bar: protein, carbs, and fruits & veggies. These nutrition metrics degrade over a several day period and are replenished by specific foods (eat meat based foods to restore protein, for example). Allowing these metrics to go too low will result in a slight debuff, while keeping them high provides buffs.\n\nMetrics are designed to degrade slowly so you don’t need to carry many stacks of food with you; just switch up your food each day and you’ll stay ‘in the green’ for most of your play periods. But you’ll still need to focus stack foods to get the top level buffs for blood moons or other important outings.\n\nThe idea of this mod is to transform the food system in late-game so it’s still interesting and relevant. Right now once you get seeds for one or two of the best foods you’re done; just grow and eat the same thing all the time; the other 50+ foods available may as well not exist. This gives them a reason to exist, and makes farming and cooking more interesting, and finding new seeds more exciting.\n\n## Details\n\nSpoiler warning! Read this section only if you don’t want to explore and figure it out yourself.\n\nAll nutrient levels start at 70 and degrade by approximately 2.5 per minute (or 150 per day assuming a 60 minute game-day). Degradation slows to 25% normal when under 100 of a given nutrient, and speeds up to 400% normal when over 800\\. Max is 1000.\n\nNutrients are gained by eating foods. Early game foods will provide around 20 nutrients total, while late game [foods](https://7daystodiemods.com/tag/7-days-to-die-food/) provide around 100\\. Nutrients provided are based on the food eaten. Any excess that would push a nutrient level over 1000 is lost.\n\n### Debuffs\n\nMalnourishment – Occurs when any two nutrients are under 50\\. Stamina regen is decreased by 5%. Avoidable early game when both meat and cornbread are available together; two of each a day will keep malnourishment away!\n\n### Buffs\n\n* Healthy – Occurs when all three nutrients are above 500\\. Stamina regen is increased by 10%, and health and stamina max is increased by 5\\. Should be maintained relatively easily when mid-game recipes are available and you’re producing several different kinds of food.\n* Very Healthy – Occurs when all three nutrients are above 900\\. Gain an additional 3 stamina and health max compared to “healthy”, and effectiveness of healing is increased by 25%. Only practical for short periods, like blood moons for instance, due to increased nutrient degradation above 800.\n* Ripped – Occurs when protein level is above 900\\. Damage from all sources to all targets, including blocks, is increased by 20%.\n* Energetic – Occurs when carbs level is above 900\\. Run speed, reload speed, and attack speed are all increased by 20%.\n* Quick Thinking – Occurs when fruits and vegetables level is above 900\\. Experience gain and damage resist are increased by 20%.\n\n## Realism\n\nAs much as possible I’ve tried to make foods give realistic nutrients to keep the mod intuitive. However, a few major deviations needed made to best accomplish the gameplay goal of the mod. I am aware that nutrient intake doesn’t exactly match what we would expect in real life and welcome thoughts. But please bear in mind that gameplay takes precedence over realism in this context.\n\n## Compatibility\n\nThis mod was written to be compatible with A20\\. It may or may not work with other versions.\n\nThis mod was designed for new games, but preliminary testing indicated it may work for existing games. As always, fully backup your game before attempting to add any mod!\n\nI cannot guarantee compatibility with any other mod, but I suspect this one will be compatible with most others. Mods that add foods will not be ‘compatible’ in that they won’t provide any nutrients, other than the exceptions below. Mods that alter the player display window will probably be okay, but could cause some incompatibility making nutrient levels unavailable for viewing.\n\nThis mod will add nutrition values to foods from several other mods, but only if it is loaded after those mods (it’s folder name is alphabetically after the others). Currently, these other mods are supported:\n\n* [Oakraven chicken coops](https://7daystodiemods.com/oakraven-forest-collection/)\n* [Oakraven hydroponic farming](https://7daystodiemods.com/oakraven-forest-collection/)\n* [JaxTeller718’s Nuts and Berries](https://7daystodiemods.com/nuts-and-berries/)\n* [Telric’s fishing](https://7daystodiemods.com/telrics-fishing/)\n\n**[Download](https://www.dropbox.com/s/wnlppi3wlo9xemc/AesirkinNutritionBuffs.zip?dl=1)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/28214-nutrition-buffs/).\n\n**Credits:** [Aesirkin](https://7daystodiemods.com/tag/aesirkin/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://www.dropbox.com/s/wnlppi3wlo9xemc/AesirkinNutritionBuffs.zip?dl=1",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/28214-nutrition-buffs/",
  "modAuthors": [
    "Aesirkin"
  ],
  "modTags": [
    "7 days to die drinks",
    "7 days to die food",
    "7 days to die stamina",
    "Aesirkin"
  ]
}