{
  "modURL": "https://7daystodiemods.com/oaks-pet-animals-and-guards/",
  "modCreatedTime": "2022-01-10T09:51:00+00:00",
  "modLastUpdatedTime": "2022-02-23T18:12:21+00:00",
  "modName": "Oak's Pet Animals and Guards",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-oaks-pet-animals-and-guards-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-oaks-pet-animals-and-guards-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-oaks-pet-animals-and-guards-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-oaks-pet-animals-and-guards-additional-screenshot-4.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-oaks-pet-animals-and-guards-additional-screenshot-5.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-oaks-pet-animals-and-guards-additional-screenshot-6.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-oaks-pet-animals-and-guards-additional-screenshot-7.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-oaks-pet-animals-and-guards-additional-screenshot-8.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-oaks-pet-animals-and-guards-additional-screenshot-9.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/01/7-days-to-die-oaks-pet-animals-and-guards-changelog-screenshot-1a.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/01/7-days-to-die-oaks-pet-animals-and-guards-changelog-screenshot-2a.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/01/7-days-to-die-oaks-pet-animals-and-guards-changelog-screenshot-3a.jpg"
  ],
  "modShortDescription": "Here is a quality of life 'server side only' mod called 'Oak's Pet Animals and Guards' by Oakraven with kind assistance from Dayhawk Mod.",
  "modDescription": "Here is a quality of life ‘server side only’ mod called ‘Oak’s Pet Animals and Guards’ by Oakraven with kind assistance from Dayhawk Mod.\n\nThank you also to Dre for giving it a good run through to check for functionality and potential issues.\n\n**Update for A20:** The Farm Jeep is no longer viable because it is a scaled down version of a jeep, and when a player enters the vehicle they are permanently scaled down by the same amount (40% of original). This is cumulative for each and every time the player enters the vehicle. Again, the developer will reintroduce the Farm Jeep at the first opportunity.\n\nThis mod provides:\n\n**1) 9 Pet Animals** – These include Boar, Rabbit, Stag, Chicken, Pig, mini Bear, Wolf, Coyote, and Doe. (These animals show no fear when approached and will stay within their confines. It is strongly recommended to always have 3 blocks above the highest perimeter point because the animals can climb up onto objects and each other and will be over the wall before you can notice.)\n\n7 are purchasable from the Trader’s with a starting base price of 800 or found in plane supply drop crates and use the Quest system to switch to a place-able animal. These include Boar, Stag, Pig, mini Bear, Wolf, Coyote, and Doe. 2 are only found by using a Coop for the chickens or a Trap for the rabbits. The rabbit trap will also provide a small amount of seeds on the principle that they will be trapped in rabbit paws and fur.\n\n**2) 5 Animal Guards** – Guard Hell Bear, Guard Hell Boar, Guard Hell Wolf, Guard Hell Lion, and Guard Rabbit. All 5 are purchasable from the Traders with a starting base price of 800\\. They can also be found in Air Supply Drops.\n\n**3) 12 Human Guards** – All 8 can be found in Air Supply Drops.\n\n**4)** Mushroom Planter that requires Mushroom Mycelium to begin the fruiting process.\n\n## Pet Animals\n\n### Purchasing and Supply Drops\n\nVisit the trader and check the [traps](https://7daystodiemods.com/tag/7-days-to-die-traps/) and tools section. On this occasion the trader was very generous with offerings and the animal icons have a description of what animal is being offered. The pet [animals](https://7daystodiemods.com/tag/7-days-to-die-animals/) have been integrated into a default group and on some occasions you will get a lot of choice and on other occasions nothing. The base price of 800 has been lowered to reflect skill and buffs.\n\nHere is how Arramus place a Pet Boar he purchased at a later time using the Quest feature. First, perform a ‘Read’. Accept to Release the Pet Boar for Placement. A Quest Started prompt will appear and it will automatically be completed. Check you inventory for a ‘dog house’ icon and the name of the animal available. Place the animal on ground just as you would a vehicle and stand back. Incorporating a feature found in the Dayhawk Mod (thank you), a tile will appear on the ground which in turn will spawn the animal placed.\n\nIf the animal drops onto the tile, the tile will break and a cobweb will appear to finalise the process. If the animal doesn’t drop onto the tile, you can always walk on it and it will break. There are occasions where you may get lucky and a second animal will spawn. You may also get unlucky and nothing spawns; however this is incredibly rare and based on what they have experienced so far, blanks are less than 1 in 50, whereas doubles, and even triples on one occasion occur 1 in 10\\. He expect this depends on netcoding, latency, or any other factor relating to server processes.\n\nYou can either harvest the animal for meat and other resources, or simply allow it to have a sedate life of roaming.\n\nPet animals have been integrated into default supply drop settings and will be chosen from a select list of supply drop groups.\n\nUpon finding a Supply Drop Crate, you may get lucky and find a pet animal.\n\nThere are also 2 Pet Animals that cannot be purchased or found. These include the Pet Chicken and the Pet Rabbit. oakraven introduces a method using default features in a novel way as follows:\n\n**a)** Construct a Rabbit Cage Trap or Chicken Coop and place them. The Chicken Coops can be placed next to each other but the Rabbit Traps need some spacing.\n\n**b)** Make some Chicken Feed and Rabbit Feed in your campfire and take them to your Chicken Coop and Rabbit Trap respectively.\n\nIn this case, right mouse click and it will change the Chicken Coop status.\n\nOnce receiving Chicken Feed the Chicken Coop moves to its Nesting Stage.\n\nAnd finally it is time to harvest. We can always receive feathers and eggs and regularly receive Pet Chickens.\n\nPet Chickens are placed exactly the same as other Pet Animals.\n\nThe chickens are prone to resting on ledges above the ground and your imagination can take that wherever you want it to.\n\nPet Rabbits follow the same system beyond the reward and housing.\n\nMake some Rabbit Feed. Take it to your Rabbit Trap and right click. The Rabbit Cage Trap is Baited and Set.\n\nHere’s one they trapped earlier.\n\nActivate and Release as with other animals. And should you ever lose your pets and have the skill in place, crouch.\n\n## Guard Animals\n\n### Purchasing\n\nJust as with the Pet Animals, the Traders will stock Guard Animals. The Guard Animals can be purchased for the same price and placed exactly the same as Pet Animals using the quest system. The Guard Animals will remain passive in the spot you place them until a Zombie gets to close. The guard animals can be used to protect your Pet Animals, general base protection, or even during a Blood Moon event.\n\nAn unwelcome guest. 2 Animals Guards; Guard Hell Wolf and Guard Rabbit are released using the tile placement system and very quickly recognise the threat. After opening the shutter, the zombies attempt to enter the farm compound and are met by the Guard Animals. Arramus got lucky on this occasion and 2 Hell Wolves spawned from a single tile.\n\nThe skirmish ensues. One of the Hell Wolves was overcome and is ready to be harvested. The Guard Animals that survived will see their health restored.\n\nThe Guard Animals also fare well during a Blood Moon event. Four Guard Animals remained until first light. Players will receive no XP for Guard Animal kills.\n\nThere are 4 additional human Guards that are currently being tweaked for a future build. There was an issue with the Trader compound causing NRE for certain classes and that needs to be tweaked to ensure they function well with the few classes that are compatible.\n\n## Vehicle (Current Unavailable)\n\n### Farm Jeep\n\nThe farm jeep is your [tractor](https://7daystodiemods.com/tag/7-days-to-die-vehicles/). It is pretty slow but will get you from A to B without running down your stamina. It fits the concept and can be constructed on the Workbench with less resource demand than a regular vehicle due to its limited functionality. It’s just a bit of fun. And is scaled to match pathways. Carries 2 players…\n\nThere will undoubtedly be updates in time, but this is a fully functional ‘[farming](https://7daystodiemods.com/tag/7-days-to-die-farming/)‘ mod and may serve you well as a break from looting, questing, and skirmishing.\n\n**Note:** These Pet Animals and Guards will not be hurt by Electric Turrets. However, just as the Junk Turret will attack regular animals, it will also attack your Pet Animals. Please do not place a Junk Turret within attack range of your Pet Animals and Guards unless you purposely want to eliminate them.\n\n## Changelog\n\nHere is an update to fix an issue as well as introduce a new spawning decoration for the Turret Guards.\n\nChanges are as follows:\n\n**1.** RoronoaDroagon kindly reported an issue with the new spawning feature for the 4 new guards. This appears to be something that changed from A19 to A20 and didn’t function as hoped. The new guards have been added to the older system which proved reliable, beyond the plates occasionally not being destroyed on uneven terrain. It appears we will have to live with that since other destructive methods can cause issues.\n\n**2.** All turret guards have been given a new texture for their spawn pad that matches the newer version. Just a cosmetic change.\n\n**3.** All Turret Guards see a Quest Marker drop through their body and sink to through the ground as they spawn. This reflects their quest completion status.\n\n**4.** The ‘killall’ Admin command used to kill all of the Turret Guards.\n\nThey are now protected from harm when a server admin needs to troubleshoot zombie issues but keep their Turret Guards safe.\n\nAs the blocks for the Turret Guards changed back to the older format, it is not recommended to change to the new upload unless you start a new World.\n\nIf you do decide to update without starting a new World, expect some of the new Guards to potentially change into other objects; especially Darkstardragon (Turret Guard 09) as this character required a slight name change in one part of the code.\n\n## Installation\n\nIf you’ve never installed a mod before it is necessary to create a mod folder in the main directory or in an area suggested by your server host if they have modified the installation. Simply make a new folder called **Mods** (with a capital **M** to reflect standard nomenclature). If you drag the mod folder directly out of the zipped file it can be placed directly into the **Mods** folder and the game will look in there as you launch your World. If you allow your unzip function to extract the folder, it may make another unnecessary folder and place the mod inside it. This will not be recognised by the game/server if you place it in the **Mods** folder like this. Please take it out of the extra folder level. The top layer will be a single folder and in the second layer you will see a **ModInfo.xml** file with or without additional folders depending on the mod. This will become elementary once you’ve launched a few mods.\n\nThe magic of this mod is that is only needs to be installed in the server/person who has launched the main environment that others join. It is a technical work of art. Enjoy.\n\n**[Download](https://github.com/arramus/Oaks-Pet-Animals-and-Guards-A20-2022Jan10/archive/refs/heads/main.zip)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/22947-oaks-pet-animals-guards-and-farm-jeep/).\n\n**Credits:** [Arramus](https://7daystodiemods.com/tag/arramus/), Oakraven, Dayhawk, Dre",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/arramus/Oaks-Pet-Animals-and-Guards-A20-2022Jan10/archive/refs/heads/main.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/22947-oaks-pet-animals-guards-and-farm-jeep/",
  "modAuthors": [
    "Arramus",
    "Oakraven",
    "Dayhawk",
    "Dre"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die farming",
    "7 days to die traps",
    "7 days to die vehicles",
    "Arramus"
  ]
}