{
  "modURL": "https://7daystodiemods.com/rework-repair-and-learn-weapons-tools-and-armors/",
  "modCreatedTime": "2021-06-19T14:26:00+00:00",
  "modLastUpdatedTime": "2021-06-19T14:28:25+00:00",
  "modName": "Rework Repair and Learn Weapons, Tools and Armors",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-rework-repair-and-learn-weapons-tools-and-armors-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-rework-repair-and-learn-weapons-tools-and-armors-additional-screenshot-2.jpg"
  ],
  "modShortDescription": "Survager has to you big update for his first mod \"Rework Repair Weapons\".",
  "modDescription": "Survager has to you big update for his first mod “[Rework Repair Weapons](https://7daystodiemods.com/weapons-repair-mod/)“.\n\n1. He is very confused that the details of weapons and tools are now used only to create these things.\n\nNow you will need these items to repair [weapons](https://7daystodiemods.com/tag/7-days-to-die-weapons/) and tools!\n\n1. He was also confused by the fact that a character could magically learn how to create complex weapons and tools simply by purchasing a skill level.\n\nNow, in order to learn how to make weapons or [tools](https://7daystodiemods.com/tag/7-days-to-die-tools/), you will have to find these items and study them!\n\nIn addition, in order to create weapons and tools of a higher level, you will also have to learn this by further studying these items.\n\nNow, by purchasing skills, you will not be able to learn how to make complex weapons or complex tools. The rest of the skills remain the same.\n\n1. It also bothers him that a simple repair kit is used to repair complex things, such as machine guns, a drill and a chainsaw.\n\nThe uselessness of parts of weapons and tools is especially visible at the end of the game, when we already have top-end items.\n\nHe decided to change this a bit.\n\nNow, to repair weapons and complex tools, you need not a simple repair kit, but parts of these items.\n\n1. Leather Armor, Rag [Armor](https://7daystodiemods.com/tag/7-days-to-die-armor-mods/) and Military Armor can no longer be repaired using repair kits. This will require the appropriate materials.\n\n## List of Changes\n\n* To repair complex weapons, you need the parts of this weapon.\n* Repairing complex tools requires the parts of these tools.\n* Repairing rag armor requires duct tape.\n* Repairing Leather Armor requires leather.\n* Depending on the quality of the item, repairs will require a different amount of resources.\n* The number of weapon parts and tools in the loot has been increased.\n* Increased the number of weapon and tool parts in yellow bags dropped from zombies\n* By purchasing skill levels, you cannot learn how to make complex weapons and tools, or improve the quality of the items being created.\n* In order to learn how to make some kind of complex weapon or tool, or learn how to make this item of better quality, you will need to study this factory item at the workbench. To do this, you need the item itself, the details of the item, paper and adhesive tape.\n* Auto Turrets and Shotgun Turrets can only be explored using a schematic.\n* Old weapon and tool schematics have been removed from loot and sale.\n* Added new books to study items and improve the quality of items crafted.\n* Added factory weapon and tool variants to the game. Such items can be used until they break, but they cannot be repaired. Such items you can either be sold very cheaply or broken for parts.\n* Factory quality items have more mod slots and reduced durability consumption when used.\n* As a reward for the quest, the player can receive factory-quality items.\n* Only the first level schematics of complex weapons and tools can be bought from the merchant. To learn how to make weapons and tools of a higher level, you must study these subjects and create new schemes.\n\n## Changelog\n\n**v2.0**\n\n* All broken weapons and tools are now considered as factory\n* Factory weapons and tools cannot be repaired.\n* Factory weapons and tools have more modification slots and less durability when used.\n* Factory weapons and tools are much more expensive than regular items.\n* Factory weapons and tools can be researched to learn how to create ordinary items of this type at a higher level\n* You can no longer increase the level of crafting common items by studying simple items. This will require factory items.\n* When scrapping factory items, the player gets several times more parts.\n* Removed names and descriptions of broken items from localization.\n* Added names and descriptions of factory items to localization.\n\n**v1.5**\n\n* Added a Drafting Table (Survager had to take this step, as the schemes cluttered the list of recipes in the workbench.) For the Drawing Table model, MANY THANKS to a good person with the nickname iDizor.\n* At merchants and at locations, in places where a workbench used to come across, it will now sometimes be possible to meet a Drawing Table.\n* The Drafting Table scheme can be purchased from a merchant, found in loot, or in broken workbenches.\n* Added description for Drafting Table in recipe list and notes\n* All recipes for weapon and tool schemes have been moved to the Drafting Table\n* Changed some recipes for weapon and tool schemes. Now, in order to create a scheme for the next tier, either the scheme of the sixth level of the previous tier or the subject being studied is required. Example: Tier 1 revolver schematic now has two recipes. The first recipe uses a level 6 pistol scheme, while the second recipe requires a revolver.\n* Increased the number of weapon parts and tools in loot\n* Increased the chance of loot parts of weapons and tools\n* Fixed English localization\n* Reduced the quality of weapons and tools that will be found in loot or in the merchant’s sale. Tier 1 items – maximum quality 3\\. Tier 2 items – maximum quality 2\\. Tier 3 items – maximum quality 1.\n\n**v1.4**\n\n* Fixed the wrong level scheme was used to create a pistol scheme\n* Reduced the number of parts that are required to study the subject\n* To create a higher rank weapon / tool schema, a level 6 weapon / tool schema of the previous rank is required. Now, to study the top weapons, you will need to fully study the simple weapons.\n\n**v1.3**\n\n* Removed the increase in the crafting level of rocket launchers, now you can improve the quality of the created rectometers only with the help of special books.\n* Fixed english localization.\n\n## Warning\n\nThis can greatly change your approach to survival.\n\nYou will think about whether to sell this rifle or better to break it.\n\nIs it worth it to use a drill / chainsaw now, or is it better to use an ax / pickaxe, since there are no parts for repair.\n\nIt may happen that your favorite weapon becomes unusable, and even the dealer simply does not have repair parts. In this case, you will have to buy expensive weapons or tools from the merchant in order to break them in order to receive parts for repair or to learn this items.\n\nTo compensate for the complexity of the repair, the degradation of the changed items is reduced by 2 times.\n\nSince complex weapons and tools require parts from these items to learn, the number of parts in the loot has been slightly increased.\n\n**[Download](https://drive.google.com/drive/folders/1au0xYF0z1ag22Iewl-ZHPxRkgeJokui1?usp=sharing)**\n\nYour’s “Big Thanks” please send him here: [Patreon](https://www.patreon.com/survager) or [Streamlabs](https://streamlabs.com/survager1/tip)\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/22513-rework-repair-and-learn-weapons-tools-and-armors-a19-by-survager/).\n\n**Credits:** [Survager](https://7daystodiemods.com/tag/survager/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/drive/folders/1au0xYF0z1ag22Iewl-ZHPxRkgeJokui1?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/22513-rework-repair-and-learn-weapons-tools-and-armors-a19-by-survager/",
  "modAuthors": [
    "Survager"
  ],
  "modTags": [
    "7 days to die armor mods",
    "7 days to die tools",
    "7 days to die weapons",
    "Survager"
  ]
}