{
  "modURL": "https://7daystodiemods.com/robelotos-custom-zombies/",
  "modCreatedTime": "2022-02-22T12:54:00+00:00",
  "modLastUpdatedTime": "2022-02-22T12:55:33+00:00",
  "modName": "Robeloto's Custom Zombies",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-robelotos-custom-zombies-additional-screenshot.jpg"
  ],
  "modShortDescription": "This mod adds 53 new zombies to the game. Giant, Fire Boss, Gunner, Anesthesia, Burning Man, MoePuker, Atrocity, Shadow, Fire Elf and more.",
  "modDescription": "If you are looking for a realistic mod you may have come to the wrong place, but if you are looking for some variation in the game involving some nice action with new zombies and with increased difficulty you happen to be just in the right thread.\n\nThis mod adds 53 new [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) to the game. + 3 zombies from Snufkins mod: Archon, Geist and Scarecrow. There are a total of 36 zombies and 17 animals. The full version uses custom sounds. Then Robeloto also has a server side (pure xml version).\n\n* Sightrange on default zombies is 100.\n* Handreach on default zombies is decreased from 1.65 to 1.60.\n* Every fat zombie have now a chance to break your arm.\n* Beaker is a bit easier to find.\n* PhysicalDamageResist on Biker, Demolition, Soldier and Worker nerfed just a bit. (Radiated ones was as strong than his custom zombies with PDR unchanged).\n* Screamers have a chance of only 27% to spawn another screamer. (made to prevent infinite screaming loops)\n* Robeloto lowered the volume on all explosions that had too high volume. Molotov explosions is changed to match Burning mans puke.\n* More experience from Bears.\n* His custom flies does not have a wingflap sound.\n* Spider zombies jumps higher.\n* Custom quests – 4 custom quest at the moment. Plan to add more.\n* Custom [armors](https://7daystodiemods.com/tag/7-days-to-die-armor-mods/) – Magic Plate Armor and Steel boots of haste.\n\n## Small Warning\n\n* **Spectre:** Now uses a material that can be seen if you atleast have Reflection quality to Low. If it is off, it is much harder to see him and now how he is supposed to look.\n* **Shadow:** Can only be seen if Shadow distance is atleast set to Low. If this is off he will be completely invisible.\n\n## Zombie Names & Info\n\n### 01\\. Anesthesia\n\nNeed some anesthesia? This nurse will drug you, and do some horrifying things to you.\n\n### 02\\. Atrocity\n\nThe leader of all zombies? She is bigger than the vanilla one and will make you stunned when she screams.\n\n### 03\\. AquaZed\n\nA type of waterzombie that pukes water on you. Does not hurt much, and if you are on fire, this vomit will extinguish the fire.\n\n### 04\\. Blazing Man\n\nBurning mans big brother. His fire puke explosions are beautiful, but far from harmless.\n\n### 05\\. Burning Man\n\nA roaming zombie that has evolved from the vanilla burnt zombie. He will puke small breaths of fire.\n\n### 06\\. Candygirl\n\nShe will make you slow. Watch out for her candy canes. They have been applied with poison. Your body will react in slowmotion.\n\n### 07\\. Chroma\n\nA jumpy fast zombie that can buff your sight with strange coloring.\n\n### 08\\. Cold\n\nHis vomit can freeze you instantly making you unable to move.\n\n### 09\\. Exploder\n\nA zombie with a timed charge on his chest. He also have one dynamite in each of his hands. He will explode after you have damaged him or he has damaged you.\n\n### 10\\. Fatigue\n\nShe doesn’t damage you much, but she drains your stamina. Watch out, she is fast.\n\n### 11\\. Fat Puker\n\nMoepukers big bro. Bigger and more dangerous.\n\n### 12\\. Fire Boss\n\nTime for some cheesy lines. You are under arre… ehm, probably dead if you let him flame you. No Miranda warning here. This is a huge fire zombie that can destroy anything with his breath. This zombie has pretty high blockdamage, so do not lure him to your base.\n\n### 13\\. Fire Elf\n\nA zombie Elf that shoots flaming arrows from his mouth. Yes, you read that right.\n\n### 14\\. Freeza\n\nHarder version of the Cold zombie. Bigger and colder.\n\n### 15\\. Giant\n\nA giant zombie that can kill you and your base in one hit. Do not try to fight this guy before you have some good gear.\n\n### 16\\. Gunner\n\nOne of the strongest. Looks like a zombie made of metal and he will shoot you with several bullets. He can break your arm and also stun you.\n\n### 17\\. Ironman\n\nA zombie with iron skin. Low HP, but will generate health quite rapidly. Kill him fast.\n\n### 18\\. Mini\n\nA small one, but fast. High infection chance.\n\n### 19\\. MiniMummy\n\nA miniversion of Mummy, lighter voice, lighter attacks.\n\n### 20\\. MoePuker\n\nHe seems to have turd all over his body. He stinks and he pukes. Evolved from a normal Moe. Also exist a Feral version of this one, same skin.\n\n### 21\\. Mummy\n\nA slow guy, but can take several hits before he goes down. He can also break your precious arm.\n\n### 22\\. Mutated Giant\n\nStronger version of Giant. Bigger and has different sound. Only show up at gamestage 3000+.\n\n### 23\\. Pale\n\nJust a white zombie that have a chance to blur your sight.\n\n### 24\\. Predator\n\nFast cloaking zombie that can hurt you in some different ways.\n\n### 25\\. Robot\n\nA miniversion of the RadRobot, lighter attacks. Different sounds from the RadRobot.\n\n### 26\\. Rad Robot\n\nA robot that shoot fast rad bulbs.\n\n### 27\\. RPG\n\nBig bearded zombie with a rocket launcher on his shoulder. Of course he fires rockets.\n\n### 28\\. Running Man\n\nA fast zombie that can manipulate the engine of vehicles. If you are close to him, his scream will make your vehicle make a sudden stop. Beware!\n\n### 29\\. Shadow\n\nDuring the day he is almost invisible. But during the night if you have a flashlight you will see him. This zombie can blind you and he has learned to mimic familiar sounds from before the apocalypse.\n\n### 30\\. Sanguis\n\nThis zombie behaves like a spider zombie, but slightly faster and will puke some strange blood on you. When this zombie is near you will bleed even if you do not get hit by her puke. She has a chance to infect you if you get hit. Then she will drain all your stamina and possibly give you pneumonia.\n\n### 31\\. Shocker\n\nThis “dude” pukes electric bolts from his mouth. Try not to become shocked! Even his hands will electrify you until you are burnt crisp.\n\n### 32\\. Shocker Feral\n\nThe feral version of shocker with a new cool skin!\n\n### 33\\. Spark\n\nMiniversion of shocker, different puke, almost harmless in comparison to his big brother.\n\n### 34\\. Spectre\n\nA silent almost invisible zombie with some spooky whispers.\n\n### 35\\. Translucent\n\nMaybe the fastest zombie. He can run as fast as a minibike. If you are on foot, try to kill him instead, cause you cannot outrun this creature.\n\n### 36\\. The Flying Plague\n\nA flying zombie demon that can shock you and make you go blind. Watch out for this bad boy. Has custom sounds.\n\n### 37\\. Anaconda\n\nVery fast and large [snake](https://7daystodiemods.com/tag/7-days-to-die-animals/). You should really run, because the damage from this lady is critical. Keep distance.\n\n### 38\\. Burning Phoenix\n\nThis one is burning and he also spit fire.\n\n### 39\\. Chicken Demon\n\nFast and will agressively hunt you down if you are within her area. High chance to infect you.\n\n### 40\\. Chicken Fire\n\nThis chicken is on fire and can lit you up!\n\n### 41\\. Copter Corpse\n\nA corpse that is flying a gyrocopter and is shooting with a minigun.\n\n### 42\\. Diamond Phoenix\n\nThis is a big electric thunderbird that can shock you. Spits shock particles.\n\n### 43\\. Electric Fly\n\nA shocking glowing fly. This fly can shock you!\n\n### 44\\. Firefly\n\nThis fly is on fire. Watch out.\n\n### 45\\. Fly\n\nFast irritating. Can infect you. Has really low HP.\n\n### 46\\. Frosty Ball\n\nA white flying orb that spits snowballs. Watch out, he can freeze you!\n\n### 47\\. Ghastly Phoenix\n\nAn translucent bird that spits smoke.\n\n### 48\\. Hell Kuma\n\nA fire bear.\n\n### 49\\. Fire Snake\n\nA smaller version of anaconda, but this one will burn you up.\n\n### 50\\. Kub Kuma\n\nA cute baby bear. Do not try to hug this one!\n\n### 51\\. Hybrid Panther\n\nA large black panther.\n\n### 52\\. Kaboom Phoenix\n\nYou thought the radiated vultures were dangerous? Well, this bird makes them fade in comparison and it spits ROCKETS! If you happen to see one. Just run.\n\n### 53\\. Thunder Kuma\n\nAn electric bear.\n\n## Spawning\n\nThe most dangerous zombies are removed from sleeper, scout and feralhordes during the first days and up to gamestage 100+.\n\n## Custom Sounds\n\n* Anesthesia vomit\n* Anaconda\n* Atrocity\n* Fire breaths\n* Fly\n* Freezer vomit\n* Giant\n* Giant Mutated\n* Gunner\n* Moepuker vomit\n* Mini\n* Mummy\n* Mutated Giant\n* RadRobot\n* RPG\n* Sanguis vomit\n* Shadow (many sounds and can also mimic a screamer)\n* Shocker vomit\n* The Flying Plague\n* ThunderKuma\n\n## Items\n\nAmoxillin, cures you completely from the new custom zombie buffs, new schematics and resources that are added to the lootgroup. Amoxillin is under the yeahScience perk so you can learn to craft this.\n\n## Quests\n\nRobeloto has added [quests](https://7daystodiemods.com/tag/7-days-to-die-quests/) in the mod. At the moment there are only 2 quest, but more will be added. They can be looted as any other challenge quests.\n\n## Other Changes\n\n1. Every fat zombie have now a chance to break your arm.\n2. He lowered the volume on all explosions that had too high volume compared to everything else. Molotovs explosion is changed to match Burning mans puke.\n3. More experience from Bears.\n4. His custom flies does not have a wing flap sound.\n5. No more looping sounds after you killed a fire puking zombie or a shocker!\n6. PhysicalDamageResist on Biker, Demolition, Soldier and Worker nerfed just a bit. (Radiated ones was as strong than his custom zombies with PDR unchanged.\n7. Screamers have a chance of only 27% to spawn another screamer. (made to prevent infinite screaming loops)\n8. Spider zombies jumps higher.\n9. Handreach on default zombies is decreased from 1.65 to 1.60.\n10. Beaker is a bit easier to find.\n11. Sightrange on default zombies is 100.\n\n## Custom Prefabs\n\nHe will probably add this in a near future. He has tried it and it is fun.\n\n## Buffs\n\n### Anesthesia\n\nThe zombie with the same name as this buff will drug you. Your screen will become wavy and you will have a hard time moving during this effect. Amocillin will cure this.\n\n### Atrocity\n\nHer scream will make you immovable for a short while + screen effects.\n\n### Candy\n\nThis buff will slow down your movement. Watch out for candygirl zombie!\n\n### Chroma\n\nBuff from the Chroma zombie. Your world will get weird colors and you cannot see your weapon.\n\n### Dark\n\nBuff from Shadow, you will be completely blind for 9 seconds if he hits you with his circle of lights. This can be cured with Amocillin.\n\n### Drowning\n\nThe AquaZed buff. Not too much different from the usual drowning buff, but your sight will become blurred and you will have a harder time moving around during this effect. Nothing will cure this, it will only last a couple seconds.\n\n### Ice\n\nThe freezer buff. You cannot move for about 4-5 seconds. To avoid this. Drink hot coffee or cocoa to cure.\n\n### Fatigue\n\nDrains your stamina completely.\n\n### Foggy\n\nVery blurry sight and all colors will fade away. Watch out for this creepy ghostbird that gives you this buff.\n\n### Noise\n\nIf you used ranged weapon on this zed, he will sense that and punish you.\n\n### Pale\n\nThe world will get a bit blurry by this buff.\n\n### Predator\n\nThis buff will make you bleed and be a bit immovable due to poison. Cure this with a clean first aid bandage.\n\n### Pneumonia\n\nSanguis zombie has a low chance to give you Pneumonia. It will last for 250 seconds. You will be weakened and you will also lose health during this time. Keep your health up to not die or find Amocillin.\n\n### Runningman\n\nThis zombie can stop the engine of your vehicle.\n\n### Sanguis\n\nThe Sanguis zombie buff will drain your stamina and your sight will be really bad. Amocillin will cure this.\n\n### Shocked\n\nTake a wild guess which zombie gives you this buff. You will be shocked for about 4-5 seconds. It will reset if you get shocked again.\n\n### Stunnedx\n\nThis custom buff will not be affected by your strength and perks. It will always have a chance to stun you.\n\n### Unconscious\n\nThis buff says it all right?\n\n**Overview:**\n\nAction video on all zombies! This is what they do to you!\n\n**Part 1:**\n\n**Old Part 2:**\n\n**Part 3** – Planned to do this month (January 2022) and Part 3 will likely contain all the zombies from Part 2 + the new zombies. (On hold for now)\n\n**Copter Corpse:**\n\n## Changelog\n\n**Version 2.95 (Small Update)**\n\n* Atrocitys scream is now every 48 seconds if you are 20 blocks or closer from her.\n* BurningPhoenix HP increased +123,\n* DiamondPhoenix HP increased +200 and Exp +134\n* Candy PDR increased +3\n* ChickenDemons Exp increased +200\n* FireChicken HP decreased -30\n* FireSnake Exp increased +700\n* GhastlyPhoenix HP increased +233 and Exp +556\n* KaboomPhoenix HP increased +400.\n* Mini appearance changed.\n* Sanguis HP increased by +40\n* TheFlyingPlague attacks changed. Should now attack properly and vomit properly.\n\n**Version 2.94**\n\n* XML version updated.\n* Alternate version added: Robeloto has added another harder version that will spawn medium to hard zombies/animals with a high chance in every zombie/animalgroup. Also a lot of harder zombies added to the wanderinghordes. This version is made for when you reach gamestage 150 or just want it harder right away. The only thing you need to replace is the entitygroups.xml. It is in the folder that is named CustomZombies alternate versions.\n* Burningmans buff was broken. The bleedingout buff seemed to have a buffchance of 100%. Fixed now! Also decreased firevomit buffchance.\n* Chroma HP decreased. Meleedamage decreased and buffchances decreased.\n* Fire/Electricfly buffchances decreased again. Now it is 0.1 only. Also decreased damage.\n* Fatigue buffchances increased.\n* Sanguis buffchances increased.\n* Some harder animals/zombies and bosses have now more HP and more PDR. (They were way too easy already at gamestage 100)\n* FireElf now has the walkstyle of a spider. Has also more HP. Magazine size decreased to 24.\n\n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A20_Modlets/tree/master/Robeloto_CustomZombies)** Custom Zombies  \n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A20_Modlets/tree/master/CustomZombies%20Alternate%20versions)** Alternate Versions _(Check the Readme!)_\n\nIf you appreciate Robeloto’s work and you want to show support, use this [donate link](http://paypal.me/robeloto).\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/12229-robelotos-modlets/).\n\n**Credits:** [Robeloto](https://7daystodiemods.com/tag/robeloto/)",
  "modDownloadURLs": [
    {
      "Info": "Custom Zombies",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A20_Modlets/tree/master/Robeloto_CustomZombies",
      "Version": "v19"
    },
    {
      "Info": "Alternate Versions (Check the Readme!)",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/Robeloto/7D2D_A20_Modlets/tree/master/CustomZombies%20Alternate%20versions",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/12229-robelotos-modlets/",
  "modAuthors": [
    "Robeloto"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die armor mods",
    "7 days to die quests",
    "7 days to die zombies",
    "Robeloto"
  ]
}