{
  "modURL": "https://7daystodiemods.com/scavengers-of-the-living-dead/",
  "modCreatedTime": "2021-12-21T20:58:00+00:00",
  "modLastUpdatedTime": "2021-12-21T22:22:35+00:00",
  "modName": "Scavengers of the Living Dead",
  "modImages": [],
  "modShortDescription": "JaxTeller718 has released a very very early version of Scavengers of the Living Dead for you guys to try out. Scavengers is their Romero Mod that has been in development in one form or another since A16.",
  "modDescription": "JaxTeller718 has released a very very early version of Scavengers of the Living Dead for you guys to try out. Feedback etc is more than invited as they embark on a companion mod to [Ravenhearst](https://7daystodiemods.com/ravenhearst-mod/).\n\nScavengers is their Romero Mod that has been in development in one form or another since A16\\. They have released twice, and now they are releasing on A19 before A20 so they can establish it and develop it further on A20\\. Overhauled crafting, a scavenger based play style, tons of zeds, headshots only, no blood moon and much much more either already available or planned. Come be part of the development.\n\nHere is a [link](https://forums.7daystodie.com/forum/-7-days-to-die-pc/game-modification/mods/164590-scavengers-of-the-living-dead) to their old archived thread that is locked.\n\nAnd their [old A16 thread](https://community.7daystodie.com/topic/7655-a16-scavengers-of-the-living-dead/) for their initial release that will show pics and details of what he wanted this mod to look like before all the removals post A16.\n\n## Features of Scavengers\n\n* Traditional Zombies. Walk Only, Headshot Only, No Ferals or Demos etc, no climbing or jumping, realistic damage. Danger comes in numbers.\n* Fewer resources from everything\n* Increased ingredient requirements on recipes\n* Perks are available for now but will soon be removed\n* LBD system where stats increase with tool and weapon usage not perks\n* Reduced loot\n* Wilderness style [maps](https://7daystodiemods.com/tag/7-days-to-die-maps/)\n* NO traders or quests. Taking it back to the old fashioned blood sweat and tears of finding stuff.\n* NO technology like turrets gyrocopter etc. This is not Fallout\n* Traditional farming returns. No planters\n* Increased crafting timers where they make sense\n* EVERY container can be looted. No more open and closed. Now you must go through an entire poi and search it\n* Costs of repairing and upgrading increased (soon to be replaced by special kits)\n* All items now break twice as fast.\n* Removed surface ores\n* Ore traces are back in boulders.\n* Zombies hit HARD! Infection chance increased\n* Along with that new system come a host of changes like 3 mod [slots](https://7daystodiemods.com/tag/7-days-to-die-more-slots/) ONLY, no more recipe unlocks via perks you MUST find schematics and more.\n* Workbenches and stations are no longer crated from normal parts, but from special station specific parts wrenched from the specific workstation or found in loot. These parts are used to craft the proper bench.\n* NO working benches in the world. Harvest them to build your own.\n\nScavengers of the Living Dead is first and foremost a tribute to the traditional zombie movie and ideas seen by pioneer George A. Romero and his “Dead” movies, with a dash of Walking Dead.\n\nYou wont see mutant [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/), bullet sponges or anything else you would not expect to see in that universe.\n\nWhile being a tribute to those movies it is also a venture into hardcore survival. With an emphasis on realism and struggle, you will find yourself at many a disadvantage that you need to overcome, split decisions you need to make for your future and horror around every corner and in every nook and cranny.\n\nPlease keep in mind this mod is not finished nor is it even close to it. Play at your own risk. Mechanics are undeveloped, things are not balanced fully and a lot will change over time. This is your opportunity to watch a mod like Ravenhearst take shape, and to be part of that shape.\n\n## Features\n\nSome are planned and some are not implemented yet.\n\n### Progressive Tools and Weapons\n\nEach weapon and [tool](https://7daystodiemods.com/tag/7-days-to-die-tools/) offers benefits and each tier has better stats. For example a stone axe only harvests 50 percent of wood, an iron will harvest 100 percent of wood and also give 50 percent of Oak. Same for pickaxes and tiers of ores. Each pickaxe unlocks new ores and harvests.\n\n### Perks Be Gone\n\nControversial but by the time they get to release there will be no points and no [perks](https://7daystodiemods.com/tag/7-days-to-die-perks/). You get better by doing. You learn recipes by finding, you increase stats by levelling your player. Simple as it should be.\n\n### They Are Coming to Get You Barbara\n\nZombies. Everywhere. Non stop. Modified behavior, increased sight, headshot multipliers that will have you saving every bullet and using those bats, no climbers or jumpers. Traditional and EVERYWHERE.\n\n### Complex Recipes\n\nAlmost every recipe in game has had their ingredients adjusted and increased. The idea is to struggle not to have a box full of mech parts. So you will need to scavenge and harvest often. Recipes are also more realistic. Many new resources have been added.\n\n### Learn a New Way\n\nThe opening [quest](https://7daystodiemods.com/tag/7-days-to-die-quests/) is gone. Punching damages you. You have ZERO backpack slots. Starting out has never been harder so you must play smart, react accordingly and focus on important tasks. This is a slow build and the beginning thrusts you deep into hell with no apologies.\n\n### Welcome to Traiter Joels\n\nYeah, theyre gone. Zombies ate them so.\n\n### Realistic Farming\n\nFarm plots are removed. Now you can till ground but you will need water. Zombies can also trample your [crops](https://7daystodiemods.com/tag/7-days-to-die-farming/) and destroy them! You will need a hoe to pick up your seeds, and to harvest any wild crops in the world. Any other tool and you get nothing.\n\n### Backpacks\n\nAs said you start with zero slots. There are tiers of [backpacks](https://7daystodiemods.com/tag/7-days-to-die-backpack/) you can find schematics for, clothing is also important. Shirts and pants have pockets, as do jackets and coats and they help give you space.\n\n### Mods and Tech\n\nJunk turrets are stronger than ever… HAHA just kidding, all tech like bots have been removed completely. The focus will be on [traps](https://7daystodiemods.com/tag/7-days-to-die-traps/). Mods can not be crafted you must find them in loot.\n\n### Perk Books\n\nGone.\n\n### Blood Moons\n\nThey don’t exist. Because come on. Instead settings dictate you get a small blood moon randomly every 1-4 days. These hordes are specifically balanced for this mod. No spiders or demos and they are a bit smaller but increase as time goes on. They simulate a siege on your home. This will be the main base of your challenge. Don’t be turned off by this idea. They will be balanced so you can handle them with some elbow work.\n\n### No 2 Shapes Are Alike\n\nGone are the variant blocks. All shapes and blocks must be crafted at the appropriate stations to build because this is how it was for 16 alphas and it presented a challenge to pre planning.\n\n### Quality\n\nQuality tiers are 1-6 but with a twist. Everytime you repair it drops a tier, until it breaks so no tool or [weapon](https://7daystodiemods.com/tag/7-days-to-die-weapons/) is forever. This promotes constant crafting and scavenging for supplies.\n\n### Walker Simulation\n\nWith the help of the Walker Sim, zombie behavior is now tailored to wander to POIs and sources of noise. Ignore the zombies and eventually every zombie on the map will make their way to you so thinning out the herd is a must. Gunshots etc will attract the most attention.\n\n## Changelog\n\nFixed the nulls\n\n**Updated to v5.0.4 for A20 b238**\n\n**Patch Notes**\n\n* Updated Spherecore\n* Updated Take and Replace\n* Added Active Ingredients by Redbeard\n* Fixed and Readded Quality Degradation on Repair\n* Added new headshot mod.\n* Removed ability to buy perks\n* Added Perk Books. Reading one you find gives you one level in that perk.\n* Removed all recipe unlocks from perks\n* Added Menu Images\n* Added Scomar Hud and UI\n* Added Relix Menu Options Mods\n* Removed Mutated Zombie\n* Fixed Improper Vanilla Cop Model\n* Increased Sight Range on Zombies\n* Doubled Zombie Spawns\n* Increased Zombie Respawn Days to Twice a Day\n* Added Wood Nails to Frame Shapes\n* Removed Frame Shapes from table saw\n* Fixed Nulls on Cigar\n* Fixed improper recipe craft tag on Leather\n* Increased Grass, Bird Nest and Rock spawns in biomes\n* Removed all Mods Crafting\n* Added 3 new backpack sizes\n* Trader POIs now Vulnerable to Attack\n* Removed Traders from Trader POIS\n* Added Working Microwave with 50 percent chance of giveback\n* Added bird nest destroys on loot as well as trash bags\n* Added New Opening Quest Step\n* Added Loot Container Code that Disallows Placing Items in POI Boxes\n* Added Infinite recipe ingredients code\n* Removed ability to pick up vehicles during Blood Moon\n* Remade All Unity Assets in 2020 with Linear Lighting\n\nThis mod has it’s own [Discord](https://discord.gg/XWphRtm). That is also where all discussion and updates will be found.\n\n**[Download](https://github.com/JaxTeller718/Scavengers/archive/refs/heads/main.zip)**  \nAlso available on the mod launcher!\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/25723-scavengers-of-the-living-dead/).\n\n**Credits:** [JaxTeller718](https://7daystodiemods.com/tag/jaxteller718/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/JaxTeller718/Scavengers/archive/refs/heads/main.zip",
      "Version": "v19"
    },
    {
      "Info": "Also available on the mod launcher!",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/25723-scavengers-of-the-living-dead/",
  "modAuthors": [
    "JaxTeller718"
  ],
  "modTags": [
    "7 days to die farming",
    "7 days to die loot",
    "7 days to die maps",
    "7 days to die mining",
    "7 days to die perks",
    "7 days to die quests",
    "7 days to die recipes",
    "7 days to die tools",
    "7 days to die trader",
    "7 days to die traps",
    "7 days to die weapons",
    "7 days to die zombies",
    "JaxTeller718"
  ]
}