{
  "modURL": "https://7daystodiemods.com/server-side-zombies/",
  "modCreatedTime": "2020-11-02T18:34:00+00:00",
  "modLastUpdatedTime": "2020-11-02T18:36:22+00:00",
  "modName": "Server Side Zombies",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/03/7-days-to-die-server-side-zombies-screenshot.jpg"
  ],
  "modShortDescription": "This mod adds 15 new zombies to the game, each one with a different skill and all but one with a dedicated spawn. Banshee, Bomber, Cowhead, Geist and more.",
  "modDescription": "This mod adds 15 new [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) to the game, each one with a different skill and all but one with a dedicated spawn. Most of the new creatures have large HP and give a lot of XP on each kill. A few have a fixed 100% prob of dropping Boss Loot, so feel free to modify the files to your liking.\n\nAdds a craftable “Research Camera” and “Photographic film”. Each picture of a new zombie gives you 1% extra damage to that kind. A successful picture is indicated by an audible “click” different from the regular shoot sound. The max extra damage is 25%. There is a fanfare when you complete a zombie research.\n\nIncluded is the NOBLOODMOON XML, just rename and replace the entitygroups.xml file.\n\n## The Zombies\n\n* Banshee\n* Bomber\n* Cowhead\n* Geist\n* Juggernaut\n* Mantis\n* Parasite\n* Scarecrow\n* Undertaker\n* Wendigo\n* Wrestler\n* Archon\n* Scorcher\n* Siren\n* Psycho\n\n_Recently Snukfin became friends with the admin of the server where he play, so all the mods he has created have been exclusive to their server. Now he decided to share with the community, so what he will post from now on is actually the work of many months and have been tested by several people._\n\n**Note for modders:** Take a look at the xmls, he has been exploiting many underused functions that don’t require code and may circumvent the necessity of using custom resources.\n\n## Changelog\n\nHere is an update to Snufkin’s Custom Zombies – A19 Stable.\n\nThis update considers the Parasite melee and buff. It is long overdue but was highlighted in the very first testing phase when restoring this mod for A19\\. In the A18 version of 7D2D we were able to to receive damage using a feature called HealthMaxModifierOT. This modified the players overall health by a set value ‘Over Time’. This feature was removed for A19 to coincide with the new hit features such as lacerations and buff candy.\n\nIt was essential to provide an alternative because she was only causing melee damage of 1 for every hit even though the flashing countdown red skull and countdown time may cause some initial disorientation. In essence, she was biting with blunt teeth. The restoration is as follows:\n\n**buffs.xml**\n\n```\n<passive_effect name=\"HealthMax\" operation=\"base_subtract\" value=\"15\"/>\n```\n\nThis decreases players base health by 15 after a positive melee strike.\n\n```\n<triggered_effect trigger=\"onSelfBuffStart\" action=\"ModifyCVar\" cvar=\"$parasite\" operation=\"set\" value=\"5\"/>\n```\n\nThis gives the player a 5 second countdown until health is restored to normal values after the first positive melee strike,\n\n```\n<triggered_effect trigger=\"onSelfBuffStack\" action=\"ModifyCVar\" cvar=\"$parasite\" operation=\"add\" value=\"10\"/>\n```\n\nHowever, if the second and subsequent melee attacks are positive hits while the initial 5 second counter is still active, a further 10 seconds are added to the countdown for each additional hit.\n\n**items.xml**\n\n```\n<property name=\"DamageEntity\" value=\"10\"/>\n```\n\nThis value allows the Parasite melee attack to cause 8 damage in addition to the above loss of base health.\n\nHere is an explanation for why these settings are applied for this update:\n\nThese new values offer a balance to new low level players and experience higher level players.\n\n**Low Level Players**\n\nThe first hit that reduces 15 base health to low level players is on a 5 second countdown until the value can be restored. This is a warning. A second and further positive hits increases the countdown by incremental 10 second steps. It would be wise for low level players to retreat at this point because restoring that 15 health when your base health is only between 100 to 125 on top of low natural healing and potentially limited bandages and first aid kits carries high risk of death. Furthermore, the Parasite has very strong restorative properties and the outcome is weighted towards her coming out victorious.\n\n**Higher Level Players**\n\nFor higher level players, the opposite applies as health, restorative potential, weapon strength, resources, and other factors can put the weighting towards a player victory. Even with the Parasite’s restorative powers, she can be ultimately overwhelmed. However, if a high level player is also threatened by other zombies, they may also face hits that cause more than the Parasite’s 8 damage as well as the new A19 features such as lacerations which can further decrease base health.\n\nIn summary, a low level player should play it safe or time it carefully, while a high level player can come out victorious by using careful due diligence.\n\nArramus hope you can test this update and provide feedback on how you and your server regulars are finding it.\n\nSpecial thanks to BubbaJoe for having the foresight to implement a variant to the above change but at a more sadistic level which apparently suits his regular server visitors. As always, the changes have been clearly documented to allow you to further customise to your heart’s content. Let’s see how it goes from here.\n\n**entitygroups.xml expansion for mature servers (Snufkin Party Version)**\n\nAdding to sadistic gameplay levels, here is a more challenging entitygroups.xml file that you may wish to try if your server has matured and the player base is at a high level of experience or game stage. It is called [entitygroups\\_Snufkin\\_Party.xml](https://docs.google.com/uc?export=download&id=1Pbc3rw4ZlsCErkVtKbyeV0wKfvNiWXMW). It needs to be renamed to entitygroups.xml and replace the default entitygroups.xml in the Config folder to become active.\n\nUsing this file with allow Snufkin Zombies to become the rule rather than the exception.\n\nRegular groups have seen Snufkin Zombies set to a probability of 0.8 except Wendigo at 0.5\\. This is an 80 to 500 fold increase respectively. In addition, the Demolisher will appear in the Wasteland at night. This does not mean your server will be inundated with Snufkin Zombies because the groups they belong to are competing with regular zombies to spawn and many regular zombies appear at a higher probability. In addition, there are limits on how many can spawn at once. Therefore, you will see Snufkin Zombies much more often but not in horde numbers.\n\nHowever, the Blood Moon group sees quite a change:\n\nAt present, there are a maximum of 10 Snufkin Zombies selected in the default Snufkin entitygroups.xml file for Blood Moon. GS1 to GS247 has 9 Snufkin Zombies. Archon, Undertaker, Cowhead, Parasite, Geist, Bomber, Scarecrow, Banshee, and Juggernaut. GS255 to GS4086 onwards adds Scorcher to complete the 10.\n\nThis Snufkin Party version adds all 15 characters on the premise that Blood Moon brings out absolutely everything. GS1 to GS247 has the same 9 default Snufkin Zombies in addition to the Psycho and Siren to allow lower level players a gentler start. GS255 to GS4086 onwards adds the default Scorcher along with the remaining 3 characters; Wendigo, Mantis, and Wrestler.\n\nThe lower HP or less disruptive characters receive a higher probability increase as game stage increases. The higher HP or more disruptive characters do receive a probability increase but at a more regulated pace as game stage increases. The Banshee and the Wrestler have seen particular regulation as they can be quite disruptive but will still make their presence felt.\n\nThe default version was specifically set to be conservative and reflected player comments who could find things a little challenging. The default is a wonderful introduction for low level inexperienced players.\n\nSnufkin Party moves further along the spectrum to a more upper intermediate level for experienced players while still retaining balance.\n\nThe default entitygroups.xml for Snufkin Zombies and the Snufkin Party version offer their own unique experiences and are but two of an infinite variety you can customise to match your own needs and specifications.\n\n**Alpha 19 Versions**  \n**[Download](https://github.com/arramus/Snufkin-CustomZombies-A19-Stable-2020Nov03/archive/master.zip)** Base Mod for **A19**  \n**[Download](https://github.com/arramus/Snufkin-Custom-Zombies-Research-Camera-A19-Stable-2020Oct28/archive/master.zip)** Research Camera Addon for **A19** (Needs base to work)  \n**Alpha 18 Versions**  \n**[Download](https://www.dropbox.com/sh/3jr3t4shjxyg3lr/AACyUpKQQqFv4h-Y2DlHqBR4a?dl=1)** Base Mod for **A18**  \n**[Download](https://www.dropbox.com/sh/6rzg5q1kmf180j7/AABfe5T0a8cN24ekggVjt8Wea?dl=1)** Research Camera Addon for **A18** (Needs base to work)\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/17992-snukfins-server-side-zsombies/).\n\n**Credits:** [Snukfin](https://7daystodiemods.com/tag/snufkin/), Arramus, Slawa  \n_Special Thanks:_ Robeloto",
  "modDownloadURLs": [
    {
      "Info": "Alpha 19 Versions",
      "Version": "v19"
    },
    {
      "Info": "Base Mod for A19",
      "URL": "https://github.com/arramus/Snufkin-CustomZombies-A19-Stable-2020Nov03/archive/master.zip",
      "Version": "v19"
    },
    {
      "Info": "Research Camera Addon for A19 (Needs base to work)",
      "URL": "https://github.com/arramus/Snufkin-Custom-Zombies-Research-Camera-A19-Stable-2020Oct28/archive/master.zip",
      "Version": "v19"
    },
    {
      "Info": "Alpha 18 Versions",
      "Version": "v18"
    },
    {
      "Info": "Base Mod for A18",
      "URL": "https://www.dropbox.com/sh/3jr3t4shjxyg3lr/AACyUpKQQqFv4h-Y2DlHqBR4a?dl=1",
      "Version": "v18"
    },
    {
      "Info": "Research Camera Addon for A18 (Needs base to work)",
      "URL": "https://www.dropbox.com/sh/6rzg5q1kmf180j7/AABfe5T0a8cN24ekggVjt8Wea?dl=1",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/17992-snukfins-server-side-zsombies/",
  "modAuthors": [
    "Snukfin",
    "Arramus",
    "SlawaSpecial Thanks: Robeloto"
  ],
  "modTags": [
    "7 days to die zombies",
    "Snufkin"
  ]
}