{
  "modURL": "https://7daystodiemods.com/smittylvs-armor-pack-2-police-vests/",
  "modCreatedTime": "2021-10-27T18:04:10+00:00",
  "modLastUpdatedTime": "2021-10-27T18:04:13+00:00",
  "modName": "SmittyLV's Armor Pack 2 - Police Vests",
  "modImages": [],
  "modShortDescription": "This mod adds five new police vests and a loot table that allows you to find them around the world.",
  "modDescription": "I’m sure you’re as frustrated as me with this outdated [clothing](https://7daystodiemods.com/tag/7-days-to-die-clothing/) system and their apparent desire to dumb it down to make our players feel even less like they’re unique and custom to us.\n\nI am releasing these mods to hopefully show TFP that players WANT custom characters and variations of items that they can hobble together with treasures from the wasteland, creating a truly unique character and base.\n\n**NOTE:** THESE CAN’T BE SEEN IN YOUR CHARACTER PREVIEW BECAUSE OF ENGINE LIMITATIONS BUT IT IS CERTAINLY EQUIPPED. YOU CAN SEE BY SITTING ON A MINIBIKE OR VIEWING IN THIRD PERSON BY PRESSING F5 IN DEBUG MODE. THIS IS MORE FOR MULTIPLAYER SO YOU LOOK COOL.\n\nWhat good is a zombie apocalypse if you can’t steal military and police grade equipment?\n\nThis mod adds five new police vests and a loot table that allows you to find them around the world. They can’t be crafted because that would be silly.\n\nAs with adding any clothing/[armor](https://7daystodiemods.com/tag/7-days-to-die-armor-mods/), it wont look perfect on every player as there’s a lot of variance. These vests are made for male characters so if you have a female character or you have some kind of goofy customization, it may not look right.\n\n**New vests are:**\n\n* Police Plate Carrier\n* Police Riot Armor\n* Police Tactical Armor\n* Police Second Chance Vest\n* Police SWAT Vest\n\nAs always, these assets were purchased and licensed to me, smittylv so you can’t use them in any other form except to add to your server or game for you and your community’s enjoyment.\n\nI’m hoping to add more armor and clothing options so everyone can feel like there’s more to find in the world and options to customize yourself to stand out.\n\nJoin my dedicated server with my private and experimental mods by visiting [my website](https://smittylv.com/). You can also see up-to-date blog posts as I update WIP projects and talk about the modding process as I go through it. You can also donate if you’d like to contribute to more Unity assets being brought into 7DTD.\n\n**[Download](https://drive.google.com/file/d/1XLddnFeySrjdzMF-rXXwV4AklfQn6rwN/view?usp=sharing)**\n\n**Credits:** [smittylv](https://7daystodiemods.com/tag/smittylv/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/1XLddnFeySrjdzMF-rXXwV4AklfQn6rwN/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modAuthors": [
    "smittylv"
  ],
  "modTags": [
    "7 days to die armor mods",
    "7 days to die clothing",
    "smittylv"
  ]
}