{
  "modURL": "https://7daystodiemods.com/snufkins-custom-server-side-zombies-plus/",
  "modCreatedTime": "2022-02-02T15:06:00+00:00",
  "modLastUpdatedTime": "2022-05-13T06:57:37+00:00",
  "modName": "Snufkin's Custom Server Side Zombies - PLUS",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-snufkins-custom-server-side-zombies-plus-additional-screenshot-6.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-snufkins-custom-server-side-zombies-plus-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-snufkins-custom-server-side-zombies-plus-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-snufkins-custom-server-side-zombies-plus-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-snufkins-custom-server-side-zombies-plus-additional-screenshot-4.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-snufkins-custom-server-side-zombies-plus-additional-screenshot-5.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/10/7-days-to-die-snufkins-custom-server-side-zombies-plus-additional-screenshot-7.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-snufkins-custom-server-side-zombies-plus-changelog-screenshot-12.jpg"
  ],
  "modShortDescription": "Snufkin's Custom Server Side Zombies Plus is a combination of Snufkin's Server Side Custom Zombies and additional community made zombies as an integrated 'Plus Add On'.",
  "modDescription": "Snufkin’s Custom Server Side Zombies Plus is a combination of [Snufkin’s Server Side Custom Zombies](https://7daystodiemods.com/server-side-zombies/) and additional community made zombies as an integrated ‘Plus Add On’. There are currently 38 entities (15 Snufkin and 23 Snufkin PLUS)\n\nThey attempted to run the PLUS zombies as a stand alone mod but spawning was unstable and it was better to compile them together.\n\nThe Snufkin Custom Zombies Plus contains the following entities:\n\n## All of the Well Known Snufkin’s Server Side Custom Zombies\n\n* Archon\n* Banshee\n* Bomber\n* Cowhead\n* Geist\n* Juggernaut\n* Mantis\n* Parasite\n* Psycho\n* Scarecrow\n* Scorcher\n* Siren\n* Undertaker\n* Wendigo\n* Wrestler\n\n## Plus Add on Server Side Custom Zombies\n\n* Golden Juggernaut (Snufkin base with edits by arramus – based on Tipsy Squatch Gaming/Evil Spartan’s concept and intensive testing)\n* Hammer Spammer (arramus – based on ShoudenKalferas request for White River archetypes)\n* Hell Bear (oakraven)\n* Hell Boar (oakraven)\n* Hell Flyer (oakraven – Inspired by Robeloto)\n* Hell Lion (oakraven)\n* Hell Shocker (oakraven)\n* Hell Wolf (oakraven)\n* Mittens (arramus – Lonestarcanuck request)\n* Mother Clucker (Inspired by Catman)\n* Motorhead (arramus)\n* Navezgane Slasher (arramus)\n* Oni (Blue and Red versions – arramus)\n* Paindeer (arramus – based on kdthehun’s Rudolph suggestion – Sorry about the nose and light color and lack of Santa hat. Advice needed on those)\n* Pogo (arramus)\n* Shark WFLB (arramus)\n* Snow Bear (arramus with support from oakraven to consider an appropriate texture)\n* Tipsy Pink Squatch (arramus – Tipsy Squatch Gaming)\n* Tipsy Squatch (arramus – Tipsy Squatch Gaming)\n* Wight Radiation Shower (arramus – based on, and directly using code from bdubyah’s ‘Feral Ghoul’ from [The Wasteland](https://7daystodiemods.com/the-wasteland/) mod)\n* Zombie Direwolf (oakraven and arramus)\n\nAs with the spirit of Snufkin’s original concept and suggestions to the community, there is no stopping other modders from expanding on the originals in their own direction just as they are doing here.\n\n## Customising Gameplay\n\nThe entitygroups.xml (default can be found with the Config folder along with alternative versions within the Server Admin Spawning Options folder) is the first place for Server Admin/Hosts/Players to check if you would like to customise the Snufkin Zombies PLUS experience. If you would like a challenge, the default version is for you. If you prefer a more relaxed environment, then there is a lite\\_version in the additional options folder which can be renamed and moved to replace the default. The lite\\_version has all the Snufkin Zombies PLUS characters, but at a lower probability to appear. The lighter version is appropriate for new Worlds which can create a very high density of custom zombies until more regions unlock and allow them to spread out. There is also a version for Horde Night only and no Horde Night for each type. If you run the Horde Night only version you will receive a spawning.xml error since that file will no longer see the entitygroups for regular non horde night game play. That will tell you it’s working ^^. You can delete the spawning.xml file to remove these warnings if you only want to use the Horde Night only version.\n\n### FAQ About Customising\n\n**Q.1** How exactly do I remove a zombie, such as the flying shark?\n\n**A.1** Go to the entitygroups.xml file and delete every entry which looks similar to this (note the number at the end is different in different areas and versions)\n\n```\n<entity name=\"SharkWFLB\" prob=\"0.075\"/>\n```\n\nIn the default entitygroups.xml there are currently 8 entries for the flying shark in regular day time and night time groups and removing them is a fast process.\n\nHowever, there are 322 entries in the bottom section which regulates the spawning for a Blood Moon Horde Night event. It is a lot to remove, but they are split into 7 groups where each group has an identical value. Using a tool such as Notepad++ will allow you to delete them in large batches automatically.\n\n**Q.2** I want more flying sharks to appear. How do I achieve this?\n\n**A.1** Go to the entitygroups.xml file and look for all entries similar to this:\n\n```\n<entity name=\"SharkWFLB\" prob=\"0.075\"/>\n```\n\nChange the prob=”0.075″ value to a higher value such as prob=”0.15″. Finding a value which suits your gameplay is subjective and the best value is what feels most appropriate through trial and error.\n\n## Credits\n\nThank you, as always, to Snufkin for the base, and Slawa for a wealth of support in the beginning. In addition, Dre, BubbaJoe, Catman and Ti2xGr have been adding their very own unique modifications to create an environment that suits their players; some of which they have gratefully incorporated into this Plus version.\n\n## Some of the New PLUS Entities\n\noakraven is incredibly active in the background and specializes in both stabilising existing mods and creating new mods. Here are oakraven’s land based ‘Hell group’ [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) with Archon standing among them. These new characters ustilise their wings for additional jump height and will add to the demands of defending your base. Hell Lion, Hell Boar, Hell Wolf, and Hell Bear make a formidable team and will certainly come out in force during a Blood Moon event.\n\nThis is one which arramus always wanted to bring into game play as an entity ever since he spied the concept within Snufkin’s base mod. The [Shark](https://7daystodiemods.com/tag/7-days-to-die-animals/) WFLB is a play on a ‘James Bond’ type evil villain over dramatic weapon. It flies, homes in, and then unleashes its lasers. It is not an overly powerful threat while on foot but will pick up the pace while in a vehicle as it is based on the vulture game code. It is both loved and hated to equal degrees. ^^\n\noakraven’s Hell Flyer and Hell Shocker swarming and inflicting damage. This pair shoot darts or shock bolts and have their own unique audible narration as they come into closer proximity. These will add to the airborne threats and give this PLUS version a wider balance of ground, mid level leaping, and airborne threats.\n\nMittens guarding her territory. She spits acid and is something that Lonestarcanuck requested.\n\nPaindeer taking care of its friends. The Paindeer has a flashlight attachment built into its nose which is covered by a snowball. Defintely easy to spot at night. One warning about the Paindeer; her axe also gives her protection from frontal melee attack.\n\nMotorhead, the mechanical marvel teaming up with his biker brethren. Don’t let him come knocking at your door for too long as his block damage will make him an unwelcome guest.\n\nSnufkin was keen for other modders to take advantage of the game assets to create unique server side characters with their own special skill sets. By emulating Snufkin’s approach and expanding with further features, they hope you will enjoy these additional zombies in addition to the Snufkin regulars.\n\n## Snufkin Party Pack Starter Kit\n\nAnd an optional Party Pack [Starter](https://7daystodiemods.com/tag/7-days-to-die-starting-items/) Kit to ease players back into the first few days of a new World.\n\n## Changelog\n\nHere is a small update:\n\nThis update adds ‘Hammer Spammer’. A Thor type entity who carries an electrified Hammer which can shock players. This entity was inspired by ShoudenKalferas’ plan to incorporate Dwarf characters into the [White River – Tools of Citizenship Quests](https://7daystodiemods.com/white-river-tools-of-citizenship/).\n\nHammer Spammer is a tall, and pretty fast entity, with brute power.\n\n**[Download](https://github.com/arramus/Snufkin-Custom-Zombies-Plus-A20-2022Feb02/archive/refs/heads/main.zip)** Snufkin Custom Server Side Zombies – PLUS  \n**[Download](https://github.com/arramus/A20SnufkinPartyPackStarterKit/archive/refs/heads/main.zip)** Snufkin Party Pack Starter Kit\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/22698-snufkins-custom-server-side-zombies-plus/).\n\n**Credits:** [Arramus](https://7daystodiemods.com/tag/arramus/), Snufkin, oakraven, Slawa, Dre, BubbaJoe, Catman, Ti2xGr",
  "modDownloadURLs": [
    {
      "Info": "Snufkin Custom Server Side Zombies – PLUS",
      "URL": "https://github.com/arramus/Snufkin-Custom-Zombies-Plus-A20-2022Feb02/archive/refs/heads/main.zip",
      "Version": "v19"
    },
    {
      "Info": "Snufkin Party Pack Starter Kit",
      "URL": "https://github.com/arramus/A20SnufkinPartyPackStarterKit/archive/refs/heads/main.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/22698-snufkins-custom-server-side-zombies-plus/",
  "modAuthors": [
    "Arramus",
    "Snufkin",
    "oakraven",
    "Slawa",
    "Dre",
    "BubbaJoe",
    "Catman",
    "Ti2xGr"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die starting items",
    "7 days to die zombies",
    "Arramus"
  ]
}