{
  "modURL": "https://7daystodiemods.com/snufkin-weapons-xpansion/",
  "modCreatedTime": "2022-04-02T13:16:00+00:00",
  "modLastUpdatedTime": "2022-04-02T13:18:15+00:00",
  "modName": "Snufkin Weapons Xpansion",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-snufkin-weapons-xpansion-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-snufkin-weapons-xpansion-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-snufkin-weapons-xpansion-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/11/7-days-to-die-snufkin-weapons-xpansion-additional-screenshot.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/03/7-days-to-die-snufkin-weapons-xpansion-changelog-screenshot-1c.jpg"
  ],
  "modShortDescription": "For now, here is what Snufkin Weapons Xpansion offers: Glass Baseball Bat, Metal Bollard Club, DCLXVI Zeus, Hyper Blaster, Vulcan, Rail Gun and more.",
  "modDescription": "## Background and Introduction\n\nIn April 2020 Snufkin presented us with ‘[Snufkin’s Server Side Weapons](https://7daystodiemods.com/server-side-weapons/)‘ which is brought to stability in this A19 Stable expansion version and acts as a base. The original concept was simple, incorporate customised weapons into 7D2D by utilising existing in game assets to create some unique and delightful additions to the current set of weapons. These weapons are admittedly temperamental and buggy at times, more so than their partner vehicle mod, which Snufkin warned us about. For example, it is sometimes necessary to put the weapon back in the backpack and re-add it onto the tool belt if it looks out of place. More importantly though, they are dedicated server stable and server hosts have shared very positive feedback on that.\n\nSnufkin encouraged other modders to take a look at the xmls and see how underused functions could be applied to create these customised features. This Snufkin Weapons Xpansion has taken heed of that encouragement. Snufkin is currently taking a modding sabbatical but has been very open to allow the community to support and expand on the Snufkin line of server side mods and this adds to the [Snufkin’s Community Pack Server Side Vehicles](https://7daystodiemods.com/snufkins-community-pack-server-side-vehicles/) which aims to be a community project and [Snufkin’s Server Side Custom Zombies](https://7daystodiemods.com/server-side-zombies/) which has been a community restoration and already has multiple variants which expand on the original.\n\n## Snufkin Weapons Xpansion Pack – A19 Stable\n\nThe Snufkin Weapons Xpansion has moved from testing to stable based on positive feedback after intensive testing in multiple community servers. Particular thanks to BubbaJoe and Dre who provided much feedback and in depth support in the initial release that continues to directly impact the final build. There are many other community servers out there that have provided valuable support through play testing and feedback, with this mod as standalone, or mixed with the Snufkin Zombies and Vehicles as the whole pack.\n\nRestoration and expansion has been a momentous task. Slawa and oakraven have been there from the beginning with the base mod restoration, but in this expansion Mod, oakraven has branched out from A18 base mod restoration to add additional weapons and features.\n\nThere were untold changes that needed to be implemented for the A19 Stable build and they will not be listed here. However, you can always compare the A18 build files with the A19 build if you wish to make a comparison. The A20 update version had 13 primary updates to match loot box changes (Weapons can now only be found in Gun Safes and Wall/Desk Safes) and cosmetic updates. All weapons can be made up to Level 6 and the Loot Box Add On has not be added for A20.\n\nFor now, here is what Snufkin Weapons Xpansion offers:\n\n1. Klak Attack Axe (oakraven)\n2. Glass Baseball Bat (oakraven)\n3. Star Baseball Bat (oakraven)\n4. Knife Baseball Bat (oakraven)\n5. Metal Bollard Club (oakraven)\n6. DCLXVI Zeus (oakraven)\n7. Arramus Fire (oakraven)\n8. Dre X3 (weapons – oakraven / Dre X3 Clucker Round ammo by Dre)\n9. oakraven X11 (oakraven)\n10. Black Widow (oakraven)\n11. Turret lights for the Turret Auger and Default player turrets. (oakraven, Slawa, and arramus)\n12. Mod Hats/Clothing/Friends – A variety of hats/clothing/friends that can be placed in the paint slot in appropriate armor head gear for additional buffs. Mods have received localization to explain their function and use. (oakraven)\n13. Brainsaw (arramus with complete buff coding from oakraven)\n14. Hazard Spear (arramus – requested by Kaelhazard and others)\n15. All of Snufkin’s Server Side Weapons restored to A19 Stable and update to A20 (Snufkin with restoration by oakraven and of course Slawa who gave Snufkin so much support from the outset):  \n   1. Gamma Gun  \n   2. Newcomen  \n   3. Stricky Grenade  \n   4. Hyper Blaster  \n   5. Vampire Gauntlets  \n   6. Stun Grenade  \n   7. Turret Auger  \n   8. Balrog IX  \n   9. Kronos XII  \n   10. Vulcan  \n   11. Crimson Hunter  \n   12. Savery  \n   13. PP-19 Bizon  \n   14. Polearm  \n   15. Quad Shotgun  \n   16. Rail Gun  \n   17. Thor Hammer  \n   18. Crossbow Mag\n\nThe oakraven X11 with powerful .44 Magnum rounds and an X11 propelled grenade reward on each 10th kill.\n\nThe DCLXVI Zeus – Fires plasma blasts with a mortar like release and low velocity causing electrical ‘discomfort’ upon impact. However, the fully charged blast emits a high velocity laser like beam with extreme accuracy but at the cost of setting up the shot. A weapon of precision and timing.\n\nThe Loot Box Add On is not essential for the Snufkin Weapons Xpansion Mod to run but adds an interesting complementary element that can enhance the experience. In addition, the Loot Box Add On will also increase your chances for acquiring these weapons through a ticket trading system. The Loot Box Add On will be bundled into the Snufkin Weapons Xpansion Mod folder once it has been updated.\n\n## Snufkin Weapons Xpansion Pack – Loot Box Add On – A20 Stable\n\nThis is an optional Loot Box Machine. It adds Green, Yellow, Red, and Purple Tickets, respectively Level 1 – 4, to Loot that can be Crafted into a Loot Box of the same corresponding colour. Each Loot Box contains a choice of different weapons that will be awarded with equal chance. The Green Level 1 Loot Box has lower powered weapons than the Purple Level 4 Loot Box. As such probability to find higher level tickets is lower. Players can also craft 10 tickets of 1 colour to make 1 ticket of the next corresponding level.\n\nThe A19 version will remain here for players who wish to remain on that current Stable version. It is already bundled with the A19 Loot Box Add On.\n\n## Changelog\n\nTo give bats just a little more variety the mod has been updated and they can now use the flaming mod as well. A fully modded out bat with all 6 slots and all attributes/skills is a fierce weapons.\n\n## Installation\n\nFor Players and Server Admin/Hosts who have never installed a mod before, here are some simple step by step instructions:\n\n1. If you’ve never installed a mod before, it is necessary to create a mod folder in the main directory, typically (\\\\SteamLibrary\\\\steamapps\\\\common\\\\7 Days To Die). If you have a custom install or your server host has modified the installation location, then you may have to explore.\n2. Simply make a new folder called Mods (with a capital M to reflect standard nomenclature) in your ‘7 Days To Die’ main directory folder.\n3. You can now drag the mod folder directly out of the zipped file and it can be placed directly into the Mods folder. However, there may be a top folder which you do not need. You are looking for a folder that contains a ‘ModInfo’ file. The folder holding that file will be the one you add to your Mods folder. If you add a folder above that nesting then the game will not be able to see the mod. The top layer will be a single folder and in the second layer you will see a ModInfo.xml file with or without additional folders depending on the mod. Clear instructions on this stage are not possible due to different types of unzip application and their methods. However, this will become elementary once you’ve launched a few mods.\n* Does this Mod need to be installed in the server/client host? = YES\n* Do players also need to install this Mod? = NO\n\nThe magic of this mod is that is only needs to be installed in the server/person who has launched the main environment that others join. Enjoy.\n\n**Alpha 20 Versions**  \n**[Download](https://github.com/arramus/Snufkin-Weapons-Xpansion-A20-2021December17/archive/refs/heads/main.zip)** Snufkin Weapons Xpansion for **A20**  \n**[Download](https://github.com/arramus/Snufkin-Weapons-Xpansion-LootboxAddon-A20-2022February01/archive/refs/heads/main.zip)** Loot Box Add On for **A20**  \n**Alpha 19 Version**  \n**[Download](https://github.com/arramus/Snufkin-Weapons-Xpansion-A19-2021November20/archive/refs/heads/main.zip)** Snufkin Weapons Xpansion for **A19**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/22438-snufkin-weapons-xpansion-a19-stable/).\n\n**Credits:** [Arramus](https://7daystodiemods.com/tag/arramus/), Snufkin, oakraven, Slawa, ShoudenKalferas",
  "modDownloadURLs": [
    {
      "Info": "Alpha 20 Versions",
      "Version": "v19"
    },
    {
      "Info": "Snufkin Weapons Xpansion for A20",
      "URL": "https://github.com/arramus/Snufkin-Weapons-Xpansion-A20-2021December17/archive/refs/heads/main.zip",
      "Version": "v19"
    },
    {
      "Info": "Loot Box Add On for A20",
      "URL": "https://github.com/arramus/Snufkin-Weapons-Xpansion-LootboxAddon-A20-2022February01/archive/refs/heads/main.zip",
      "Version": "v19"
    },
    {
      "Info": "Alpha 19 Version",
      "Version": "v19"
    },
    {
      "Info": "Snufkin Weapons Xpansion for A19",
      "URL": "https://github.com/arramus/Snufkin-Weapons-Xpansion-A19-2021November20/archive/refs/heads/main.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/22438-snufkin-weapons-xpansion-a19-stable/",
  "modAuthors": [
    "Arramus",
    "Snufkin",
    "oakraven",
    "Slawa",
    "ShoudenKalferas"
  ],
  "modTags": [
    "7 days to die melee weapons",
    "7 days to die weapons",
    "Arramus"
  ]
}