{
  "modURL": "https://7daystodiemods.com/sorcery-mod/",
  "modCreatedTime": "2022-06-03T18:38:00+00:00",
  "modLastUpdatedTime": "2022-06-04T17:45:00+00:00",
  "modName": "Sorcery Mod",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2022/03/7-days-to-die-sorcery-mod-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/03/7-days-to-die-sorcery-mod-additional-screenshot-2.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/03/7-days-to-die-sorcery-mod-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/04/7-days-to-die-sorcery-mod-additional-screenshot-4a.jpg"
  ],
  "modShortDescription": "Through training and discovery, you'll learn how to deport the undead straight back to hell by casting elemental spells of Fire, Ice and Lightning.",
  "modDescription": "Play 7 Days to Die as a balanced post apocalyptic [zombie](https://7daystodiemods.com/tag/7-days-to-die-zombies/) vanquishing Sorcerer. Through training and discovery, you’ll learn how to deport the undead straight back to hell by casting elemental spells of Fire, Ice and Lightning.\n\n## Features\n\n* Vanilla game 100% untouched, add-only policy!\n* Balanced around vanilla gameplay, you must train to gain and sustain your power!\n* Unique animations, art, effects and sounds for spells and items\n* **New Spells:** Craft, Master and Upgrade 5 Spells per element!\n* **New Enemies:** Touched, Fallen (Champion), Awakened (Boss), Ancient (Raid)\n* **New Attributes:** Sorcery, Fire, Ice, Lightning\n* **New Resource:** Spirit (mana required to perform all Sorcery)\n* **New Dual Skill Tree and Perks:** Arcane, Fire, Ice, Lightning\n* **New Crafting:** [Armor](https://7daystodiemods.com/tag/7-days-to-die-armor-mods/), Weapons, Mods, Spells, [Potions](https://7daystodiemods.com/tag/7-days-to-die-drinks/), Scrolls, Stations, Blocks, Resources\n* **New Armor Sets:** Arcane, Fire, Ice, Lightning\n* **New Masteries:** Alchemy, Runesmithing, Spirit, Essence, Arcane, Fire, Ice, Lightning\n* **Play-style:** Sorcerer (Spellcaster)\n* **Play-style:** Alchemist (Potions, Bombs)\n* **Play-style:** Archer Mage (Spell Arrows)\n* **Play-style:** Gun Mage (Spell [Ammo](https://7daystodiemods.com/tag/7-days-to-die-ammo/))\n* **Play-style:** Melee Mage (Spell Weapons)\n* **Weapon Abilities:** Primary, Secondary, Passive and Charge abilities\n* **Rune Mods:** Harness the power of Runes to augment your weapons, armor and gear!\n* **Alchemy:** Craft Potions, Elixirs and Bombs\n* **Loot:** Item Sets, Armor, [Weapons](https://7daystodiemods.com/tag/7-days-to-die-weapons/), Mods, Spells, Potions, Scrolls and more!\n\n## Sorcery – Major Update (v1.3)\n\nAre you ready for a new Sorcery experience!? It’s time to dive into v1.3 Major Update with NEW Elemental Building Blocks, Writable Arcane Chests, Plantable Essence Trees, Elemental Ores, Ice Castle POI, Balance changes and more:\n\n* New POI: Ice Castle to Snow Forest (Ice specfic loot)\n* New Blocks: Fire, Ice, Lightning Elemental Blocks.\n* New Ore: Fire, Ice, Lightning Elemental Ores.\n* New Trees: Fire, Ice, Lightning Elemental Trees.\n* Added: Writable Storage Chests (Elemental).\n* Added: Element Specific Loot Chests.\n* Added: Journal Tips (unlocking recipes, etc.).\n* Added: Broken Glass Recipe to Forge.\n* Added: Plantable Elemental Tree Seeds.\n* Added: More element specific Loot drops.\n* Added: Supporter Plaques for long-term Gold Supporters.\n* Added: Unholy surprises…\n* Added: Several unique Sorcery Prefab Assets\n* Updated: Sorcery Difficulty Mode Mods.\n* Changed: Staff and Armor Repair Times drastically reduced.\n* Changed: Support disclaimer added and key sizes reduced.\n* Changed: Spell Traps updated to match Elemental Blocks.\n* Changed: Bushes updated to match Elemental Blocks.\n* Changed: Quest changes, including Arcane Trader Tiers.\n* Changed: Arcane Trader and Fallen Camp POIs updated.\n* Changed: Deeper Pocket Rune is now removable.\n* Balanced: Fallen scaling Health Regen lowered.\n* Balanced: Fallen scaling Damage lowered, esp. higher levels.\n* Balanced: Fallen more resistant to “mundane” weaponry. Augment with Scrolls and Runes.\n* Optimized: Most assets optimized with LOD quality scaling (huge performance boost)\n* Fixed: Intro Storm applied lingering wind zone to player.\n* Fixed: Missing Lightning Loot added.\n* Event End: The Feaster Event ends! Arcane & Unholy Bunnies were polls-voting voted to stay as rare spawns. Look for the Feaster Bunny next year.\n* Changes & Fixes: Lots of anticipated changes and tweaks!\n\nIn favor of Quality over quantity, vehicles will release with v1.4 (next update after v1.3). This major update (v1.3) adds crucial new features and groundwork that was necessary to get in sooner than later.\n\nSpecial thanks to Sorcerer Sunshine and Sorcerer NotARobot for their hard work on these major additions!\n\n## Installation\n\n1. Download: Sorcery-master.zip (latest version)\n2. Unzip: Sorcery-master.zip\n3. Drag-n-Drop: The Sorcery folder only, found within the unzipped Sorcery-master folder, directly into your Mods folder (\\\\7 Days To Die\\\\Mods). Create the Mods folder here if it doesn’t already exist.\n4. Verify Mod Path: (\\\\7 Days To Die\\\\Mods\\\\Sorcery) + (\\\\7 Days To Die\\\\Mods\\\\Deep Pockets)\n5. Disable EAC: EasyAntiCheat must be disabled through the Game Launcher for certain features to work\n6. Choose Difficulty (Optional): Change your Sorcery Difficulty from Normal (default) to Easy, Hard or Apocalyptic for the greatest challenge!  \n   1. Drag-n-drop Chosen Difficulty from “SorceryDifficultyChangerMods” into Mods (\\\\7 Days To Die\\\\Mods)  \n   2. You can change modes at will without restarting. Server-side, doesn’t require clients to download.  \n   3. If done correctly, you’ll see the logo of your new Difficulty Mode in the top-right of the main game screen!\n7. Deport The Undead back to Hell: You’re ready to play as a post-apocalyptic harbinger of the elements… may your training commence!\n\n## Terms of Use and Disclaimer\n\nYou agree to the full Terms of Use and Disclaimer herein by downloading and using the Sorcery Mod.\n\n### Terms of Use\n\nAll digital assets and ideas contained herein, and made possible by the “Sorcery Mod”, is the sole digital proprietary property of mod Author Devrix. Ownership and equal rights are hereby, irrefutably and solely, extended and granted to The Fun Pimps legal entity in good faith.\n\n#### Usage\n\nThe Sorcery Mod may be downloaded and used by players of the 7 Days to Die community, with no required royalties. Other than the XML Code itself, digital assets and works of the Sorcery Mod may not be used outside of the Sorcery Mod. By downloading and using the Sorcery Mod, users of the mod understand and accept full and sole responsibility and liability of using the mod. Author, nor The Fun Pimps, shall be held responsible or liable for any possible conflict(s) as a direct or indirect result of using this mod.\n\n#### Redistribution\n\nThe XML code of the Sorcery Mod may solely be redistributed within the 7 Days to Die community. Conditions of redistribution require this notice to remain in full, unmodified, and a direct link, with credit stated, to the original Mod and Author. You may not redistribute the digital Assets or works, aside from XML Code, of the Sorcery Mod. The Sorcery Mod itself should not be redistributed outside of its original distribution channels.\n\n#### Credit\n\nThis mod is made possible through the framework provided by The Fun Pimps. It is their hard work and ongoing dedication to building and improving an awesome game that fuels the passion and drives the creation of this mod. Supporters of the Sorcery Mod make ongoing development possible. Without their support, it is not possible to put in the enormous amount of time required to create the plethora of unique assets that make Sorcery. Special thanks and shoutout to SphereII for dll help and Mod Launcher special requests, Xyth for providing initial guides and resources, KhaineGB for awesome collaboration!\n\n#### Modification\n\nThe Terms of Use and Disclaimer herein are subject to ongoing changes and modifications.\n\n### Disclaimer\n\nThe Sorcery Mod is, and will always be, 100% FREE. When you choose to Support Development, you are supporting the unique individual work Devrix personally do outside of the game, as a content creator: The creation of unique VFX, SFX, Art, Time creating content and the services/interaction he provide here, Discord and other places. You are not supporting “derivative work of 7 Days to Die” (AKA modding code/changing skins/etc). That is against TFP policy.\n\n**Support Not Required:** Those unwilling, or unable, to support development can obtain in-game items 100% FREE. You are not required to support in order to obtain in-game items. Non-supporters are able to obtain any “In-Game Supporter Exclusives” 100% FREE, without supporting development. The free Supporter Key item can be obtained through Loot and Quest Rewards. However, Devrix cannot continue development of Sorcery at this level without Ongoing Support. If support drops below a threshold, development halts. The large amount of time allotted to development is made possible through the generous support given by their Patreon Supporters.\n\nAll rights reserved. Disclaimer subject to ongoing changes.\n\n## Feedback, Ideas, Bug Reporting\n\nConstructive feedback is welcome and encouraged. Specifically, it’s very helpful to hear from those wanting and willing to play a cheat-free normal playthrough. If you cheat everything in, you aren’t getting the experience or progression intended… nor will you properly understand the perks, skills and functions unless you learn and grow into them while playing.\n\n**[Download](http://public.sorcerymod.com/)**  \n**[Download](https://github.com/7d2d-sorcery/Sorcery/archive/refs/heads/master.zip)** _(Alternative link)_  \nAlso available on the mod launcher!\n\nIf you appreciate Devrix’s work and you want to show support, use this [donate link](http://sorcerymod.com/).\n\nIf you need help, you can use this [support link](http://discord.sorcerymod.com/).\n\n**Credits:** [Devrix](https://7daystodiemods.com/tag/devrix/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "http://public.sorcerymod.com/",
      "Version": "v19"
    },
    {
      "Info": "(Alternative link)",
      "URL": "https://github.com/7d2d-sorcery/Sorcery/archive/refs/heads/master.zip",
      "Version": "v19"
    },
    {
      "Info": "Also available on the mod launcher!",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modAuthors": [
    "Devrix"
  ],
  "modTags": [
    "7 days to die ammo",
    "7 days to die armor mods",
    "7 days to die drinks",
    "7 days to die weapons",
    "7 days to die zombies",
    "Devrix"
  ]
}