{
  "modURL": "https://7daystodiemods.com/spawning-tweaked/",
  "modCreatedTime": "2019-12-20T18:05:04+00:00",
  "modLastUpdatedTime": "2020-06-02T00:01:20+00:00",
  "modName": "Spawning Tweaked",
  "modImages": [],
  "modShortDescription": "Wasteland is now harder and if you're not prepared, at least the night in cities probably give you headaches to survive. Also made it a bit more realistic.",
  "modDescription": "This is Claymore’s tweaked spawning, he use more or less since A16\\. He was too lazy to make it a XPATH mod, but now decided, to finally get it done. Not too hard, because it’s simply a remove and append.\n\nWasteland is now harder and if you’re not prepared, at least the night in the cities probably give you headaches to survive. Also made it a bit [more](https://7daystodiemods.com/tag/7-days-to-die-more-slots/) realistic. For example: At the day, animals and zombies can die, because it’s too hot. Same for snow, but here in the night, because it’s too cold. Overall it’s harder and more [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) than the vanilla will spawn. But also more [animals](https://7daystodiemods.com/tag/7-days-to-die-animals/), so [food](https://7daystodiemods.com/food-mods/) won’t be that of a problem.\n\nCompatibility: A17+\n\n[Download](https://www.mediafire.com/file/eh2x8ufrkywl0yp/Claymore_Spawning_Tweaked.zip)\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/15031-claymores-modlets/).\n\n**Credits:** [Claymore](https://7daystodiemods.com/tag/claymore/)",
  "modDownloadURLs": [
    {
      "Info": "\nThis is Claymore’s tweaked spawning, he use more or less since A16. He was too lazy to make it a XPATH mod, but now decided, to finally get it done. Not too hard, because it’s simply a remove and append.\nWasteland is now harder and if you’re not prepared, at least the night in the cities probably give you headaches to survive. Also made it a bit more realistic. For example: At the day, animals and zombies can die, because it’s too hot. Same for snow, but here in the night, because it’s too cold. Overall it’s harder and more zombies than the vanilla will spawn. But also more animals, so food won’t be that of a problem.\n\nCompatibility: A17+\nDownload\nThe forum topic of the mod is here.\nCredits: Claymore\nShare this mod with your friends:\n\n",
      "Version": "v17"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/15031-claymores-modlets/",
  "modAuthors": [
    "Claymore"
  ],
  "modTags": [
    "7 days to die biomes",
    "Claymore"
  ]
}