{
  "modURL": "https://7daystodiemods.com/sustainable-forestry-reduce-tree-seeds-tree-farms/",
  "modCreatedTime": "2021-12-13T08:56:00+00:00",
  "modLastUpdatedTime": "2021-12-13T08:58:29+00:00",
  "modName": "Sustainable Forestry - Reduce Tree Seeds/Tree Farms",
  "modImages": [],
  "modShortDescription": "This mod reduces the tree seeds in game - by default, the drop is limited to a 1 in 30 chance of dropping one seed from any tree.",
  "modDescription": "This one’s mostly aimed at server admins wanting to keep tree farms down on their servers. It may also be of interest to private players who want to harvest a lot of wood, but hate the unnatural look of tree farms right next to their base.\n\nThis mod reduces the tree seeds in game – by default, the drop is limited to a 1 in 30 chance of dropping one seed from any tree. Optionally, you can remove the seeds altogether. Instead of needing to plant seeds, the trees are replaced by a new sapling, which will randomly grow into one of the real world [trees](https://7daystodiemods.com/tag/7-days-to-die-trees/). This keeps the “natural” look of forests, rather than having 20 identical pine trees, all facing the same way, in a cluster.\n\nDead trees in the wasteland and burnt forest biomes will regrow to dead trees again – this isn’t 100% realistic of course, but it’s better than regrowing to healthy oak trees.\n\nThe few seeds that are dropped will plant these new saplings, so if a player does save up some seeds and plant a [farm](https://7daystodiemods.com/tag/7-days-to-die-farming/) near their base, the resulting trees will be more random and natural looking. On a technical note, they also will no longer tick once they have grown, as they grow to the static RWG trees, so performance impact from these farms will still be reduced. The sapling seeds are available in the creative menu for admins to seed new forests.\n\nThis mod has been tested for functionality, but balance testing will be a more long-term job. Saminal is open to input from anyone who uses it as to tweaks or options that could be included.\n\nTo remove seeds completely, check the blocks.xml file – comments in that file point to the edits to make.\n\n**Note:** You’ll need to start a new game if you load this mod; unfortunately it’s not possible to update the properties of trees that already exist in the world.\n\n## Changelog\n\n* **_(new)_** Updated for A20 – nothing actually needed changing, which was nice, but version numbers updated and moved to his A20 repository for troubleshooting and safekeeping.\n* **Fixed problems**  \n   * Burnt trees not downgrading to saplings correctly  \n   * Cactus included in Oak random helper\n* **Seeking information**  \n   * Anybody getting an error “needs a deco shape assigned but has not!” – any logs or steps to reproduce, please!  \n   * Anybody experiencing trees growing where they shouldn’t be – please make sure you cut down the tree and then dug out the sapling.\n* **Download changed**  \n   * Link updated – now using github instead of google drive\n\n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/saminal1/samsmods-a20/tree/main/SSustainableForestry)** for A20  \n**[Download](https://yehonal.github.io/DownGit/#/home?url=https://github.com/saminal1/samsmods/tree/dev/SSustainableForestry)** for A19\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/23949-sams-sustainable-forestry-reduce-tree-seeds-tree-farms/).\n\n**Credits:** [Saminal](https://7daystodiemods.com/tag/saminal/)",
  "modDownloadURLs": [
    {
      "Info": "for A20",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/saminal1/samsmods-a20/tree/main/SSustainableForestry",
      "Version": "v19"
    },
    {
      "Info": "for A19",
      "URL": "https://yehonal.github.io/DownGit/#/home?url=https://github.com/saminal1/samsmods/tree/dev/SSustainableForestry",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/23949-sams-sustainable-forestry-reduce-tree-seeds-tree-farms/",
  "modAuthors": [
    "Saminal"
  ],
  "modTags": [
    "7 days to die farming",
    "7 days to die trees",
    "Saminal"
  ]
}