{
  "modURL": "https://7daystodiemods.com/tamillas-sad-story/",
  "modCreatedTime": "2022-05-03T14:38:44+00:00",
  "modLastUpdatedTime": "2022-05-03T14:38:45+00:00",
  "modName": "Tamilla's Sad Story",
  "modImages": [],
  "modShortDescription": "This mod adds a tragic debt to the crawler zombie. Her name was Tamila.",
  "modDescription": "This mod adds a tragic debt to the crawler [zombie](https://7daystodiemods.com/tag/7-days-to-die-zombies/).\n\n… Her name was Tamila.\n\n She was a simple girl who lived, dreamed, and loved. She loved a man named Sanya (Alexander). Fate brought these lives together, but doomed her to suffering. An illness infected Tamilla before her wedding. In the last moments of her life, Sanya took her by the hand, wishing she would resist, fight! But… The infection was stronger, it spread throughout her body, and when Tamilla turned-it was no longer Tamilla… The beast attacked Sanya, it screamed to death, but there was something human left in the beast, so strong was her Love. With tears on her face she buried herself in Sanya’s neck and said: “I’m sorry… I love you…”. Moments later, Sanya was gone.\n\nAnd now the tortured body wanders the world in search of her Sanya…\n\nЭтот мод добавляет трагическую судьбу ползающему зомби.\n\n… Ее звали Тамила. Это была простая девушка, которая жила, мечтала и любила. Она любила мужчину по имени Саня (Александр). Судьба свела эти жизни вместе, но обрекла ее на страдания. Болезнь заразила Тамиллу перед свадьбой. В последние мгновения её жизни Саня взял ее за руку, желая, чтобы она сопротивлялась, но… Зараза оказалась сильнее, она распространилась по всему телу, и когда Тамила превратилась – это была уже не Тамилла… Зверь набросился на Саню, он кричал до смерти, но что-то осталось человеческое в этом звере, так сильна была её привязанность. Со слезами на лице она зарылась в шею своего Сани и сказала: “Прости… Я люблю тебя…”. Спустя мгновения Сани не стало.\n\nИ вот теперь измученное тело бродит по миру в поисках своего Сани…\n\n**[Download](https://drive.google.com/file/d/1G3MO6Xx6PioA1hL-lDiC-7gyWX7zICzY/view?usp=sharing)**\n\n**Credits:** [Vasiliy](https://7daystodiemods.com/tag/vasiliy/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/file/d/1G3MO6Xx6PioA1hL-lDiC-7gyWX7zICzY/view?usp=sharing",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modAuthors": [
    "Vasiliy"
  ],
  "modTags": [
    "7 days to die zombies",
    "Vasiliy"
  ]
}