{
  "modURL": "https://7daystodiemods.com/telrics-thumper/",
  "modCreatedTime": "2020-07-18T14:04:00+00:00",
  "modLastUpdatedTime": "2021-04-28T21:26:30+00:00",
  "modName": "Telric's Thumper",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/02/screenshot-of-the-dome.jpg"
  ],
  "modShortDescription": "Welcome to the massively improved Thumper mod! A few people said they missed the old Thumper mod, so Telric spent a few weeks redoing every aspect of it.",
  "modDescription": "Welcome to the massively improved Thumper mod! A few people said they missed the old Thumper mod, so Telric spent a few weeks redoing every aspect of it. This new version feels much better and cleaner than the old alpha 16 version. Along with redoing the basic idea, he has expanded on and reworked things differently.\n\nSo what has changed? Well, lets start from the beginning. In the original, you got a quest, started it, placed a block and upgraded it. This version will require you to wrench damaged Thumpers that have fallen from the sky. Collecting all 5 pieces, in the correct amounts, will allow you to craft a radio transmission to reach Thumper Industries. They will send you a message and a reimbursement Thumper. They don’t require you to have a receipt or be the original owner.\n\nThumper Industries will then instruct you to head to a marked landing zone. Once you are there, the radio signal will connect with the Thumper, allowing you to hear the voice of a Thumper Industries representative in assisting you with your brand new Thumper. The voice will tell you how long the Thumper will be active.\n\nOnce your Thumper has fallen, a dome will appear around the area you need to stay within to get credit for the quest. Leaving this area will make it so you won’t get the ability to harvest your rewards.\n\nShortly after landing, the Thumper will display it’s capacity. This will gradually fill up as it extracts resources from the earth. Each bar is worth 10% capacity. The higher the capacity after the Thumper has finished extracting, the higher your reward will be. When taking damage from any source, the Thumper will begin losing capacity. So protect it at all costs! You’ll be swarmed with an ever increasing amount of [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) and new enemies. Be sure to check the air as aerial combatants have now entered the scene! But don’t worry, the Thumper cant be destroyed. It just won’t be able to harvest many resources.\n\nAfter the Thumper has finished extracting, as long as you’ve stayed in the area, you will be given a buff. That buff will tell you how well you did and the multiplier of your rewards. Simply take a wrench and harvest the resources right out of the Thumper. These resources can be manipulated into many rare rewards. These rewards are costly, but require no perks or schematics to craft.\n\nAnd there you go! Thumper complete. Craft what you want or save up the Thumplurite for the higher end rewards. The top tier crafts will require multiple Thumpers to be completed, so go hunt for more broken ones to harvest.\n\nDoes not require restart.\n\nRequires client to install as well as server.\n\nTested and works with Alpha 19.4 b3\n\nRecommended to be played single player due to not working properly on servers.\n\n**[Download](https://www.dropbox.com/s/yfi7ppvs5lo4w8r/TelricsThumper2.0A19.zip?dl=1)** for A19  \n**[Download](https://www.dropbox.com/s/5xc52ela6kaz15h/TelricsThumper2.0.zip?dl=1)** for A18\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/19976-telrics-a19-modlets/).\n\n**Credits:** [Telric](https://7daystodiemods.com/tag/telric/)  \n_Additional Credits:_ ZombiePro100",
  "modDownloadURLs": [
    {
      "Info": "for A19",
      "URL": "https://www.dropbox.com/s/yfi7ppvs5lo4w8r/TelricsThumper2.0A19.zip?dl=1",
      "Version": "v19"
    },
    {
      "Info": "for A18",
      "URL": "https://www.dropbox.com/s/5xc52ela6kaz15h/TelricsThumper2.0.zip?dl=1",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/19976-telrics-a19-modlets/",
  "modAuthors": [
    "TelricAdditional Credits: ZombiePro100"
  ],
  "modTags": [
    "7 days to die ammo",
    "7 days to die weapons",
    "7 days to die zombies",
    "Telric"
  ]
}