{
  "modURL": "https://7daystodiemods.com/telrics-pokemod/",
  "modCreatedTime": "2020-10-02T04:02:00+00:00",
  "modLastUpdatedTime": "2021-04-28T22:06:32+00:00",
  "modName": "Telric's Pokemod",
  "modImages": [],
  "modShortDescription": "Welcome to the new Pokemod! This mod used to be an SDX mod. Now it's all XML! It also comes with a few new features. So lets dig in.",
  "modDescription": "Welcome to the new Pokemod! This mod used to be an SDX mod. Now it’s all XML! It also comes with a few new features. So lets dig in.\n\nTLDR: 1000 dukes > poke trainer pack > equip pokedex > use gloves’ right click to allow control on a caught pokemon > catch other pokemon or duel others…\n\nAlso, this mod does not require a world restart. Bushes and pokemon will spawn throughout normal gameplay.\n\nObviously ‘pokemon’ does not belong to Telric…\n\nTo get started on your pokemon catching journey, you’ll need 1000 dukes. You’ll use those to craft a Pokemon Trainers Starter Pack. This will contain a few items you’ll need.\n\nA pokedex will come in this pack. This is an important tool. Using the left and right click on the pokedex while NOT crouched will change your pokemon team from red to blue and back. This is used to allow players to duel pokemon if they wish and is required to control a pokemon to fight wild ones. Left clicking while crouched and near a pokemon will display that pokemon’s type above their head. This is useful for finding which pokemon to use against them to deal the most damage. Being crouched and right clicking will remove both team buffs, if you decide you dont want it on your buff list. The first time you equip this in your toolbar, you’ll get some new buffs that will be required for pokemon mod. The first buff being a pokemon trainer level.\n\nPokemon trainer levels are a new leveling system that affects a few things. You’ll start at level 1\\. Defeating wild pokemon and trainer pokemon will give you various amounts of experience. You can also get a small amount of experience by uprooting apricorn bushes, which are found randomly in the world. Defeating wild or trainer pokemon will also give you some pokebucks. These are used to craft new abilities once they are unlocked.\n\nYou have a chance to unlock a random ability each time your pokemon trainer level goes up. You can also get new abilities by defeating trainers. They have a chance to drop a random ability unlock.\n\nApricorn bushes can be uprooted only by summoning a pokemon and using an ability. Any ability will uproot the bush. Looting the uprooted bush will give you a few apricorns that can be turned into pokeballs.\n\nPokemon that you have caught can be summoned by right clicking. This will place a pokeball. DO NOT walk on the pokeball as it will destroy the spawner and you will lose the pokemon. Once a pokemon is spawned, you can right click with the pokemon trainers gloves to mark it as part of your team. You will see a red or blue pokeball above the pokemon, saying which team it’s on. A pokemon will need to match your team in order to obey any ability orders you give it.\n\nAbilities are used to deal damage and healing to pokemon. Simply be near your pokemon (about 10 blocks) and left click the ability. This will cause your pokemon to attack as well as get a cooldown. You will see a stopwatch icon above the pokemon if they are on cooldown. Using abilities while a pokemon is on cooldown will not trigger an attack. Healing abilities and attack abilities are on different cooldowns. Healing abilities show a blue cooldown timer.\n\nUse your pokemon and your abilities to slowly whittle down a wild pokemons health. Once their health is at a certain percent, they will get a particle showing they are capturable. At this time, use the pokemon trainers gloves and throw a pokeball at them to catch them. But be fast. You only have 10 seconds before they are fully healed! Using a masterball, however, will not require the pokemon to be low on health.\n\nOnce you are done using your caught pokemon, they can be easily returned by throwing a pokeball at them. They do not need to be low on health, if they are caught.\n\nDueling pokemon requires one player to be on red team and one to be on blue team. Both will need to summon their pokemon and use their poke gloves to mark their pokemon on the same team as themselves. Once that’s done, grab your abilities and have at each other! The first pokemon to fall is the losing one.\n\nThere are a total of 25 pokemon in this release.\n\nAs always, let him know if you enjoy the mod or if you find something wrong (via forum topic link). This went through a little testing and had to be changed last moment due to some multiplayer compatibility. But seeing as a core part of it was to allow players to duel pokemon, the changes were needed.\n\nDoes not require restart.\n\nRequires client to install as well as server.\n\nTested and works with Alpha 19.4 b3\n\nRecommended to be played single player or multiplayer. Works fine on servers as well.\n\n**[Download](https://www.dropbox.com/s/2dr37q26bvjkz0v/TelricsPokemon2.0A19.zip?dl=1)** for A19  \n**[Download](https://www.dropbox.com/s/pyuubtynmixaeug/TelricsPokemon2.0.zip?dl=1)** for A18\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/19976-telrics-a19-modlets/).\n\n**Credits:** [Telric](https://7daystodiemods.com/tag/telric/)",
  "modDownloadURLs": [
    {
      "Info": "for A19",
      "URL": "https://www.dropbox.com/s/2dr37q26bvjkz0v/TelricsPokemon2.0A19.zip?dl=1",
      "Version": "v19"
    },
    {
      "Info": "for A18",
      "URL": "https://www.dropbox.com/s/pyuubtynmixaeug/TelricsPokemon2.0.zip?dl=1",
      "Version": "v18"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/19976-telrics-a19-modlets/",
  "modAuthors": [
    "Telric"
  ],
  "modTags": [
    "Telric"
  ]
}