{
  "modURL": "https://7daystodiemods.com/telrics-horses-2-0/",
  "modCreatedTime": "2021-05-10T20:50:00+00:00",
  "modLastUpdatedTime": "2021-05-10T20:53:31+00:00",
  "modName": "Telric's Horses 2.0",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2020/10/7-days-to-die-telrics-horses-2.0-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2020/10/7-days-to-die-telrics-horses-2.0-additional-screenshot-2.jpg"
  ],
  "modShortDescription": "This mod is a rework of the original horses mod. It adds a new POI that is home to four new NPCs: Maybell, Leah, Vincent, and Abby.",
  "modDescription": "This mod is a rework of the [original horses mod](https://7daystodiemods.com/telrics-horses/). It adds a new POI that is home to four new NPCs: Maybell, Leah, Vincent, and Abby. If you ever played the old Summerset Villa mod, these [NPCs](https://7daystodiemods.com/tag/7-days-to-die-npcs/) were in that too. Now they are all grown up. Maybell, the NPC that used to water crops in Summerset, has now become old while her daughter (the little girl that used to fly the kite) Leah has taken over that role. She and Vincent (the little boy who helped you get worms) are married now and have a child of their own which they named Abby.\n\nSeek out this [POI](https://7daystodiemods.com/tag/7-days-to-die-prefab/) and gain some reputation with these wonderful people to one day get your very own horse. Complete [quests](https://7daystodiemods.com/tag/7-days-to-die-quests/) for each NPC to get a +1 reputation. Once you gain certain amounts of reputation (right now it’s at 25 and 50), you will unlock new items, quests, and even new minigames. Vincent will teach you how to care for a horse of your own once you’ve proven to them that you’re friendly. This mod also allows you to upgrade your horse after completing the horse obstacle course, which unlocks at 50 reputation. A tier 2 [horse](https://7daystodiemods.com/tag/7-days-to-die-animals/) has more speed and inventory space than a tier 1 horse.\n\nTested and works with Alpha 19.4 b3\n\n**Note:** Requires restart. Requires client to install as well as server. Recommended to be played single player or multiplayer. Works fine on servers as well. This mod does NOT work with [original horses mod](https://7daystodiemods.com/telrics-horses/) (TelricsHorsesA19).\n\n## Changelog\n\n* **_(new)_** Just added German localization to the Horses 2.0 mod, courtesy of Sechsterversuch! Thanks for translating!\n* Fixed screamer spawn. POI was using player torches. You’ll have to download the mod again, and make a new world (or find a way to wipe the existing POI).\n* Just put in a little fix that someone brought up. The horses werent able to be healed with apples. Fixed that now, so redownload the files if you’re wanting that to work again. It wont require a restart or anything if you redownload.\n* Fixed unlock buff description.\n\n**[Download](https://www.dropbox.com/s/bzzpmxbjl2mmz3h/TelricsHorses2.0A19.zip?dl=1)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/19976-telrics-a19-modlets/).\n\n**Credits:** [Telric](https://7daystodiemods.com/tag/telric/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://www.dropbox.com/s/bzzpmxbjl2mmz3h/TelricsHorses2.0A19.zip?dl=1",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/19976-telrics-a19-modlets/",
  "modAuthors": [
    "Telric"
  ],
  "modTags": [
    "7 days to die animals",
    "7 days to die npcs",
    "7 days to die prefab",
    "7 days to die quests",
    "Telric"
  ]
}