{
  "modURL": "https://7daystodiemods.com/the-no-crafting-mod/",
  "modCreatedTime": "2019-12-24T19:18:43+00:00",
  "modLastUpdatedTime": "2020-06-04T14:48:41+00:00",
  "modName": "The No Crafting Mod",
  "modImages": [],
  "modShortDescription": "This 7 Days to Die mod removes crafting recipes from in-game menu. It includes shortened starting quest, which modified to work with the no crafting theme.",
  "modDescription": "12pack made this into a mod after watching a couple of fellas on youtube do no crafting plays, and thought it would be cool to have an actual mod to eliminate the temptation to just craft anyway.\n\nThis 7 Days to Die mod removes the crafting [recipes](https://7daystodiemods.com/tag/7-days-to-die-recipes/) from the in-game menu. It includes a shortened starting quest, which has been modified to work with the ‘no crafting’ theme. It also includes a loot distinction table to allow you to still be able to get certain items from certain zombies. The drops are kinda what you would expect from the different characters.\n\n**They are:**\n\n* Eddie – the soldier – military items\n* Sylvia – the nurse – medical items\n* Bob – the construction guy – [tools](https://7daystodiemods.com/tag/7-days-to-die-tools/), repair kits, wood and flagstone blocks, and wood bars (probably will change those to the working stiffs crate)\n* Lab – the lab tech – from the lab equipment group\n* Festus – the old timer – ores and maps, picks and shovels\n* the Hazmat guy – yep, hazmat suits\n* the [Farmer](https://7daystodiemods.com/farming-mods/) – seeds, crops\n* the Suit – business guy – cash and dukes, suit pieces\n\nThey all drop other random items, and the rest of the [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) drop normal stuff. He does mean to add in the cop and the biker to this list.\n\nHe is doing a play-through with this now, and am still tinkering with some settings, but it is working out quite well! There are a couple of things in there, noted in the readme file, that some may want to remove. (namely progression, and the blinding of the vultures)\n\nThanks to SphereII for the xpath thread, which helped tons learning how to create this.\n\nAlso, to mention, he looked at RedEagle’s shortened starting quest to get the right syntax for him, as he was having some trouble getting it to work right.\n\nHe hope someone enjoys Not Crafting!\n\n[Download](https://github.com/x12pack/Mods/archive/master.zip)\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/16845-the-quotnocraftingquot-mod-by-12pack/).\n\n**Credits:** 12pack",
  "modDownloadURLs": [
    {
      "Info": "\n12pack made this into a mod after watching a couple of fellas on youtube do no crafting plays, and thought it would be cool to have an actual mod to eliminate the temptation to just craft anyway.\nThis 7 Days to Die mod removes the crafting recipes from the in-game menu. It includes a shortened starting quest, which has been modified to work with the ‘no crafting’ theme. It also includes a loot distinction table to allow you to still be able to get certain items from certain zombies. The drops are kinda what you would expect from the different characters.\nThey are:\n\nEddie – the soldier – military itemsSylvia – the nurse – medical itemsBob – the construction guy – tools, repair kits, wood and flagstone blocks, and wood bars (probably will change those to the working stiffs crate)Lab – the lab tech – from the lab equipment groupFestus – the old timer – ores and maps, picks and shovelsthe Hazmat guy – yep, hazmat suitsthe Farmer – seeds, cropsthe Suit – business guy – cash and dukes, suit pieces\nThey all drop other random items, and the rest of the zombies drop normal stuff. He does mean to add in the cop and the biker to this list.\nHe is doing a play-through with this now, and am still tinkering with some settings, but it is working out quite well! There are a couple of things in there, noted in the readme file, that some may want to remove. (namely progression, and the blinding of the vultures)\nThanks to SphereII for the xpath thread, which helped tons learning how to create this.\nAlso, to mention, he looked at RedEagle’s shortened starting quest to get the right syntax for him, as he was having some trouble getting it to work right.\nHe hope someone enjoys Not Crafting!\nDownload\nThe forum topic of the mod is here.\nCredits: 12pack\nShare this mod with your friends:\n\n",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/16845-the-quotnocraftingquot-mod-by-12pack/",
  "modAuthors": [
    "12pack"
  ],
  "modTags": []
}