{
  "modURL": "https://7daystodiemods.com/the-specialists-a-trader-class-rework/",
  "modCreatedTime": "2021-12-14T14:34:00+00:00",
  "modLastUpdatedTime": "2021-12-14T14:38:31+00:00",
  "modName": "The Specialists - A Trader Class Rework",
  "modImages": [],
  "modShortDescription": "It sounds like a nightmare to do but Shino is working (at least trying) to make traders more in line with their appearance/personality.",
  "modDescription": "It sounds like a nightmare to do but Shino is working (at least trying) to make traders more in line with their appearance/personality.\n\n## According to the Wiki\n\n* Trader Joel: Armor\n* Trader Jen: Medical supplies\n* Trader Bob: Tools and vehicles\n* Trader Rekt: Food and seeds\n* Trader Hugh: Weapons and ammo\n\nWhich is fine, but he really doesn’t notice the difference between them.\n\nHe has drafted a few good ideas from friends that play with him for each [trader](https://7daystodiemods.com/tag/7-days-to-die-trader/).\n\n## Trader Joel: General Stuff & Workstations\n\n_The sunglasses hide the fact that he doesn’t sleeps. Open 24/7_\n\nJoel has that scavenger vibe all over his god damn sexy face. Let’s give him an inventory worthy of someone like him.\n\nGeneral food (mostly canned, some meat, eggs and little vegetables), wood and iron (be it the raw resource or the frame blocks) and the weapons and makeshift armors you can find (low quality, tier and cnd no matter the gs (also dirt cheap)) His secret stash may contain workstations or their blueprints.\n\n## Trader Jen: Medical Supplies\n\n_As the last medic alive she’s ready to treat your wounds no matter the time. Open 24/7_\n\nBandages, first aid kits and buff items galore. All at a fair price considering the state of the world outside of course. Guaranteed at least 1 antibiotic.\n\nYou’ve got an infection? Got no honey? Go to Jen’s. Abrassion and out of bandages? Go to Jen’s. That direwolf just took a bite out of your god damn leg. You’ve guessed it, go to Jen’s.\n\nShe has no guns to buy, she does sell ammo since she finds them when looting around. She’s a pharmacist not a harmacist. She might sell you the things she uses to cut open her patients.\n\n## Trader Bob: Tools and Vehicles\n\n_Guy hates the morning, works late to compensate. Opens 12:30 | Closes 03:50_\n\nHe sells bits and bobs. Get it? Trader Bob, bits and bobs?\n\nHe has a inventory similar to Joel’s, more iron oriented and sells repair kits almost every time.\n\nThe catch? His secret stash has only 1 item. A gamestage+1 vehicle in acceptable condition. So bikes, minibikes, the cooler bike, 4×4 and gyro. (neither of them guaranteed) (secret stash is either the vehicles or the parts to make them and the blueprint) To balance this, ofc, they’re pricey. He also has electronics in stock, lights, speakers, generators and stuff.\n\n## Trader Rekt: Food and Seeds\n\n_The Blake Abernathy of the Zombie Apocalypse. Open: 4:01 | Closes 20:30_\n\nA ray of sunshine on the wasteland.\n\nHe sells food (raw, cooked and seed) and hunting stuff. (Mid quality hunting rifles and ammo for it)\n\nHis grandma taught him to cook so he has the best food you’ll ever eat. Also, remember the Grandpa’s recipes? Well, turns out he’s that grandpa. Secret stash filled with them. He buys NOTHING but food too. Canned, liquid, rotten, don’t care. Secret stash might have farm plots ready for you.\n\n## Trader Hugh: Weapons, Ammo, Armor, Traps\n\n_He might get upset at you burning daylight, but if he does it then its fine. Open: 11:00 | Close: 00:00_\n\nThe guy only knows one thing and that’s how to kill zombies.\n\nWeapons and their parts. Armor, mods and ammo. Any kind of trap. Secret stash has weapon blueprints and the best quality weapons you can find on the wasteland these days.\n\nIf you’ve got beef with the undead, he’s the right guy to pay a visit. Otherwise get out of his compound cause you’re burning daylight.\n\nShino also make some changes to the Vanilla clutter list that every trader has so it includes a little bit more decorations. Trader inventories have been tweaked to reflect such changes.\n\nTL;DR traders now have more specialized inventories and open/close hours.\n\nGood ideas will be implemented and bad ideas will be discussed upon until they become good. Feel free to test stuff and tell him how it feels. Any feedback is welcomed and appreciated.\n\n**[Download](https://gitlab.com/GitSugar/Sugars-7d2d-modlets/-/raw/main/The%20Specialists.zip?inline=false)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/26042-the-specialists-a-trader-class-rework/).\n\n**Credits:** Shino",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/GitSugar/Sugars-7d2d-modlets/-/raw/main/The%20Specialists.zip?inline=false",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/26042-the-specialists-a-trader-class-rework/",
  "modAuthors": [
    "Shino"
  ],
  "modTags": [
    "7 days to die trader"
  ]
}