{
  "modURL": "https://7daystodiemods.com/true-survival/",
  "modCreatedTime": "2022-06-14T00:24:00+00:00",
  "modLastUpdatedTime": "2022-06-14T00:26:18+00:00",
  "modName": "True Survival",
  "modImages": [],
  "modShortDescription": "This mod was designed to walk the line between realism and fun engaging gameplay. In this mod death occurs when your player can not respawn anymore.",
  "modDescription": "This mod was designed to walk the line between realism and fun engaging gameplay. Where realism became grindy or not fun Spider tried to aim for engaging gameplay mechanics with a focus on risk and reward and a strong sense of consequences. Death in this mod should not be viewed as dyeing and respawning but as if you got beaten to near death and stumbled home and passed out till you wake up(respawn). In this mod death occurs when your player can not respawn anymore.\n\n## Choosing Your Character\n\nUpon starting, players will have Knowledge Points available to purchase up to 3 Traits, a Hobby and a Profession. These choices will determine the players starting stats, items and recipes. Players are able to learn all Professions over time by collecting 20 Profession Pages and crafting another Professions Kit. Traits do not stack. The following are the Players Starting Choices.\n\n## Professions\n\n_(All can be learned by collecting loot items during game, do not stack)_\n\n### Cop\n\n* Unique Recipes – Gun Oil\n* Starting Recipes – Pistol, Stun Baton, Weapon Repair Kit\n* Starting Bonus Stats – Handgun Specialization 10% Faster Reload, better Aim & Handling w/Handguns\n* Starting Bonus Gear- Old Revolver 6q; 9mm Rounds x20\n\n### Chef\n\n* Starting Recipes – All Food Recipes\n* Starting Bonus Stats – +20% Faster Food Cooking speed\n* Starting Bonus Gear – old Knife 6q\n\n### Fireman\n\n* Starting Recipes – Plant Salve, Molotov Cocktail\n* Starting Bonus Stats – 20% More Block Damage with Axes\n* Starting Bonus Gear- Fire Axe 3q, Full Fireman’s Almanac Book Set\n\n### Burglar\n\n* Starting Recipes – Lock Pick\n* Starting Bonus Stats –3 Block Treasure Radius; 20% Faster Loot timers\n* Starting Bonus Gear- Old Knife 6q; Lock Pick x 20, Full Great Heist Book Set\n\n### Park Ranger\n\n* Starting Recipes – Herbal Antibiotics, Stone Spear, Iron Spear, Steel Spear\n* Starting Bonus Stats – Rifle Specialist 10% Faster Reload, better Aim & Handling w/Rifles; 20%\n* Starting Bonus Gear- Old Rifle 6q; 762mm Round x 20\n\n### Bouncer\n\n* Starting Recipes – Steel Knuckles, Brass Knuckles, Beer, Mead\n* Starting Bonus Stats –10% Less Stamina when Brawling\n* Starting Bonus Gear- Brass Knuckles 3q, Full Bar Brawling Book Set\n\n### Carpenter\n\n* Starting Recipes – All Wood Doors\n* Starting Bonus Stats – The ability to use the Claw Hammer as a weapon; 20% Faster Crafting on the Workbench; Mastered Wood Building Skill\n* Starting Bonus Gear- Claw Hammer 3q, Nail x50\n\n### Soldier\n\n* Unique Recipes – Grubs\n* Starting Recipes – Weapon Repair Kit, Pipe Machine Gun, AK47, Pipe Bomb, Cooking Pot Mine\n* Starting Bonus Stats – Machine Gun Specialization 10% Faster Reloading and 10% better Aim with all Machine Guns. Can not get sick from eating Grubs\n* Starting Bonus Gear- Old Rifle 6q; 762mm Round x20\n\n### Fitness Instructor\n\n* Starting Recipes – Goldenrod Tea, Red Tea, Mega Crush, Vitamins\n* Starting Bonus Stats – 5% Less Stamina from Running; 10% Faster Run Speed; 10% Faster Walk Speed\n* Starting Bonus Gear- Bat 3q\n\n### Electrician\n\n* Unique Recipes – Electrical Parts\n* Starting Recipes – Generator Bank, Pressure Plate, Battery Bank, Player Powered Lights, Timer Relay, Wire Relay, Motion Sensor, Speaker, Switch, Electric Fencepost, Spotlight, Stun Baton\n* Starting Bonus Stats – 20% Faster Electrical Crafting\n* Starting Bonus Gear- Screwdriver 3q\n\n### Mason\n\n* Starting Bonus Stats – The ability to use the Mason Hammer as a weapon; 20% Faster Mason Crafting; Mastered Cobblestone Building Skill\n* Starting Bonus Gear- Mason Hammer 3q\n\n### Iron Worker\n\n* Starting Recipes – All Iron Doors\n* Starting Bonus Stats – The ability to use the Wrench as a weapon; 20% Faster Crafting on the Forge; Mastered Iron Building Skill\n* Starting Bonus Gear – Wrench 3q\n\n### Mechanic\n\n* Unique Recipes – Mechanical Parts\n* Starting Recipes – Small Engine, Large Engine, Auger, Chainsaw, All Vehicles\n* Starting Bonus Stats – Sledge Specialist 10% More entity damage & more attacks per min w/Sledges; 20% Faster Vehicle Crafting\n* Starting Bonus Gear- Impact Driver 300q\n\n### Doctor\n\n* Unique Recipes – Painkillers, Steroids, Stimulants\n* Starting Recipes – Plant Salve, Antibiotics, Cast\n* Starting Bonus Stats – Treated injuries heal 20% Faster; 20% Faster Medical Crafting\n* Starting Bonus Gear- First Aid Kit(5), Stimulant(5), Steroids(5)\n\n### Chemist\n\n* Unique Recipes – Stimulant, Gas Bundle, GunPowder Bundle, Nitroglycerin\n* Starting Recipes – Mega Crush, Black Strap Coffee, Purification Tablets, Glue, Oil, Gas, GunPowder\n* Starting Bonus Stats – 20% Faster Chemical Crafting\n* Starting Bonus Gear – Stimulant x10\n\n### Farmer\n\n* Unique Recipes – Insecticide\n* Starting Recipes – All Crop Seed Recipes, Watering Can, Fertilizer, Farm Plot\n* Starting Bonus Stats – 20% Faster Seed Crafting, X2 Harvesting crops\n\n### Concrete Mason\n\n* Starting Bonus Stats – The ability to use the Concrete Sledge as a weapon \\\\ 20% Faster Crafting on the Cement Mixer \\\\ Mastered Concrete Building Skill\n* Starting Bonus Gear – Concrete Sledge 3q\n\n## Hobbies\n\n_(Only purchasable at start of the game)_\n\n### Hunting\n\nCan track Deer and Pigs when crouched if they are near. Shotgun Specialization -10% Faster Reloading and 10% better Aim with all shotguns.\n\n### Cooking\n\nStarting Recipes – All Crop Seed Recipes, Corn Bread, Meat Stew, Bacon and Eggs, Vegetable Stew, Carrot Cake, Bread, Kabob, Chili Dog\n\n### Racing\n\nAll Vehicles top speeds increased 10%\n\n### Sewing\n\nStarting Recipes – All Crop Seed Recipes Denim Pants, Overalls, Skirt, Tank Top, T Shirt, Denim Shorts, Leather Duster, Puffer Coat, Storage Pocket\n\n### Building\n\nStarting Recipes – All Building Block Shapes\n\n### Crossfit\n\nStarting Bonus Stats – 10% Faster Stamina Regan / 10% more Max Stamina\n\n### Electronics\n\nStarting Recipes – All Crop Seed Recipes Battery Bank, Speaker, Electric Fencepost, Spotlight, Ceiling Light\n\n### Medic\n\nStarting Bonus Stats – Tending wounds heal 10% faster\n\n### Sports\n\nStarting Bonus Stats – 10% Blunt Damage / 10% Faster\n\n### Gearhead\n\nStarting Recipes – All Crop Seed Recipes Bicycle, Small Engine, Minibike, Motorcycle\n\n### Gardening\n\n* Starting Recipes – All Crop Seed Recipes Insecticide, Potato Seed, Corn Seed, Goldenrod Seed, Chrysanthemum Seed, Pumpkin Seed, Egg Plant Seed, Carrot Seed\n* Starting Bonus Stats – +1 to Harvested Crops\n\n### Archery\n\nStarting Bonus Stats – Bow Specialization 10% Faster Reloading and 10% better Aim, 10% Farther Range, 10% Faster Drawing with all Bows\n\n## Traits\n\n_(Only purchasable at start of the game, do not stack)_\n\n### Homebody\n\nTrait Effect = When Indoors you receive 10% Less Stamina to Melee / 10% Faster reloading / 10% Better Weapon Handling. When out doors it is reversed\n\n### Outdoorsy\n\nTrait Effect = When Outdoors you receive 10% Less Stamina to Melee / 10% Faster reloading / 10% Better Weapon Handling. When indoors it is reversed\n\n### Strong\n\nTrait Effect = When Encumbered -10% More effect / -5% Less Stamina on Melee / +10% Faster Metabolism\n\n### Weak\n\nTrait Effect = When Encumbered +10% More effect / +5% More Stamina on Melee / -10% Slower Metabolism\n\n### Skinny\n\nTrait Effect = 10 Degrees Colder / 10% Slower Metabolism\n\n### Fat\n\nTrait Effect = 10 Degrees Hotter/ 10% Faster Metabolism\n\n### Sickly\n\nTrait Effect = 10% more chance of Illness / 10% Quicker to Heal\n\n### Healthy\n\nTrait Effect = 10% Less chance of Illness / 10% Longer to Heal\n\n### Lazy\n\nTrait Effect = 20% Faster HP Recovery when Sleeping / 20% Slower Fatigue Recovery when Resting or Sleeping\n\n### Restless\n\nTrait Effect = 20% Slower HP Recovery when Sleeping / 20% Faster Fatigue Recovery when Resting or Sleeping\n\n### Early Bird\n\nTrait Effect = When Daytime you receive 10% Less Stamina to Melee / 10% Faster reloading / 10% Better Weapon Handling. When Nighttime it is reversed\n\n### Night Owl\n\nTrait Effect = When Nighttime you receive 10% Less Stamina to Melee / 10% Faster reloading / 10% Better Weapon Handling. When Daytime it is reversed\n\n### Fast\n\nTrait Effect = 10% Faster / 10% More Noise\n\n### Slow\n\nTrait Effect = 10% Slower / 10% Less Noise\n\n## Farming\n\n* All Seed Recipes found in loot\n* Seeds are made on a Drying Rack(workstation)\n* Player planted crops can be destroyed by non player entities touching them.\n* Player planted crops can be planted on any dirt type soil or crafted [Farm](https://7daystodiemods.com/tag/7-days-to-die-farming/) Plots.\n* All Rotten and Moldy old food items can be scraped into “Biomass” and used in crafting Fertilizer and other recipes\n* Player planted crop Seeds can be fertilized with the Watering Can and 1 Fertilizer. Once fertilized the crop will grow ⅓ faster and produce double the produce.\n* Player planted crops have a chance to dry out and need watering with the Watering Can and 3oz. of Dirty Water\n* Player planted crops have a chance to get infested with insects and need Insecticide applied with the Watering Can and 1oz. of Insecticide\n* List of cultivatable plants  \n   * Fruit Crops – Yucca, Blueberry, Pumpkin, Orange  \n   * Vegetable Crops – Corn, Potato, Carrot, Eggplant  \n   * Grain Crops – Corn, Wheat  \n   * Protein Crops – Mushrooms, Beans  \n   * Other – Aloe, Chrysanthemum, Cotton, Goldenrod, Coffee, Hops\n\n## Zombies and Predators\n\n* [Zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) require head shots to take damage from players, traps are un effected\n* Zombies move faster in darker areas\n* Zombie Types  \n   * **Normal** (standard zombies, speeds vary)  \n   * **Spitters** (Spit different types of acid and explode when near death)  \n   * **Brutes** (have a speed burst and do a lot of block damage)  \n   * **Tanks** (have a lot of health and a high chance to grab)  \n   * **Screamers** (summon zombie hordes)  \n   * **Boomers** (explode when near death)  \n   * **Suicide Boomers** (charge and explode on agro)  \n   * **Burning** (move fast, catch player on fire, dismember easy, leave fire trap on death)  \n   * **Ferals** (fast, high health)  \n   * **Crawling Ferals** (move on all fours fast, high health and can jump)  \n   * **Infected Animals** (have no fear and attack on sight)\n* Cop Zombies “Acid Puke” now leaves burning acid on you and can be removed with water.\n* Fat Zombies puke leaves a smell on you for a short time that attracts other Zombies and can be removed with water.\n* Fat Zombies explode when near death causing less player damage vs cop explosions, but greater block damage within a larger area and can puke on the player when close.\n* Snakes are now venomous and drop venom sacks which are used to make Anti-venom.\n* Custom Wandering hordes with unique infected animal groups\n\n## Zombie Bites and the Zombie Virus\n\n* The only way to catch the Z-Virus(Vanilla Infection) is to be bitten by an Infected.\n* The only way for a Infected to bite you is for them to first Grab you.\n* Stun is changed to a Grab (same buff just renamed and given a new Icon for immersion).\n* Your chance to be Grabbed by an Infected is based on your current Health, Stamina, Fatigue and Diet level.\n* Once Grabbed you can delay an Infected from biting you by 1 seconds with any melee hit to their head.\n* If bitten by an Infected you will catch the Z-Virus and receive a Bite Wound.\n* If the Z-Virus infection reaches 100% your character will die(Dead Dead!) and you will not be able to re spawn and must start a new character\n* Once you receive a Bite you will also get a Bleed that can be treated as normal. To remove the Bite you must cook a Metal/Steel Pipe in the Campfire and with it Cauterize the Bite. After you Cauterize the Bite you will have a Cauterized Bite Wound that you will need to treat with a Plant Salve. After applying Plant Salve you will need to treat the bite with a Bandage. After some time the bandage will get dirty and need reapplying. Do all this successfully and you will heal your Bite Wound, fail to do any of these steps and you will receive a wound.\n\n## Recipes\n\n* Tons of added recipes from new foods, weapons, [clothes](https://7daystodiemods.com/tag/7-days-to-die-clothing/) and so on\n* Existing recipes adjusted in materials and/or quantity of materials needed\n* Removed Jar Recipe. Only found in loot\n* All foods that use jars now return them\n* Smelters use molds again\n* Workstations can accepted many tools\n* Bullet crafting requires a Bullet Press\n* Gun Crafting requires Gun Tools\n\n## New Systems\n\n* **Dead is Dead** – There is no bottom to wellness.The player loses 10 wellness every time they die and when they run out of wellness they can not spawn back into the game alive with that character.\n* All clothes found in loot are low quality but can be collected to learn how to craft them\n* Leather must be cured by cooking it in a pot with Brain Matter and Coal Lumps.\n* Cured Leather can then be dried on a Drying Rack.\n* Separate Repair Kits for Weapons (Weapon Repair Kit) and Machines (Scavenged Parts)\n* Small Engines for Bikes are made of parts\n* Tires can be scrapped for Scrap Rubber\n* Scrap Rubber can be melted in a campfire to produce Melted Rubber for crafting.\n* When Torches are placed they require fuel to burn and give off heat\n* Added Planks, Sticks, Large Logs, Small Logs, Branches\n* Added special meats from animals Bear Flank, Pork Belly, Venison Tenderloin\n* Bullet crafting requires a Bullet Press\n* Added advanced resources for harvesting from many world Blocks (i.e.: Stoves, Desk, Fridge, Beds, Chairs and many more)\n* Added many new scraping abilities\n* Clean water can be used to splash water on your head to cool you off for a short time\n* Added over 100 “Junk Items” to spice up looting. Junk items are everyday items found in loot that can be scraped for raw materials or used in crafting.\n* Bladed Weapons are no longer repaired but re sharpened with Sharpening Stones that can be looted or made in the forge.\n* Bladed Weapons have increased dismemberment chance but dull quicker.\n\n## Tools\n\n* Removed ability for stone axe to repair and upgrade.\n* Stone [tools](https://7daystodiemods.com/tag/7-days-to-die-tools/) do little damage against Metal\n* Iron tools do little damage against Steel\n* Removed Harvesting Tools quality levels\n* Added Screwdriver – Good for dismantling and harvesting Electronics\n* Added Mason Hammer – Good for dismantling Flagstone and Bricks Blocks, harvests Bricks and Cobblestone\n* Added Concrete Sledge -Good for dismantling Concrete Blocks, harvests Concrete Mix and Rebar\n* Added Welding Torch – Good for dismantling Steel Blocks, harvests Steel Sheet Metal\n* Added Crowbar – Used for picking up world blocks the player can not craft.\n* Removed the ability for Buckets to pick up and place water\n\n## Workstations List\n\nAll workstations can now use anything in the tool slots. Increased Ingredient list to 6\\. Increased Crafting Ques to 5.\n\n* Mortar & Pestle – For grinding chemicals and medical items. Can also be used as a tool.\n* Stone Mill – For grinding objects into powder.\n* Anvil – For beating metal into shape. Can also be used as a tool.\n* Torches – Need fuel for light and heat\n* Campfire – For cooking and basic chemistry\n* Research Desk – For reverse engineering unknown crafting schematics\n* Armor Table – For crafting clothes and armor.\n* Dry Rack – For drying Skins, Firewood and creating Seeds from crops.\n* Workbench for crafting – For crafting objects\n* Chemistry Workbench – For crafting advanced medicines and chemicals\n* Fermentation Barre – For making Mead and Beer\n* Cement Mixer – For crafting stone building materials\n* Methane Producer – For producing Methane Bombs\n* Steel Forge – For smelting Steel, Bulletproof Glass and Plastics\n\n## Workstation Tools List\n\n* Anvil – Claw Hammer\n* Campfire – Stick, Cooking Grill, Cooking Pot, Frying Pan, Blender\n* Armor Table – Sewing Needle, Anvil, Leather Needle, Wrench, Welder, Small Loom\n* Workbench for crafting – Claw Hammer, Anvil, Bullet Press, Mortar & Pestle, Screwdriver, Welder, Wrench, Gun Tools, Tool & Die Set, Saw\n* Chemistry Workbench – Beaker, Lab Equipment, Still, Mortar & Pestle\n* Steel Forge – For smelting Steel, Bulletproof Glass and Plastics\n\n## Buffs\n\n* Added new Limp debuffs. When a player reaches 10% health they will limp. Heal up above 10% health to heal the Limp\n* Added new Fast Travel buff when you are traveling on a paved road. When on a paved road you will travel 20% faster. This Does apply to animals and zombies.\n* Smoking reduces hunger but has a slight stamina drain and lowers wellness slightly.\n\n## Wound Buff System\n\nAnything that can attack you has a chance to hurt you. Get hurt too much and you will be wounded. To heal the wound you will have to treat it and maintain it until it heals. This wound system has 5 stages.\n\n1. The first is Bruised and needs no tending to or maintaining it will heal on its own as long as you are not hurt more.\n2. The Second is a Small Wound. When you receive enough damage to get a Small Wound you will also get a Pain Buff that can be cured with a Pain Killer. To Heal the Small Wound you need to use a Bandage on it. After some time the bandage will get dirty and need reapplied. Do all of this successfully and your small wound will heal into Bruised. Fail to keep the wound clean or receive to much more damage from attackers and it will progress to a Wound.\n3. The Third is a Wound. When you receive enough damage to get a Wound you will also get a Sprained Leg Buff that can be cured with a Splint. To Heal the Wound you need to use a First Aid Bandage on it. After some time the First Aid Bandage will get dirty and need reapplied. Do all of this successfully and your Wound will heal into Small Wound. Fail to keep the wound clean or receive to much more damage from attackers and it will progress to a Sever Wound.\n4. The Forth is a Severe Wound. When you receive enough damage to get a Sever Wound you will also get a Gash Buff that can be cured with a Suter Kit. To Heal the Sever Wound you need to use a Sanitized Bandage on it. After some time the Sanitized Bandage will get dirty and need reapplied. Do all of this successfully and your Sever Wound will heal into a Wound. Fail to keep the wound clean or receive to much more damage from attackers and it will progress to an Infected Wound.\n5. The Last stage is an\n\n## Nutrition\n\nWhen the player starts and learns their profession their Nutrition stat is set to the highest level “Healthy Diet”. There are 3 good stages to Nutrition.\n\n* At “Good Diet” you will start to gain wellness and health effects from [foods](https://7daystodiemods.com/tag/7-days-to-die-food/).\n* At “Balanced Diet” you will begin to heal faster from injuries like broken or sprained leg, dysentery and other injuries.\n* At “Healthy Diet” when you are full you will receive a slow heal over time. It takes 7 game days for the full Nutrition buff to fade completely.\n\n### Bad Nutrition\n\nThe longer it has been since you had “Good Diet” the more your Malnourished Stat will start to stack up. Once all good Nutrition buffs fall off you will no longer receive wellness or health from food or drink. There are 3 stages to Malnourished.\n\n* At “Bad Diet” you will get hungry faster and lose stamina.\n* At “Vitamin Deficiency” you will take longer to heal from injuries; get hungry faster; lose stamina and move slower.\n* At “Malnourished” you will take longer to heal from injuries; get hungry faster; lose stamina; move slower and slowly start to lose wellness.\n\n## Completely New Skill and XP System\n\n* All quality items have their own crafting skill and crafting a quality item only gives [XP](https://7daystodiemods.com/tag/7-days-to-die-experience/) toward its own crafting skill. So crafting Stoneaxes only gives XP for improving Stoneaxes.\n* Many added Perks\n\n## Important Note\n\nMod is available in SP/Coop and Server play. It is not finished and is still in active development and open to suggestions, feedback and bug reports. At this time no assets may be used for redistribution.\n\n* Test Server  \n   * IP – 14.1.30.218  \n   * Port. – 28716  \n   * PW – In DL ReadME\n\n## Changelog\n\n**A20.5 Build 1.05**\n\n* Added Sticky Sap to pine tree drops\n* Fixed Microwave pickup with Crowbar\n* Changed Profession, Hobbies and Trait Books to spoil quickly.\n* Fixed Dead Rat scrap amount\n* Changed all apparel and clothing mods recipes to be crafted on the Workbench\n* Changed Awning Shapes recipes to the Workbench\n* Updated TS Logo\n\n**A20.5 Build 1.04**\n\n* Added chance for Nuts and Bolt to drop from blocks that drop Iron Sheet Metal\n* Added the ability for Ovens, Microwave, Collapsed Generator, Battery Bank and Solar Bank to be picked up using a Crowbar\n* Added Fan Belt drop chance to more vehicles\n* Changed Barbed Wire Fence to slow more, last longer and hurt less\n* Removed Orange Seed drops from Orange Trees\n* Fixed Simple Wood Frames pickup\n* Fixed Malnourished Description\n* Lengthened the Dead is Dead reset buff to hopefully help with clearing if there are hiccups respawning\n* Fixed Laceration Right Leg, Arm and Foot not clearing on Dead is Dead\n* Increased Trader buff range to help with trader rep\n* Re Hid the Trader Rep Buff\n* Removed tool belt messages for Medical Infections\n* Fixed Vitamins giving Wellness when they should not\n* Changed Wellness gain to not work if you have a Medical Infection\n* Fixed items spoiling to Moldy Sandwich\n* Changed Mushrooms and Grubs to not scrap to meat\n* Removed Screwdriver Mold\n* Fixed Iron and Steel Sheet Metal scrapping\n* Fixed new crop names\n* Fixed Simple Frames names\n* Fixed Machine Gun Action skill leveling quickly after Dead is Dead\n* Fixed Building skills descriptions to show actual needed xp for lv 2\n* Removed Screwdriver Mold and Large Bed recipes\n* Edited Watering Can and Barbed Fence recipe\n* Added Screwdriver crafting to Advanced Workstations\n* Changed Seeds sold at traders to new seeds\n* Updated TS Logo\n\n**A20.5 Build 1.03**\n\n* Fixed new crops growing stages and names\n* Fixed Seed Recipe Books not showing learned\n* Fixed Orange Tree harvest amounts and Farmer/Gardener amounts\n* Fixed Coconut Tree harvest amounts and Farmer/Gardener amounts\n* Fixed Simple Frames to be picked up\n* Fixed Diet Tutorial Quest not completing(for real this time he swear)\n* Decreased the time of the slowing effect of gore\n* Fixed Blueberry scrap item\n* Fixed Oven Repair Kit fixing Ovens\n* Fixed Trader Rep not increasing\n* Fixed reported spelling errors\n\n**[Download](https://github.com/SpiderJZMOD/TrueSurvivalA20/archive/refs/heads/main.zip)**  \nAlso available on the mod launcher!\n\nIf you appreciate Spider’s work and you want to show support, use this [donate link](http://www.paypal.me/JohnZidar).\n\nIf you need help, you can use this [support link](https://discord.gg/nEVTcMMf5x).\n\n**Credits:** Spider",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/SpiderJZMOD/TrueSurvivalA20/archive/refs/heads/main.zip",
      "Version": "v19"
    },
    {
      "Info": "Also available on the mod launcher!",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modAuthors": [
    "Spider"
  ],
  "modTags": [
    "7 days to die clothing",
    "7 days to die drinks",
    "7 days to die experience",
    "7 days to die farming",
    "7 days to die food",
    "7 days to die quests",
    "7 days to die skill points",
    "7 days to die stamina",
    "7 days to die starting items",
    "7 days to die tools",
    "7 days to die trader",
    "7 days to die weapons",
    "7 days to die zombies"
  ]
}