{
  "modURL": "https://7daystodiemods.com/uma-zombies/",
  "modCreatedTime": "2020-12-27T00:37:00+00:00",
  "modLastUpdatedTime": "2021-05-19T09:14:56+00:00",
  "modName": "UMA Zombies",
  "modImages": [],
  "modShortDescription": "These are zombie versions of the vanilla UMA archetypes. Since the archetypes already exist in the vanilla code, they are less likely to break between updates.",
  "modDescription": "These are zombie versions of the vanilla UMA archetypes. Since the archetypes already exist in the vanilla code, they are less likely to break between updates, and should be relatively easy to fix if they do.\n\nThis is an XML-only mod, so it should be EAC compatible, and is almost certainly compatible with other mods that add other [zombies](https://7daystodiemods.com/tag/7-days-to-die-zombies/) or NPCs.\n\nNote: Khzmusik did not do a version of Madmole, since he would never, ever die and turn into a zombie.\n\n## Changelog\n\nUpdated for A19.\n\n## Known Issues\n\n* The melee physics for UMA zombies is off. If you ragdoll them with a melee weapon, they can go flying far off into the distance.\n* This is an issue with all UMA zombies in 7D2D. (It is also an issue with Snufkin’s UMA zombies.) For non-UMA zombies, the ragdoll “flying distance” seems to be set by the “Mass” property in the entity class. But this property does not seem to have any effect on UMA zombies.\n\n**Warning:** UMA entities are not as performant as vanilla zombie entities. It is probably best if there are no more than a handful of them in the world at the same time.\n\n**[Download](https://gitlab.com/karlgiesing/7d2d-a19-modlets/-/archive/master/7d2d-a19-modlets-master.zip?path=khzmusik_UMA_Zombies)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/24348-a19-khzmusiks-modlets/).\n\n**Credits:** [Khzmusik](https://7daystodiemods.com/tag/khzmusik/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/karlgiesing/7d2d-a19-modlets/-/archive/master/7d2d-a19-modlets-master.zip?path=khzmusik_UMA_Zombies",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/24348-a19-khzmusiks-modlets/",
  "modAuthors": [
    "Khzmusik"
  ],
  "modTags": [
    "7 days to die zombies",
    "Khzmusik"
  ]
}