{
  "modURL": "https://7daystodiemods.com/vehicle-madness/",
  "modCreatedTime": "2022-02-02T19:26:00+00:00",
  "modLastUpdatedTime": "2022-04-25T18:33:40+00:00",
  "modName": "Vehicle Madness",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-vehicle-madness-additional-screenshot-1c.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-vehicle-madness-additional-screenshot-2c.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-vehicle-madness-additional-screenshot-3c.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2022/02/7-days-to-die-vehicle-madness-additional-screenshot-4c.jpg"
  ],
  "modShortDescription": "Guppycur's awesome original concept for Vehicle Madness started way back in the early days of A17 and now continues for 7 Days to Die in A20.",
  "modDescription": "Guppycur’s awesome original concept for Vehicle Madness started way back in the early days of A17 and now continues for 7 Days to Die in A20, Guppy handed over the reigns of the project to Ragsy in A18 to rework and develop further the visions they had for vehicle systems in the game.\n\n## About Vehicle Madness\n\n* Features 58 vehicles (New Physics and particle effects).\n* 80 Plus wreck variants (some may look familiar)\n* All new custom vehicle sounds.\n* Find working spawned [vehicles](https://7daystodiemods.com/tag/7-days-to-die-vehicles/) in the world (Custom code was written by HaidrGna and adapted for Vehicle Madness with his kind permission)\n* Find Repairable vehicles versions in the world\n* Harvest wrecked vehicles to salvage parts for crafting vehicles on the VM Workbench (Balancing feedback required as always).\n\nYou will come across a variety of different types of vehicles in the world that may be working or have repairable versions you can find to fix up!\n\nThere will still be spawns of the ‘lower end’ Vehicles in the world but the ‘high end’ stuff like military vehicles or other customs will be a case of either find the repairable version and repair it or craft it with harvested parts from vehicle wrecks on the VM Workbench.\n\nIf your vehicle becomes damaged during gameplay you can repair it as normal with the vanilla repair kit.\n\nA vehicle repair kit consists of the following parts that can be found in the world or crafted at appropriate levels on the Workbenches:\n\n```\n<ingredient name=\"CarFootpump\" count=\"1\"/>\n<ingredient name=\"CarBatteryChargerUnit\" count=\"1\"/>\n<ingredient name=\"VMToolRachetSet\" count=\"1\"/>\n<ingredient name=\"HotwireKit\" count=\"1\"/>\n```\n\n…and a specific tiered tool. Wrench for lower tier repairs, Ratchet for mid tier vehicles and Impact Hammer for High tier vehicles. Dont forget to take some fuel with you as you will need it for the repaired vehicle.\n\nIf you dont come across a vehicle you like subject to rwg pot luck, you can still craft the vehicles by salvaging parts from vehicle wrecks such as:\n\n* Transmission (and damaged version)\n* Engine (and damaged version)\n* Seats (and damaged versions)\n* Carburetor (and damaged version)\n* Battery (and damaged version)\n* Alternator (and damaged version)\n* Chassis (and damaged version)\n* Body parts (doors, hood, trunk and Fender and bumper)\n* Full Vehicle Madness Style Wheels\n* Wheel Rims\n* Damaged wheels\n\nThey have adopted a system where 2x Damaged Parts go towards making 1 good working part along with other smaller items in the recipes.\n\nTires that you find on the ground? They can be picked up! But, they are NOT WHEELS. You must find a wheel rim, these can be obtained by salvaging the vehicles in the world (you may be lucky and get full wheels and a wheel rim during salvage), or you can make a fully functional wheel by adding tire and wheel rim and using the air compressor tool in the Auto-Workbench. There are some full damaged wheels you can collect on the roads to make a full wheel using their 2x damaged = 1 good system.\n\nTo make the VM Auto-workbench you need to first be able to craft ‘normal workbenches’ as you will need one to build the full Auto workbench along with a [car](https://7daystodiemods.com/tag/7-days-to-die-car-mods/) lift (craftable), a compressor and a ratchet set (lootable in world)… you can then, after learning how, assemble the various vehicle parts into the various assemblies to build your custom vehicle.\n\n* Car body assembly (requires a fully body kit)\n* Electrical subsystem assembly\n* Car engine assembly\n* Car Body Kit\n* Vehicle Madness wheel set\n\nVanilla vehicles can be crafted using the existing vanilla parts as before but on the VMWorkbench (Except bicycle and Minibike), they have left in vanilla items to maintain vanilla compatibility for other vehicle mods that do use vanillla resources as part of thier builds, vanilla parts however will not fit the custom vehicles system build method.\n\nGas will be at a premium, this means you may have to raid gas stations or find a damaged gas tanker vehicles on the road or make your own.\n\nGas is more expensive to make in this version…\n\nThey recommend that you use a bigger backpack mod such as this one as there are many parts to collect: [KhaineGB’s Bigger Backpack Mod](https://7daystodiemods.com/bigger-backpack-mod-60-96-slot-with-without-food-water-bar-on-hud/). Also Recommend Khaines vehicle fixes for [sound](https://7daystodiemods.com/vehicle-sound-fix/) and [entity damage](https://7daystodiemods.com/vehicle-damage-patch/).\n\n## SMX Compatibility Patch for Vehicle Madness\n\nFor those who want use the SMX suite of Hud enhancements with VM, just unzip file to your desktop and place the folder inside called ZMXuiCPVMPatch into your Mods folder. Not needed if you dont use SMX at all. [SMXhud](https://7daystodiemods.com/smxhud-the-hud-replacement-mod/), [SMXmenu](https://7daystodiemods.com/smxmenu-the-menu-replacement-mod/), [SMXui](https://7daystodiemods.com/smxui-the-ui-replacement-mod/) by Sirillion for Alpha 20.\n\n## The Vehicle Madness Current Team\n\n* Ragsy\n* ActiniumTiger\n* Magejosh\n* Eric Beaudoin\n\n### A20 Testers\n\nA special mention to the testers and thanks for the feedback and bug reports.\n\n* Magejosh\n* Mr.Devolver\n* Furious Ramsey\n* R.U.I.N.S\n\n## Acknowledgements\n\nMany thanks to the various modders and contributors helping them make Vehicle Madness better since Alpha 17, without whom this would not have been possible…\n\n* Guppycur – Original creator of VM and all round support on the development path so far.\n* Marcus – Sourcing a few hard to find vehicle models and tracked vehicle delvelopment.\n* Telric – For some vehicle fixes in blender and his help on the buffs system…\n* HaidrGna – Spawning system code and general support on development.\n* Mumpfy – ‘The Texture Guru’ for texture reworks for the MotoGuppy bike, NPC Mod van and the Ragsy n Tiger Van (plus his original texture work on A17 version).\n* Random Person – Texture work on the original VM in A17\n* Bdubyah – Donating the first wrecked vehicle pack for beta 1.1 thats still part of VM today and his support.\n* DUST2DEATH – Support feedback and original Development of VM in A17 with Guppycur and the original team. Also thanks to valdifer for the Spanish Translations for Vehicle Madness Beta 1.1 and Beta 2.0 feel free to take the current localizations and add more languages. Thanks also go to MikeyUK for adding the missing world entity localisation for Beta2.0 and some work improving Icons.\n\nOthers who have been involved of whom he may have forgotten, and rest of the ‘Crew’ on Guppy’s Modding Discord for the support along the way.\n\n**More to come…**\n\n* A Dedicated [POI](https://7daystodiemods.com/tag/7-days-to-die-prefab/) for Automotive Repairs. This will be a separate add on made by Guppycur.\n* New tire fitting station and car lift system.\n* Update and improve vehicle models or replace with better models over time.\n* Add tracked vehicles into the mix…\n\n## Changelog\n\n**Beta 2.0**\n\n1. **_(new)_** Pushed a small fix to Gitlab today if you need it… no restart required just a vehicles xml seating change.  \n   1. Seating fix for Tactical Jeep.  \n   2. Passenger seat fix for Vanilla trucks (Mo Power, Working Stuffs and the Ambulance)  \n   3. Also updated the link for the SMX Compatibility patch for users who want to use Sirillions SMX.\n2. Fix for TFPMotorcycleRepairTool recipe.\n3. Added a compatibilty patch for Vehicle Madness for those that want to use the SMX custom hud and UI, many thanks to Sirillion for his help on the patch. Its on Ragsy’s private webspace at the moment… will push to his Gitlab at some point soon.\n4. Ragsy has pushed the update for the recipes to GitLab. No restart is required for this fix.\n5. Pushed a quick hotfix fix for the VM workbench UI.\n6. Added a lot more New Vehicles into the mix… bringing the total to 58 for ultimate variety.\n7. More wreck variations 80+.\n8. Added 30 + Repairable Vehicles that you can repair on roadside with special kits, dont forget to take some fuel with you.\n9. 20+ custom vehicles that may or may not spawn in the world with the luck of RWG.\n10. Crafting these new vehicles is still an option at the VM Workbench for those harder to find vehicles.\n11. New Vehicle Sounds applied for all vehicles.\n12. Loot overhaul inline with A20 system (as usual feedback much appreciated on this area).\n13. Their own particle systems for exhausts and vehicle damage.\n14. Reviewed and updated storage sizes and vehicle speeds\n15. Apocaliptic Style textures for the rustic used look\n16. Recipe changes for crafting to help with vanilla engine shortages in the original version.\n17. Added more deco stuff to collect on roads…\n18. More wrecks in world specifically on the country roads and reduced loot to balance out the numbers.\n19. Support for vehicle mods on all vehicles except the cosmetic option as these vehicles are all custom made textures. Some vehicles have seating mods but not all (example Military Truck has 8 fixed)\n20. Numerous of the the original vehicles have had brake lights added and some addition headlights where needed.\n21. Added a few decorative advertising boards to world… these can be harvested.\n22. Vanilla Vehicles now require the VM Vehicle WorkBench to build them except the minibike and bicycle.\n23. Revisited the vehicle damage scales on blocks… Targeted individual blocks now and adjusted some down and some more added… (like for instance vehicles ran into and stopped dead on mailboxes and cactus and so on.. vehicles will not destroy any wood on bridges anymore This system is going to be replaced with vehicles that have individual profiles at some point).\n24. Adjusted all vehicles to have lower degredation so when you hit 25% damage level particles are triggered… so be careful and try not too crash too much 🙂\n25. Reworked vehicle physics in-line with vanilla settings.\n26. Making gas is more expensive and requires more oil shale to craft your own gas.\n27. Some vehicles will attach parts/vehicles from player inventory when you get in them, Bicycle – Motorcycle – engines ect ect… these are only on the ‘Pickup style vehicles or open trucks but not all and is still WIP.\n28. Added recipes to make the ‘repair kit’ parts on a workbench if you dont find enough of them in the loot.\n29. Changed some stack sizes to help with looting vehicle parts if you do not wish to use the bigger back pack mods.\n\n**Beta 1.1**\n\n1. Added various new wrecks created by bdubyah for the ultimate salvage variation (There is only 1 vanilla sedan in chain as required by some POI’s and all others are now custom).\n2. Tweaked some vehicle speeds and camera positions and some storage on the big vehicles\n3. Increased amount of wrecks on roads and in biomes to provide more resources.\n4. Experimental block damage changes\n5. Added Quad to world spawns and reduced spawns very slightly (feedback on this will be required as catering for server vs single player).\n6. Added compressor to EMS and Military loot options, increased probabilities in automotive and rare automotive loot as were too rare before.\n7. Removed damaged motorcyle part2 from spawn (will add more motorcycle variant wrecks at some point)\n\n## Important Notes\n\n* You are not allowed to extract and alter any of the assets in this mod in any way without first gaining permission, these assets must not be used in any venture that attempts to make money out of modding\n* This is an Overhaul mod in modlet form and is required on both Client and Server as with other mods that add new assets.\n* Overhaul Modders can use this modlet overhaul as a recommended add-on if you wish but leaving the core files of vehicle madness intact.\n* A brand new game save is required as the mod overhaul adds a lot of new blocks in the game and changes existing ones too! Failing to start a new save game will break your existing save so be warned up front!\n* If you want to include any of his vehicle mods or other mods in a ‘mod overhaul’ please do him the courtesy of asking for permission first… when given you must give the due credit to himself and any other modders that may be credited under the “Credits & Additional Credits” sections if any. Also you are not allowed to extract any unity files without his permission either, if there has been an alpha change then wait and files will be updated for the new alpha version as soon as he possibly can. Thank you!\n\n**[Download](https://gitlab.com/Ragsy2145/ragsy-a20-modlets/-/archive/main/ragsy-a20-modlets-main.zip?path=VehicleMadness_Overhaul_Beta2.0)** Vehicle Madness  \n**[Download](https://gitlab.com/Ragsy2145/ragsy-a20-modlets/-/raw/main/ZMXuiCPVMPatch.zip)** SMX Compatibility Patch\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/21143-vehicle-madness-mod/).\n\n**Credits:** [Ragsy2145](https://7daystodiemods.com/tag/ragsy2145/)",
  "modDownloadURLs": [
    {
      "Info": "Vehicle Madness",
      "URL": "https://gitlab.com/Ragsy2145/ragsy-a20-modlets/-/archive/main/ragsy-a20-modlets-main.zip?path=VehicleMadness_Overhaul_Beta2.0",
      "Version": "v19"
    },
    {
      "Info": "SMX Compatibility Patch",
      "URL": "https://gitlab.com/Ragsy2145/ragsy-a20-modlets/-/raw/main/ZMXuiCPVMPatch.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/21143-vehicle-madness-mod/",
  "modAuthors": [
    "Ragsy2145"
  ],
  "modTags": [
    "7 days to die biomes",
    "7 days to die car mods",
    "7 days to die prefab",
    "7 days to die stack size",
    "7 days to die truck mods",
    "7 days to die vehicles",
    "Ragsy2145"
  ]
}