{
  "modURL": "https://7daystodiemods.com/video-players-mod/",
  "modCreatedTime": "2022-05-18T17:40:00+00:00",
  "modLastUpdatedTime": "2022-05-18T17:43:30+00:00",
  "modName": "Video Players Mod",
  "modImages": [],
  "modShortDescription": "This A20 mod now combines several A18/A19 mods (Video Players, Billboards, and Theater Screens).",
  "modDescription": "This A20 mod now combines several A18/A19 mods (Video Players, Billboards, and Theater Screens).\n\nYou must connect a wire to each device using the wire tool to activate it, then you can remove that wire.\n\n## Description\n\nIntroduces mass media into the game. Be sure to active each of these with a wire using the wire tool.\n\n### Billboards\n\nBillboard01 is a mechanical billboard that shows 3 unique images on each side of the billboard. This is a single texture sheet which you can edit in a graphics program then import into unity and the reexport.\n\nBillboardVideoMP4 is a electronic version, that will play 12 video clips in rotation. Like 12 TV channels. Best part is you can replace the 12 video files in the mods/resources folder with your own. In default, video0 is static, 1 is a cartoon clip, and 3 a classic video. All the rest are static.\n\n### Theater Screens\n\nAdds a flat theater screen into the game. Designed with POI makers in mind, this screen is 16:9 format and 8×5 blocks in size.\n\n### Video Players\n\nVideoTV is a large tabletop television that will play 12 video clips (or entire movies) in rotation.\n\nTVWall is a wall mounted version setup to replace the existing small wall mounted televisions. Its currently set to replace 20% of them but that can be adjusted in xml. Some will be on by default, playing static, but otherwise are broken. Replace video0 with a public service disaster message of your choice.\n\nIf you put down a land claim block you can pick these up by holding the E key.\n\n## Known Issues\n\nSometimes the sound plays for a few seconds if you enter the game next to a billboard that has sound. This is because Xyth need to active them on start as he can’t use code to do that. Minor annoyance.\n\nYou need to activate a newly placed video device by attaching a wire to it, but you can immediately remove that wire. That is because he’s using the switch class and it expects a wire to the switch. No way to fix that without code.\n\nVideos need to be in .mp4 format. There is a limit to how much memory can be allocated to video, so 12 long movies may well crash the server.\n\n## Installing\n\n**Note:** Seems to work on Dedi, if you follow the install instructions, otherwise it will crash your server! You were warned.\n\n### Single Player\n\nNormal mod install. Drop the mod into your Mods folder and your done. If you swap out any of the videos, they must have the exact same name and file extension as the one you’re replacing. Those names are hard coded. It won’t like strange .mp4 encoding so keep it simple. Encoding help can be found in the [old thread](https://community.7daystodie.com/topic/8400-xyths-a19-a17-modlet-collection/).\n\n### Dedi Experimental (Read Carefully)\n\nFor some reason, the dedicated servers default startup file named startdedicated.bat has a Unity startup parameter -nographics. -nographics means dont load various shaders and the video decoding files needed to render video. So your job is to edit that file before starting up the dedi.\n\nOn about line 69 of that file you will see this line:\n\n```\nstart %GAMENAME% -logfile \"%LOGFILE%\" -quit -batchmode -nographics -configfile=serverconfig.xml -dedicated\n```\n\nChange it to:\n\n```\nstart %GAMENAME% -logfile \"%LOGFILE%\" -quit -batchmode  -configfile=serverconfig.xml -dedicated\n```\n\n**Failure to do this properly will crash your dedi hard and fast.**\n\n## Changelog\n\n* **_(new)_** Uploaded new version. Drive-in screens shader changed for full brightness at night. Increase sound range to 100M on Drive-in screen, 50M on smaller theater screen. Increased activation distance in xml on drive-in screen to 30M so you don’t have to fly up to the screen to change movies.\n* Added a “DriveInScreen” block to the mod. A couple of issues: The screen is 21x10x1, but the xml multidim property is set to (10,10,1) because values larger than 15 or so causes “Not a parent” red errors in the console. The other is because the screen is so big, its very difficult to place, so use helper column of blocks to find the center then remove those after its placed. Even then, the screen wont actually place unless you get just the right angle. This game doesn’t like huge blocks, so you will need some patience to place this screen.\n* Fixed recipe. Rebuilt Theater Screen so no offset is needed. Pushed to repo. Tested on current version of the game. No warnings or errors found.\n\n**[Download](https://github.com/7D2D/A20Mods/raw/main/VideoPlayers.zip)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/27926-a20-videoplayers-mod/).\n\n**Credits:** [Xyth](https://7daystodiemods.com/tag/xyth/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://github.com/7D2D/A20Mods/raw/main/VideoPlayers.zip",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/27926-a20-videoplayers-mod/",
  "modAuthors": [
    "Xyth"
  ],
  "modTags": [
    "Xyth"
  ]
}