{
  "modURL": "https://7daystodiemods.com/wasteland-weapons/",
  "modCreatedTime": "2020-06-18T13:28:00+00:00",
  "modLastUpdatedTime": "2021-04-16T16:09:32+00:00",
  "modName": "Wasteland Weapons",
  "modImages": [],
  "modShortDescription": "This 7 Days to Die mod adds in basic, craftable Fallout 4 style pipe guns, along with some custom weapons. Lincoln's Repeater, Lever Action Rifle and more.",
  "modDescription": "This 7 Days to Die mod adds in basic, craftable Fallout 4 style pipe guns, along with some custom [weapons](https://7daystodiemods.com/tag/7-days-to-die-weapons/). Now requires the [Nuka Colas Mod](https://7daystodiemods.com/nuka-colas-mod/) to be installed as well. Has to be installed on both servers and clients.\n\n## Pipe Guns\n\nFairly weak and has a low durability. Currently still has tiers, but stats/mod slots are the same no matter what.\n\n* **Pipe Pistol:** Simple homemade pistol. Low durbility. Regular 9mm only.\n* **Pipe Rifle:** Crude rifle. Starts out as a short barrel. Low durability. Regular 9mm only.\n* **Pipe Shotgun:** Pipes and some bolts. The Shotgun starts as a basic short barrel, single shot version which you can craft into a long barrel version at a workbench. There is also a craftable extended mag mod for them which adds a 4 round revolver-style rotating cylinder. Regular shells only. Reload animations for the Shotguns are in, but the hands can’t be fixed AFAIK.\n\nThe pipe guns will break once they degrade!\n\n## Current Weapon Mods Available\n\n* **Oil Filter Suppressor:** Usable on the Pipe Pistol and Rifle, and most vanilla weapons. Can be wrenched from cars and in some loot. Big though, and limits ADS effectiveness. Slight loss of range and damage and also adds a small increase to degradation of the weapon due to increased blowback.\n* **Extended Mag:** For the Pipe Pistol and Rifle. Doubles the pistol and rifle capacity, also actually shows on the gun, unlike vanilla. Only works on pipe guns.\n* **Long Barrel:** Versions for both the rifle and shotgun. This adds a longer barrel, increasing effective range. Makes hip fire more unwieldy, and also slightly increase weapon degradation. Works as a mod for the rifle, used as a recipe ingredient for the shotgun.\n* **Cylinder Mag:** Can be used on long or short pipe shotguns. Ups the shell capacity to 4 rounds.\n* **Homemade Flashlight:** Custom attachment for all WW guns, and most vanilla weapons. Simple flashlight and duct tape. Not as effective as the regular weapon light mod.\n\n## Legendary Guns\n\n* **Silent But Deadly:** Custom pistol. Comes with a silencer. Higher capacity.\n* **Long Distance:** Unique rifle. Has a 4x scope. Higher dismemberment chance.\n* **Firestarter:** Quality homemade shotgun. Single shot. Very high limb dismemberment. Accepts all shells and applies Dragon’s Breath to them.\n* **Lincoln’s Repeater:** .44 Magnum lever action rifle. Able to penetrate multiple targets. High dismemberment. Accepts 8x scopes.\n* **Maria:** 9mm. High capacity. Moderate dismemberment. Accepts a reflex sight.\n* **Pew Pew:** Higher damage and magazine capacity.\n* **AER-15 Prototype:** Unique prototype variant of the laser rifle. Higher damage per beam and shoots 5 rounds in one trigger pull. Hip fire behaves more like a shotgun while aimed fire allows heavy damage to a single target.\n\nCan be found in certain loot. Also can be a quest reward. Very rare. Legendary weapon won’t permanently break.\n\n## Energy Weapons\n\n* **Laser Pistol:** Rare military sidearm. Can be rarely found or crafted once a schematic is read. Accepts all laser attachments except the scope. Uses Energy Cells. Ammo has small chance to cause “Disintegration”.\n* **Laser Rifle:** Rare military firearm. Can be rarely found or crafted once a schematic is read. Accepts all laser attachments except the scope. Uses Microfusion Cells. Ammo has small chance to cause “Disintegration”.\n* **Plasma Pistol:** Experimental military weaponry. Can be rarely found or crafted once a schematic is read. Uses Plasma Energy Cells. Ammo has small chance to cause “Disintegration”.\n* **Plasma Rifle:** Experimental military weaponry. Can be rarely found or crafted once a schematic is read. Uses Plasma Microfusion Cells. Ammo has small chance to cause “Disintegration”.\n\nSchematics are rare loot or a quest reward.\n\n## Laser Weapon Mods\n\n* **Overcharged Capacitor:** Increases damage output as well as magazine size. Slight degradation increase.\n* **Laser Focuser:** Increase damage slightly. Moderate increase to Max Range and Damage Falloff Range. Slight degradation increase.\n* **Laser Splitter:** Increase damage slightly. Fires 2 beams at once. Slight spread when hip firing, but can be accurate when ADS firing. Slight degradation increase.\n* **Laser Scope:** Adds a scope. Only for the Laser Rifle. Slight damage increase. Works well with the Focuser.\n\n## Other Guns\n\n* **Railway Rifle:** If those puny bullets aren’t cutting it, craft this bad boy and show them who’s boss! Schematic only.\n* **FatMan Launcher:** Only available in loot. Launches any mini mukes you come across and maybe something else… Loot only.\n* **Lever Action Rifle:** Old rifle, chambered in .44 Magnum. Crafts with hunting rifle parts. Accepts 8x scopes. Unlocks with the Dead Eye perk, level 3, or schematic.\n* **Triple Barrel Shotgun:** Quality, custom shotgun. Good room clearing weapon. Unlocks with the Boomstick perk, level 3, or schematic.\n* **Heavy Sniper:** Old 7.62 military rifle. Comes with a scope. High damage, semi-auto. Unlocks with the Dead Eye perk, level 5, or schematic.\n* **Incinerator:** Highly modified military flamethrower. Uses custom ammo. Launches molotov-like projectiles. Schematic only.\n* **Flare Gun:** Survival flare gun. The gun itself it loot only but you can craft more flares.\n\nSchematics are rare loot or a quest reward.\n\n## Changelog\n\n* **_(new)_** Added in a Plasma Pistol and Rifle. They use Plasma version of the Energy and Microfusion Cells.\n* **_(new)_** Added a Flare Gun. The gun is loot only but you can craft flares yourself. Good lighting at night and can set zombies on fire hit by a flare.\n* Added Laser Pistol, Laser Rifle.\n* Added mods for Laser guns.\n* Energy Cells for the pistols, Microfusion Cells for the rifles. Each have a small chance to instantly kill the target(disintegration).\n* Unique variant of both the Laser Pistol and Laser Rifle.\n* Regular versions can be crafted after finding the schematics.\n* Tweaked the Incincerator’s ammo projectile. Looks better now.\n* Reworked some loot.\n* Added a recipe for the Triple Shotty.\n\n**For A19:** [The Wasteland](https://7daystodiemods.com/the-wasteland/)\n\n**[Download](https://gitlab.com/bdubyah/Mods---A18/-/archive/master/Mods---A18-master.zip?path=Wasteland%20Weapons)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/11875-bdubyahs-modlets/).\n\n**Credits:** [Bdubyah](https://7daystodiemods.com/tag/bdubyah/)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/bdubyah/Mods---A18/-/archive/master/Mods---A18-master.zip?path=Wasteland%20Weapons",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": true,
  "modForumURL": "https://community.7daystodie.com/topic/11875-bdubyahs-modlets/",
  "modAuthors": [
    "Bdubyah"
  ],
  "modTags": [
    "7 days to die weapons",
    "Bdubyah"
  ]
}