{
  "modURL": "https://7daystodiemods.com/windsurfer-mod/",
  "modCreatedTime": "2021-06-12T20:57:59+00:00",
  "modLastUpdatedTime": "2022-04-25T18:34:26+00:00",
  "modName": "Windsurfer Mod",
  "modImages": [],
  "modShortDescription": "Early game vehicle that is gone with the wind! Place the Windsurfer on/in water in a 'shallow water' area that has fairly flat ground underneath.",
  "modDescription": "Early game vehicle that is gone with the wind!\n\n## Launch\n\nPlace the Windsurfer on/in water in a ‘shallow water’ area that has fairly flat ground underneath.\n\n## Controls\n\n* Steering is A and D as per vanilla settings… mouse is for looking around only and has no affect on steering a water vehicle.\n* Space bar and c control the up and down angles (same as a gyro) which you may occasionally need to adjust slightly as you travel on water otherwise you may sink, this version seems very stable as its a slower speed water [vehicle](https://7daystodiemods.com/tag/7-days-to-die-vehicles/).\n* W is forwards and S is slow down/reverse. If you let go of w and shift (Turbo) then the Windsurfer slowly comes to a stop, pressing S will slow the Windsurfer down more quickly this replaces spacebar as the brake key.\n\n## Crafting\n\nAn early game vehicle which is craftable in a standard workbench with no progression needed at the cost of gathering resources to build it, it will help early game if you actually find a ‘working workbench’ and allow you to make the windsurfer a lot sooner.\n\n## Other Info\n\nTo anchor the Windsurfer and stop it drifting away use C and spacebar to level the Windsurfer till it stops drifting.\n\nParticle system added… this can be toggled via the ‘F’ key (headlight function)\n\nThe Windsurfer can be picked up into inventory, if you sink it at any point, although be careful if you sink it too far away from the shores as it could be a long swim back. No storage option on this vehicle.\n\n**Important Note:** If you want to include any of his vehicle mods or other mods in a ‘mod overhaul’ please do him the courtesy of asking for permission first… when given you must give the due credit to himself and any other modders that may be credited under the “Credits & Additional Credits” sections if any. Also you are not allowed to extract any unity files without his permission either, if there has been an alpha change then wait and files will be updated for the new alpha version as soon as he possibly can. Thank you!\n\n**[Download](https://gitlab.com/Ragsy2145/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=Ragsy_WindSurfer)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/14070-water-vehicle-modlets/).\n\n**Credits:** [Ragsy2145](https://7daystodiemods.com/tag/ragsy2145/), ActiniumTiger (for new texture for Windsurfer)",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://gitlab.com/Ragsy2145/alpha-19-modlets/-/archive/master/alpha-19-modlets-master.zip?path=Ragsy_WindSurfer",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/14070-water-vehicle-modlets/",
  "modAuthors": [
    "Ragsy2145",
    "ActiniumTiger (for new texture for Windsurfer)"
  ],
  "modTags": [
    "7 days to die boat",
    "7 days to die vehicles",
    "Ragsy2145"
  ]
}