{
  "modURL": "https://7daystodiemods.com/ztensitys-unnecessarily-beautiful-but-immersive-ubbi/",
  "modCreatedTime": "2022-03-04T04:43:00+00:00",
  "modLastUpdatedTime": "2022-03-04T04:49:12+00:00",
  "modName": "Ztensity's Unnecessarily Beautiful But Immersive (UBBI)",
  "modImages": [
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-1.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/03/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-2a.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-3.jpg",
    "https://7daystodiemods.com/wp-content/uploads/2021/01/7-days-to-die-ztensitys-unnecessarily-beautiful-but-immersive-ubbi-additional-screenshot-4.jpg"
  ],
  "modShortDescription": "Unnecessarily Beautiful But Immersive is a new edition of Hernan's Unnecessary But Beautiful mod.",
  "modDescription": "Unnecessarily Beautiful But Immersive is a new edition of Hernan’s Unnecessary But Beautiful mod that was originally released on December 19th, 2019.\n\nOriginally wanting to add a Barista and a large TV, Hernan spent months designing code, textures, maps, 3D models and later compiling the files together to present a multitude of house buildables. Ranging from a variety of TVs, lamps, Kitchen appliances, cabinets and decorations to pool furniture, Bathroom amenities and beyond, he released Unnecessary But Beautiful. With the help of modder Hellsmoke a couple months later, recipes were created, which allowed players to finally craft these items for themselves in February of 2020.\n\nJump ten months later and I found myself inspired to take on my first major project with one goal in mind: increase immersion and make a somewhat fresher experience for players at the same time. With the permission of Hernan himself in early December, I’ve been working hard since for the last four weeks to rebuild this mod for compatibility with the latest build of the game.\n\nNow, I continue to present the rebuild titled, Unnecessarily Beautiful But Immersive!\n\n## WHAT DOES THIS DO & WHAT DOES THIS ADD?\n\n### Crafting\n\nAll items from UBBI can be crafted at a workbench. To craft any [lights](https://7daystodiemods.com/tag/7-days-to-die-lights/), players must first have their Intellect perk at lvl six and their Advanced Engineering perk at lvl three. Alternatively, players can find the “Basics of Electricity Schematic” at a trader or in the world to unlock the lights early.\n\nPlayers can use the wrench line of tools to receive additional resources when destroying most of the items, while also receiving a small number of resources back when using just fists and/or weapons to destroy them instead.\n\nPlayers can repair items crafted by using specific sources from cloth fragments, wood and glass blocks to forged iron, concrete mix and leather.\n\n### Lights & Technology\n\nAll lights, TVs, a PC, laptop, fireplace, sound bar, doorbell and shower head must be turned on by using a wire tool.\n\nThe shower head is usable with water visuals and [sound](https://7daystodiemods.com/tag/7-days-to-die-sound-mod/) effects. To increase immersion and add usefulness to it, the shower provides up to 30 minutes of increased benefits, which include increased stamina regeneration, increased running speed and cold resistance.\n\nThe doorbell and sound bar have specific sounds, which may alert zombies and other players in multiplayer nearby.\n\n### Miscellaneous Additions\n\nThe garden bed, small bed and big bed can be used as a bedroll.\n\nThere is a single closet door and a secret closet [door](https://7daystodiemods.com/tag/7-days-to-die-doors/) that takes up one block for people playing with one block crouch.\n\nInspired by the POI version of the vanilla chimney, a new altered Chimney can be placed with new chimney effects that emits smoke more realistically.\n\nStorage options are now a feature attached to almost all cabinets, select bathroom items and others like a fridge.\n\nIs this mod somewhat unnecessary? Potentially likely, just as Hernan originally stated when he first released his original version. However, is it beautiful? If I have to ask myself, I’d say everything he created was absolutely aesthetic and now with lots of hard work, there is so much more increased immersion!\n\n## WHAT’S THE SAME?\n\nThis mod still contains 235 items that were originally carefully crafted by Hernan. Almost everything you loved about the previous version of the mod still remain.\n\nHowever, in my efforts to increase immersion, I did tweak a lot of code, remove a lot of behind-the-scenes things and remove a few items such as a couple offset items, the “RG Gamer” items, the experimental floor speaker and a ceiling light top item due it not working with its light it was intended to extend.\n\nAll of these familiar and unnecessarily beautiful things that somehow worked in the zombie apocalypse before, but are more immersive than ever, now work with the latest build of the game seamlessly. Who knew you could have such nice things while trying to survive every 7 days!\n\n## UPDATING OLD VERSION / CLIENT VS. SERVER SIDE ONLY?\n\nThis modlet is a completely new rebuild and will require you to completely remove the “UnnecessarybutBeautiful” folder in your “Mods” folder. Then put this modlet into your “Mods” folder. You should be able to drop this into your pre-existing game (even if you had the Hernan’s version), although a new game is preferred. You will just have to likely rebuild some things you had already crafted. To avoid issues, I would recommend removing the items in your base provided by Hernan’s original modlet first, then placing this into your “Mods” folder.\n\nIf you have never had Hernan’s original Unnecessary But Beautiful mod, you will have no problems adding this mod into your pre-existing game. Just download and drop it into your “Mods” folder and you should be good to go! Most updates also will not require new games. If an update should require a new game, I will make sure to include that in the update notes!\n\nFinally, this modlet can be utilized in multiplayer. However, in order to achieve this, the mod is required to be installed on both the server side and the client side since the mod utilizes more file types than xml and Localization. This means that if you intend to play online with a friend or multiple people, each person absolutely has to have this mod installed in their “Mods” folder.\n\n## COMPATIBILITY?\n\nThe 3.0.0 version of Unnecessarily Beautiful But Immersive (UBBI) may not be compatible with most overhauls. However, UBBI should be compatible with most modlets, including UI mods, such as Sirillion’s SMX.\n\nI will no longer provide compatibility support for various overhauls due to lack of time. After collaboration with Dwallorde, the alpha 19 version of UBBI is embedded into [War of the Walkers](https://7daystodiemods.com/war-of-the-walkers-mod/)!\n\n## HOW TO’S\n\nTo provide a little assistance, I thought that it would be helpful to provide a few tips that may help with using this mod in your playthroughs. See below!\n\n* How to Search for Recipes to Craft: In order to craft, you must be at the workbench. Once at a workbench, you can easily find each type of recipe you want to craft by searching for their name like “Kitchen,” “Bedroom,” “Bathroom” or simply “HN.” Despite the name changes I have provided; it is still possible to search by “HN” and it is actually the easiest way to find the recipes.\n* How to Turn on Lights, TVs, PC & Sound Bar: After placing an item like a “Floor Lamp,” you must have a wire tool in hand. Next, you must activate the wire tool’s rope on the lamp by pressing e, disconnect by pressing e and then viola, you should now be able to turn your item on/off.\n* How to Unlock Lights: Just like vanilla gameplay, in order to unlock the ability to craft lights added by this mod, you must first attain the perks Intellect lvl 6 and Advanced Engineering lvl 3.\n\nIf you want more information, refer to the Read Me in the modlet, which will provide a little more detail. Also refer to additional videos, which will preview the features shared [via YouTube](https://www.youtube.com/channel/UCEp9RXCi5fyLowfKIBXdI9A), which you can find on the videos tab!\n\n## LOCALIZATION FYI\n\nA localization has been put in for “useSwitchLightOff” and “useSwitchLightOn” to make all lights, TVs, fireplace, sound bar and computers turn “on / off” immersively. This will also affect vanilla lights as well or anything else using the “switch class.”\n\nFor the time being, anything using a wire tool will say “turn off” / “turn on.” This means this mod will likely affect other mods that utilize the “switch class” that are higher in the list in the “Mods” folder.\n\nIf you are making a modlet and you don’t want your object to read “turn on/off” and you want it to have the vanilla wording, try making it load after this modlet utilizing a ZZ as the first two characters of name.\n\n## CHANGELOG\n\n### UPDATE 3.0.0!\n\n#### INSTALL/UPDATE REQUIREMENTS\n\nSince this update is designed for Alpha 20.3 compatibility, a new game is recommended for players using the old version of UBBI. If this is your first time playing with UBBI, you should be able to seemlessly install this mod into your game’s mod folder.\n\nTesting with overhauls has not been made and will not be. Using UBBI with an overhaul is at your discretion.\n\n#### WHAT’S REMOVED\n\nUI elements have been removed. This will allow for quicker updates in the future and better compatibility with overhauls and UI modlets such as the widely popular and personally supported SMX series. I have stripped the Stove, Oven, Cooktop, Toaster, Coffe Maker and Microwave to being purely aesthetic now.\n\nI have removed sound files, UI images and other select Unity files to clean ths mod, as they were no longer needed. I have also adjusted blocks.xml, items.xml, localization.txt and recipes.xml per these changes. I made sure to remove the loot.xml as well, as that is no longer needed.\n\nI completely removed electronic components and the “Shamway Cooking Spring.” These were only in the game for the working appliances. Simultaneously, I have removed the ability to use car batteries, electric parts and electronic components as fuel sources in the same vain.\n\n#### WHAT’S ADDED\n\nI have enabled storage options for all items that makes sense, such as cabinets, bathroom items and others. This was accomplished by changing one line in blocks.xml for each item and adding an additional line as needed.\n\n## CREDITS\n\nMost assets including the UNITY3D Files for resources, PNGs for UIAtlases, block coding and 12 original localized files were all created, designed and published first by Hernan (HN). With his permission, I have presented a newer edition/rebuild of the mod with new features, more in-depth immersion, better compatibility with the latest build and further accessibility across all websites.\n\nThe recipes file was originally designed and coded by modder Hellsmoke. Hernan uploaded this on 2/12/2020 as an optional download. I am now including this as part of the new edition of Unnecessary but Beautiful to not only keep it updated for all players, but also make the localization available for further immersion to make recipes feel like part of vanilla game.\n\nThe UI seen in any pictures or videos from my showcase is provided by Sirillion’s SMX mod pack found [here](https://7daystodiemods.com/tag/7-days-to-die-smx-mods/). His mod is a staple in my load order and only enhances the appearance of my mods further. Thank you Sirillion for your fantastic work!\n\n## SHOUTOUTS\n\nI want to finally give a huge shoutout to everyone who helped me get this huge project finished, including Xyth, Guppycur, Bdubyah, Ragsy, Mumpfy, Snufkin, TSBX, Zorro, Khaine, saminal, Artjom, sphereii, wrathmaniac, InnocuousChaos, chiko, Haidr’Gna, Beardman, K1NGER1988 and Ozmods via Guppy’s Unofficial Discord for 7 Days to Die’s modding community. Full thank you’s are in my Read Me guys and I encourage you guys to check that out. I truly appreciate all your guys help!\n\n**[Download](https://drive.google.com/u/0/uc?id=13_3_E3b6nzxGUiTddXHI010bkib_-SjA&export=download)**\n\nThe forum topic of the mod is [here](https://community.7daystodie.com/topic/23102-ztensitys-unnecessarily-beautiful-but-immersive-ubbi/).\n\n**Credits:** [Ztensity](https://7daystodiemods.com/tag/ztensity/), Hernan, Hellsmoke",
  "modDownloadURLs": [
    {
      "Info": "Download",
      "URL": "https://drive.google.com/u/0/uc?id=13_3_E3b6nzxGUiTddXHI010bkib_-SjA&export=download",
      "Version": "v19"
    }
  ],
  "modPotentialyOutdated": false,
  "modForumURL": "https://community.7daystodie.com/topic/23102-ztensitys-unnecessarily-beautiful-but-immersive-ubbi/",
  "modAuthors": [
    "Ztensity",
    "Hernan",
    "Hellsmoke"
  ],
  "modTags": [
    "7 days to die doors",
    "7 days to die lights",
    "7 days to die sound mod",
    "7 days to die windows",
    "Ztensity"
  ]
}